[
    {
        "url": "https://straitstimes.com/business/bt-future-of-finance-uob-building-community-through-art",
        "date": "2024-12-11",
        "content": "UOB is a leading patron of art in Asia, championing Southeast Asian art and artists across the region over the past four decades. What is the connection between art and banking? How has this shared history shaped UOB’s business today?\nLee Kim Siang sits down with Christine Ip, head of group strategic communications and brand, UOB, to find out.\nYour browser does not support iframes, but you can use the following link:\nLink\nSynopsis:\nThe Business Times\nBranded Podcasts; finely curated, intelligent, thought provoking content for decision-makers. Inspired by the newsroom of your trusted partner.\nFollow on audio apps Apple Podcasts, Spotify and Google Podcasts, or Google Home smart speaker devices. Produced by\nThe Business Times\n, SPH Media.\nThis episode of Future of Finance podcast is presented by UOB.\nHighlights:\n02:11 History of UOB’s Painting of the Year Competition\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n03:45 Art’s role in UOB Heartbeat, the bank’s CSR programme\n05:29 The impact of UOB’s Painting of the Year competition\n06:54 Collaboration with customers and artists\n08:01 Strengthening relationships with customers through art\nMore about:\nChampioning Southeast Asian Art -\nhttps://www.uobgroup.com/uobandart/index.html\nHosted by: Lee Kim Siang (\nkimsiang@sph.com.sg\n)\nWith Christine Ip, head of group strategic communications and brand, UOB\nEdited by: Emily Liu &amp; Claressa Monteiro\nProduced by: Emily Liu\nEngineered by: Joann Chai Pei Chieh\nExecutive producer: Claressa Monteiro\nA podcast by BT Podcasts,\nThe Business Times\n, SPH Media\n---&nbsp;\nFollow Future of Finance podcasts:\nChannel:&nbsp;bt.sg/btbrpod\nApple Podcasts:&nbsp;bt.sg/bpap\nSpotify:&nbsp;bt.sg/bpsp\nGoogle Podcasts:&nbsp;bt.sg/bpgo\nWebsite:&nbsp;bt.sg/brpod\nFeedback to:&nbsp;\nbtpodcasts@sph.com.sg\nDo note: This podcast is meant to provide general information only. SPH Media accepts no liability for loss arising from any reliance on the podcast or use of third party’s products and services. Please consult professional advisors for independent advice.&nbsp;\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/st-editorial/integrated-hospitals-point-to-the-future",
        "date": "2024-12-11",
        "content": "When Singapore’s newest integrated acute and community hospital,\nWoodlands Health, welcomed its first patients on Dec 22\nwith the opening of its specialist clinics and 40 community hospital beds, it underscored two important points. The first, of course, was the importance of adopting an integrated care model. The second was the continuing need to disperse top-level healthcare facilities across Singapore. On the first account, Woodlands Health is an ambitious exercise, being a facility with acute and community hospitals sharing the same building so that patients can be seamlessly moved from acute to step-down care with the same doctors in charge. The 7.7ha facility will fully open the rest of its services, including the emergency department and acute wards, in May 2024. It will eventually have 1,000 acute and community beds, and almost 400 beds in its long-term care facility, with the capacity to expand to 1,800 beds to meet future needs.\nThe convenience of integration is undeniable for the sick. When it is suitable to transfer patients, they would merely cross the corridor to the community hospital wards to continue being cared for, as opposed to moving into a completely different facility. Woodlands Health attests to the evolving logic of building community hospitals in the first place. According to the Ministry of Health (MOH), community hospitals provide medical services for patients who require a short period of continuation of care, usually after their discharge from acute hospitals. The types of care available at the community hospitals include medical, nursing and rehabilitation care. Patients can make the transition from acute to rehabilitative care seamlessly so as to begin their rehabilitation journey early.\nAlready a subscriber?&nbsp;\nLog in\nRead the full story and more at $9.90/month\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nST One Digital\n$9.90\n&nbsp;\n$9.90/month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nUnlock these benefits\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to you\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/community-lawn-movable-platforms-among-winning-ideas-for-former-tanjong-pagar-railway-station",
        "date": "2024-12-11",
        "content": "SINGAPORE – A community lawn in front of the main building of the former Tanjong Pagar Railway Station, as well as movable platforms linking its existing ones, is among ideas that the Urban Redevelopment Authority (URA) is studying for the site’s redevelopment.\nThese suggestions were part of a winning proposal in a competition URA held between April and June to get ideas for the station’s future use.\nRail Life, the winning proposal submitted by Singaporean architectural assistant Kenneth Chiang, beat 92 other entries from around the world, including proposals from firms based in Australia and Britain.\nURA said on Sept 17 that Mr Chiang’s proposal “breathes new life into the site by innovatively integrating heritage and modern architectural elements to introduce a variety of gathering spaces for the community”.\nOn April 22, it\nlaunched the ideas competition for the site\n– the second such competition in nine years – with the intention of getting proposals that will guide the development of detailed plans to turn it into a community hub.\nOn Sept 17, it launched a design competition for the Rail Corridor – this time, for a community node that will be established at a sheltered space below the Queensway Viaduct. The winning team will be appointed to provide professional consultancy services for the node’s development, for a fee of $570,000.\nAs for the former station in Tanjong Pagar, URA said it will “assess the ideas from the competition and distil key concepts from the feedback, ideas and proposals gathered (for the station) over the years, and study their feasibility for implementation”.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nOpened in 1932, the station was the southern terminus for the Keretapi Tanah Melayu railway line within Singapore that stretched from Kranji to Tanjong Pagar, and was gazetted a national monument in 2011 – the year that the line was decommissioned.\nTanjong Pagar station has been closed since 2016 for repair works, as well as the construction of an extension to the Circle Line, and will be repurposed for public use after 2028.\nWhile acknowledging that there is no guarantee that his ideas will be implemented, Mr Chiang said he hopes that any future use of the station will take on his proposal to have a variety of programmes and activities on offer so that “everyone can feel they have a stake in something” when they visit.\nHis proposal considered five types of activities – community, arts and culture, culinary, health and wellness, as well as fitness.\nA basketball court and a volleyball court, for instance, can appeal to sports buffs, while the arts and culture programming, which he suggested could be sited in the main station building, would include a heritage gallery and a handicraft workshop.\nMr Chiang, 29, who works for a local architecture firm, said he was particularly excited by the prospect of making the station’s two existing platforms more event-friendly.\nThe narrow platforms are currently separated by train tracks, making them unsuitable for larger-scale events.\nTo overcome this, he suggested that mobile platforms be installed between the two existing ones on the tracks.\nMovable platform bridges could link the existing station’s narrow platforms, creating a continuous space for events. PHOTO: KENNETH CHIANG\nHe said the mobile platforms make it possible to host a large event if all the platform pieces are linked, or multiple smaller-scale events at the same time if the platform pieces are separated.\nHe said he entered the competition with “no intention of winning” and took it as an opportunity to exercise his creative skills.\nPlacing second in the competition was PTW Architects, which proposed that stormwater collection ponds be built at the western end of the station, which extends towards the rest of the Rail Corridor. The third-placed entry was submitted by London-based firm Acme Space.\nReceiving a special mention was a submission by Mr Tim Tang Ho Yin and Ms Christina Kong Ka Yu of Hong Kong. They proposed a ring-shaped skywalk to be built in the station’s main building for visitors to observe its iconic wall murals up close.\nA proposed atrium skywalk within the central hall offers visitors a unique view of the wall murals. PHOTO: TIM TANG HO YIN AND CHRISTINA KONG KA YU\nSelected entries for the former Tanjong Pagar Railway Station ideas competition, as well as for the Queensway node design competition, will be featured at an exhibition in 2025.\nThose interested in submitting proposals for Queensway have until Nov 7 to do so. Details are on\nsia.org.sg/queensway-node\nMore On This Topic\nRail Corridor’s Buona Vista node now open; ideas sought for former Tanjong Pagar Railway Station\nNorthern stretch of Rail Corridor opens to offer 21km of green trails\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/community/youth-policy-forum-interactive-financial-literacy-guides-simplified-recycling-labels-youth-driven-solutions-national-youth-council",
        "date": "2024-12-11",
        "content": "If Mr\nMuhammad Firdaus Kordi\ncould travel back in time, he would go back to 1989 – the year Pulau Semakau was conceptualised as Singapore's first offshore landfill.&nbsp;\nKnowing what he knows today, Mr Firdaus would sound the alarm about the landfill's impending capacity crisis, hoping to spark earlier action on recycling and waste reduction.\nBut the 32-year-old, along with others in his generation, was not born when this environmental decision was made. Now, as young adults, they inherit a landfill filling faster than anticipated and a nation producing high levels of waste.\nWhile Mr Firdaus and his peers may not have a time machine, they have a powerful alternative: their voices.\nAs part of the Youth Panels led by the National Youth Council (NYC) and supported by the Ministry of Culture, Community and Youth, Mr Firdaus joined almost 120 young Singaporeans aged 15 to 35 in shaping policies that tackle some of the most pressing issues for their generation.&nbsp;\nAfter months of rigorous discussions, research and collaborative effort, their hard work culminated in the\nYouth Policy Forum on Aug 24\n. There, these youths presented their carefully crafted recommendations to Prime Minister and Minister for Finance Lawrence Wong, as well as Minister for Culture, Community and Youth and Second Minister for Law Edwin Tong, demonstrating that they are determined to shape Singapore's future.\nSome 1,000 young Singaporeans took part in the Youth Policy Forum, either as panellists or as members of the public. PHOTO: NATIONAL YOUTH COUNCIL\nYouth in action\nThe forum was an important milestone for the panellists. For the past nine months, they have balanced their work and school commitments while formulating recommendations on their respective focuses.\nAmong the presenters was Ms Wee Su-ann, representing the #LifeHacks panel. Since November last year, her group has been meeting monthly to tackle the critical challenges that youth face, against the backdrop of rising cost of living concerns.\n“I was really heartened to see that there were so many people who were invested enough to take the time to come all the way to the Youth Policy Forum to listen to us present and find out more about what the panel was working on,” she says.&nbsp;\n“We were a little nervous about how our recommendations would be received, especially since the cost of living is such a sensitive and personal topic, but it was valuable to have the chance to interact and understand the thoughts of those at the forum regarding our ideas and to know how we can improve.”\nThe other three panels are\n#JobHacks, which focuses on employment opportunities\n,\n#TechHacks, which tackles ways to counter online harms on social media\n, and\n#GreenHacks, which looks at recycling\n. Each panel comprises around 30 members.\nThe Youth Panels’ recommendations at a glance\n#LifeHacks on financial literacy:\nAn interactive Financial Literacy Excellence (FLEX) Guide that provides personalised and consolidated recommendations on the steps youths can take to reach their financial goals; and a Starter Savings Plan to support youths and lower-income Singaporeans to build emergency savings to cover at least three to six months of expenditure.\n#JobHacks on employment opportunities:\nProvide youths with a comprehensive roadmap to learn about careers and opportunities in South-east Asia; connect youths to overseas Singaporean networks; and increase accessibility and availability of meaningful opportunities in South-east Asia.\n#TechHacks on digital well-being:\nConduct an annual survey to monitor the state of online harms among youths on social media; develop a lifecycle-based model to support youth in understanding threat vectors and intervention points; introduce a multi-stakeholder approach to enhance accountability of social media platforms to its users; and recognise youth as a discrete stakeholder in shaping the digital space by giving them a seat at the table when discussing relevant policies.\n#GreenHacks on recycling:\nSimplified Recycling Labels to overcome existing recycling barriers caused by complex and technical symbols; introducing segregated recycling bins and/or waste bags to optimise the collection of recyclables; and engaging the community on good recycling practices and increasing access to information.\nFor Ms Wee and #GreenHacks panellist Mr Firdaus, two key factors played the biggest part in ensuring progress from ideas to policies: prioritising solutions considering the bigger national context that includes multiple stakeholders, and embracing diversity during the problem-solving process.&nbsp;&nbsp;\nHow to tackle ‘mammoth’ problems?\nThe main challenge faced by the #LifeHacks panel was how to effectively address the “mammoth problem” of cost of living concerns, says Ms Wee, a lawyer.\n“Almost everyone is affected by the rising cost of living and people are affected in so many different ways,” says the 26-year-old.\nThe panel’s passion for solving diverse problems led to an abundance of ideas, but this meant that for every one good idea presented, a thousand and one others were discarded.&nbsp;\n“Our recommendations went through many different iterations and forms before getting to where they are today,” adds Ms Wee.\nMr Kwa Chin Lum (in light blue, second from left) and other government agency representatives with #LifeHacks panellists. PHOTO: NATIONAL YOUTH COUNCIL\n“We started by researching a wide range of issues – housing, healthcare, lower-wage workers and financial literacy. Initially, we were overwhelmed by the breadth of the issue. A turning point came when we spoke to university students and gained two key insights: youth often don’t think about financial planning until it’s urgent, and they don't know where to start,” says Ms Wee.\n“We saw an opportunity to empower people with tools to reach their financial goals, which could address some of the challenges of rising costs.”\nThe panel’s ideas underwent several rounds of refinement after various focus group discussions and engagements with NYC and other government agencies. They considered three key questions: How does the solution allow youth to take action to reach their financial goals? How will it be implemented? And how will it be better than existing solutions?\nThe process was not without setbacks. One of their solutions was not well-received in the focus group discussions. “We were quite discouraged,” Ms Wee admits. “But this led to a breakthrough. During one of our workshops,\nwe came up with a prototype for our first solution\nand also reworked the rejected solution into our second solution\n.”\nInside the policymaking process\nThis iterative process and ability to adapt ultimately shaped the #LifeHacks panel’s recommendations. This includes an interactive Financial Literacy Excellence (FLEX) Guide that provides personalised and consolidated recommendations on the steps young people can take to reach their financial goals.&nbsp;\nOne of the agency representatives the #LifeHacks panel consulted, Mr Kwa Chin Lum, director (Fiscal Policy) at the Ministry of Finance, says that while the Government has various programmes to enhance financial literacy among young people, the “lived experience of the youths” is the best test of the programmes’ effectiveness.\n“We take the perspectives of youths seriously in policy, as they are ultimately our future. Giving them a direct voice is key because the youths bring something special to the process – that discontentment with the way things are, the optimism to change things for the better and the drive to make it happen,” says Mr Kwa.\nThe Ministry of Finance’s director (Fiscal Policy) Kwa Chin Lum addresses the #LifeHacks panellists during a context-setting session. PHOTO: NATIONAL YOUTH COUNCIL\nThis sentiment was echoed at the forum itself. “Prime Minister Wong was interested in the panels’ recommendations. For the #LifeHacks panel, he was particularly interested in understanding how youth save and manage their money, and how to support them better,” recalls Ms Wee.&nbsp;\n“Minister for Culture, Community and Youth and Second Minister for Law Edwin Tong expressed interest in the FLEX Guide. He shared that the guide’s value extends beyond youth, serving as a valuable resource for anyone seeking to improve their financial decision-making.”\nEmbracing diverse shades of green\nMr Firdaus on the #GreenHacks panel went through the same policymaking process as Ms Wee and youths from other panels. The environment and sustainability-focused panel prioritised recycling after discussions, research, and consultations with officials and industry stakeholders.\nTheir proposals are timely as Singapore’s household recycling rate for 2023 stagnated at its lowest point in over a decade, with just 12 per cent of all rubbish recycled.&nbsp;\nOne of the recommendations the #GreenHacks panel is suggesting is to introduce simpler labels on products to help households quickly figure out how to recycle or dispose of items properly.&nbsp;\nThe process by which the panel arrived at their recommendations was challenging, considering its diversity, according to Mr Firdaus. Participants for the four panels were chosen through an open call that attracted youth from various ages, ethnicities and expertise.\nMinister for Culture, Community and Youth and Second Minister for Law Edwin Tong takes a photo with the participants of the Youth Policy Forum on Aug 24. PHOTO: NATIONAL YOUTH COUNCIL\n“We come from different backgrounds, experiences and viewpoints. All of us have something to bring to the table, with new ideas and unique solutions,” says the Yayasan Mendaki executive.\nWhat helped them get from ideas to concrete policy recommendations was teamwork and embracing diversity during the problem-solving process, he adds.\n“Active listening, showing respect and empathy during our interactions fostered an inclusive, and supportive environment where everyone felt valued and heard,” says Mr Firdaus.\nHe put these qualities into action at the Youth Policy Forum. “Upon learning that I had been nominated to present, I initially felt a sense of nervousness and pressure. However, as the weeks progressed, my confidence grew as a result of thorough preparation and collaboration with my panel members,” he says.&nbsp;\nLooking ahead, the #GreenHacks panel have ambitious plans. Mr Firdaus says: “We plan to advance our recommendations through amendments to the Resource Sustainability Act.\n“We believe that legislating these recommendations will enhance recycling rates and reduce contamination by providing clearer information on recyclable products and improving waste segregation compared to the current commingled blue recycling bins.”\nMr Muhammad Firdaus Kordi (right) presenting the #GreenHacks policy recommendations to Prime Minister and Minister for Finance Lawrence Wong on Aug 24. PHOTO: NATIONAL YOUTH COUNCIL\nFresh eyes, fresh perspectives\nMr Firdaus, Ms Wee and their fellow panellists will spend the next couple of months collating feedback on their recommendations from government agencies, relevant stakeholders and the public.&nbsp;\nThey will then refine their recommendations and submit them to government agencies that will assess their applicability before identifying suitable platforms to respond.&nbsp;\n“We look forward to the feedback and improvements that we can work towards for the policy paper,” says Mr Firdaus.\nThe entire Youth Panel journey has enhanced his ability to engage thoughtfully with others, broadened his understanding of complex issues and inspired him to continue advocating for meaningful youth involvement in policymaking.&nbsp;\nMs Wee feels the same and encourages other young people to get involved.\n“The youth are experiencing life and encountering many systems for the first time – they are the freshest pair of eyes to pick out blind spots in society and where society can improve, and they have the passion and energy to make meaningful change,” she says.&nbsp;\n“Today, your voice is powerful and your participation can drive change,” says Mr Firdaus.\n&nbsp;\nCome forward and add your voice to help refine the Youth Panels’ preliminary recommendations.\nShare your thoughts, suggestions and insights here\n.",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/community/how-singapore-firms-get-future-ready-corporate-purpose-nvpc-company-of-good",
        "date": "2024-12-11",
        "content": "Understanding its potential to influence and empower the communities in which it operates has driven this Singapore apparel manufacturer to teach farmers’ wives to sew.\nHome-grown firm Ghim Li Group, which produces clothing\nf\nor major USA retailers and department stores, has a presence in several countries, including Fiji, where it initiated a training programme as part of a broader goal to help workers move out of the poverty cycle and improve the quality of life for their families.\nMs Felicia Gan, CEO of Ghim Li Group, says: “Our corporate purpose is about creating value, not just through our products but also through responsible and sustainable business practices, innovation, and a deep commitment to the communities we are a part of.”\nGhim Li Group started a social initiative in Fiji in 1995, working with farmers' wives to enhance their skills by teaching them sewing. PHOTO: GHIM LI GROUP\nThis is also why the firm is part of the National Volunteer and Philanthropy Centre’s (NVPC)\nCompany of Good\ncommunity, which seeks to partner, support and recognise businesses in Singapore as they make progress in their journey to do right, do good\nand\ndo well\n– beginning with corporate purpose.&nbsp;\nSingapore’s national grid operator, SP Group, is also dedicated to being a business for good and generating value for society. “Creating sustained impact in the community to uplift and improve lives is integral to our corporate strategy of empowering the future of energy. Being purpose-driven enables us to take a holistic and integrated approach to our business and community-building initiatives,” says Mr Stanley Huang, group CEO of SP Group.\nFor NVPC,\ncorporate purpose can be carried out in five impact areas\n: People, Society, Governance, Environment and Economic.&nbsp;\nBusinesses in Singapore can be recognised at a national level under NVPC’s Company of Good Recognition System, for their commitment to adopting corporate purpose and creating impact in these five areas.&nbsp;\nEnhanced from previous Champions of Good editions, the new Recognition System is designed to be inclusive towards companies at varying stages of their purpose journey, acknowledging their growing impact in contributing to a better shared future for Singapore.\nHarnessing the power of people\nOn the people front, Ghim Li Group and SP Group go beyond merely providing jobs. They are committed to prioritising their employees, focusing on developing talent, and ensuring that each individual is connected to a meaningful purpose in his or her work.\nThis is certainly one of the reasons why Ghim Li Group has managed to grow from a collection of six sewing machines in 1977 to an Asia-wide manufacturer of textiles and apparel that supplies some of the biggest US retailers today.&nbsp;\nWith operations in countries like Malaysia, Indonesia, Cambodia, Thailand, Brunei, Fiji and Guatemala, the company has always taken the initiative to make a lasting change by upskilling its people. “It was all about continuous education and exposure,” says Ms Gan, talking about the Fijian training programme, which started in 1995. “To date, we still have some of these Fijian associates working with us.”&nbsp;\nIn addition, the company actively promotes volunteerism through inclusivity, allowing employees to take the lead in these activities so that they feel genuinely engaged. Ghim Li Group also does its part to nurture the next generation by providing student internships and collaborating with universities to foster local talent in design.\nResponding to its employees’ affinity for environmental matters, Ghim Li frequently organises tree-planting activities to engage its staff. PHOTO: GHIM LI GROUP\nPutting people at its core is also central to how the SP Group runs. “At the heart of our purpose-driven business are our 3,700 employees,” says Mr Huang. “They uphold our values and priorities in safety, reliability and sustainability, while being multipliers of good in the community.”&nbsp;\nStaff enjoy a comprehensive workplace health and wellness programme, as well as continuous training and development to deepen their core competencies. They also get many opportunities to engage in volunteerism through the SP Group’s comprehensive network of funding and programmes that benefit the vulnerable in the community\n–\nfrom children to youths and seniors.&nbsp;\n“In 2022, our corporate social responsibility contributions totalled around $5 million in donations, sponsorships and volunteer manpower,” says Mr Huang.\nStaff engage with members of the Youth Guidance Outreach Services at the world's largest underground district cooling network at Marina Bay, a key sustainable energy solution engineered by SP Group. PHOTO: SP GROUP\nIntegrating sustainability across its operations\nEnhancing sustainability is also crucial for purpose-driven companies. Putting green practices into place is not just a way of reacting to growing consumer awareness and demand, it also benefits businesses by driving innovation, increasing cost savings and reducing waste.&nbsp;\nAs a manufacturer of apparel, Ghim Li Group is more than aware of the impact that the fashion industry has on the environment, which is why sustainability is embedded into its core purpose.&nbsp;\nIts approach is centred on developing eco-friendly products while continuously educating and encouraging consumers to adopt sustainable products and incorporate environmental responsibility into their personal lives. Constant innovation is a must, something it drives by engaging in joint research and development projects with academic institutions and start-ups.\n“We have a dedicated green team of more than 30 members and growing,” says Ms Gan, of a journey that started in 2016 when they became one of the pilot vendors of\na major USA retailer’s green initiative that encourages companies to cut emissions in the US. “We attained\ngold status\nin 2018, and that is being consistently maintained today.”\nAs part of its sustainability efforts, Ghim Li Group has installed a reverse osmosis plant at its fabric mill to recycle 30 per cent of its wastewater discharge. PHOTO: GHIM LI GROUP\nAs a leading utilities group in Asia Pacific, SP Group is forging the way ahead by providing\nlow-carbon, smart energy solutions for both business districts and residential townships. “We aim to strengthen the resilience, reliability and sustainability of our energy networks, building on\nnetwork capabilities,” says Mr Huang, of the company’s determination to incorporate more renewable energy sources into the grid.&nbsp;\nThis is seen in SP Group’s efforts as it works to install\nrooftop solar panels at 37 electricity stations by 2025, while operating the\nlargest and fastest electric vehicle network in Singapore and maintaining its position as Southeast Asia’s largest underground district cooling operator, a viable and proven solution that saves energy and reduces carbon emissions.&nbsp;\nThe company has also developed a suite of green digital solutions for building owners that integrate different systems and diverse data sources to create a seamless, sustainable utility management experience that works to reduce wastage and lower electricity consumption.\n“A multitude of opportunities lie in the evolving energy landscape,” added Mr Huang. “Being purpose-driven helps to rally and unite different stakeholders in decision-making, enabling businesses to make meaningful and sustainable contributions to the society, while enhancing the overall resilience and sustainability of the company.”\nBy integrating purpose into their strategies, companies such as Ghim Li Group and SP Group not only drive innovation but also significantly bolster environmental stewardship and community welfare. This approach fosters a virtuous cycle, enhancing the future for businesses, society, and the planet\n–\nproving that doing good is good for everyone.\nFind out how your organisation can be recognised at the national level as a Company of Good.",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/new-integrated-hospital-in-woodlands-opens",
        "date": "2024-12-11",
        "content": "SINGAPORE – Singapore’s newest integrated acute and community hospital, Woodlands Health, welcomed its first patients on Dec 22 with the opening of its specialist clinics and 40 community hospital beds.\nThe 7.7ha facility located at 17 Woodlands Drive 17 will fully open the rest of its services, including the emergency department and acute wards, in May 2024.\nIt will eventually have 1,000 acute and community beds, and almost 400 beds in its long-term care facility, with the capacity to expand to 1,800 beds to meet future needs.\nPublic hospitals in Singapore\nhave been facing a bed crunch,\nin part due to the lingering impact of the pandemic. The Ministry of Health (MOH) has set a target to add 1,300 beds by the end of 2023 to alleviate the situation.\nHealth Minister Ong Ye Kung,&nbsp;as well as Sembawang GRC MPs Poh Li San and Lim Wee Kiak, and Marsiling-Yew Tee MP Hany Soh, were given a tour of the hospital facilities such as the medical centre, which is now open to patients.\nThe outpatient rehabilitation gym at Woodlands Health. ST PHOTO: MARK CHEONG\nThose with conditions such as asthma and diabetes will be able to access specialist outpatient services at the medical centre. The allied health team can also provide rehabilitation services, including speech therapy, physiotherapy and occupational therapy.\nWoodlands Health is a facility with acute and community hospitals sharing the same building, so patients can be seamlessly moved from acute to step-down care with the same doctors in charge.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“When patients are suitable to be transferred, they would be crossing the corridor to the community hospital wards to continue their care, as opposed to moving into a totally different facility,” Dr Wong Kirk Chuan, the hospital’s chief operating officer, said at an earlier briefing on Dec 21.\nA medical centre with specialist clinics, as well as radiology, rehabilitation and pharmacy services, will be linked to the main hospital building via a bridge.\nA medical centre with specialist clinics as well as radiology, rehabilitation and pharmacy services will be linked to the main hospital building via a bridge. ST PHOTO: MARK CHEONG\nWoodlands Health’s long-term care tower includes the Ren Ci @ Woodlands nursing home and a senior care centre for 100 clients, and offers home care services. The home is designed to be dementia-friendly, with activities and programmes for such residents. The tower also houses a childcare centre, and an intergenerational garden to promote interaction between the young and old.\nWoodlands Health is the first public hospital to open with the integration of three national healthcare IT systems for electronic medical records, billing and pharmacy systems.\n“The consolidation would help harmonise workflow, data and reporting across the public healthcare sector, improve efficiency, and enhance patient experience by making clinical care more seamless,” said a hospital spokesman.\nLinked to Woodlands Health is Singapore’s largest therapeutic garden to date. The 1.5ha Woodlands Healing Garden was designed by the National Parks Board in consultation with the hospital.\nThe green space is segmented into four zones, and is meant to offer visitors and patients closer interaction with nature for mental, emotional and physical well-being.\nDr Nicholas Chew, chairman of the hospital’s medical board, said it will benefit patients, as hospitals can be stressful environments.\n“As we help patients recover on their physical journey, there’s often a need for them to recover on their mental health journey as well… People who can connect with nature do have better mental health outcomes,” he said.\nThe 1.5ha Woodlands Healing Garden was designed by the National Parks Board in consultation with the hospital. ST PHOTO: MARK CHEONG\nThe garden is also open to residents in the vicinity.\nSince planning for Woodlands Health began in 2015, the hospital has worked with community care providers in the north region to create an ecosystem of support for 600,000 residents.\nFor example, it set up 13 community health posts in the north-west region, which are touch points within the neighbourhood that will provide residents with easy access to health services. One of its aims is to make post-hospital recovery and chronic disease management more hassle-free.\nSpeaking at the Woodlands Health opening ceremony, Mr Ong detailed the results of Singapore’s efforts to expand its healthcare capacity.\nHe said he is confident that the\ntarget of hiring 4,000 nurses for the healthcare sector by end-2023\nwill be exceeded.\nHealth Minister Ong Ye Kung visiting community hospital patients at Woodlands Health on Dec 22. ST PHOTO: MARK CHEONG\nMr Ong also noted that two new polyclinics – one in Tampines North and\nanother in Sembawang\n– were opened in 2023. By 2030, there will be more than 30 polyclinics islandwide.\n“Hospitals take a longer time to build, but painstakingly, after a lot of hard work, we are seeing the first signs of expanding capacity, and it starts here at Woodlands Health campus,” he said.\nWoodlands Health has about 3,000 staff, and while the hospital was being built, they were assigned to other institutions like Tan Tock Seng Hospital and Khoo Teck Puat Hospital.\nWith the phased opening of Woodlands Health, about 600 staff have been transferred to the hospital, and more will move over batch by batch, said Mr Ong.\nHe added that 2023 has been a good year for MOH, with the roll-out of initiatives\nlike Healthier SG\nand efforts to reduce sugar intake in beverages and sodium intake in food.\nMore On This Topic\nFrom cooking classes to physio: Services you might not know exist at your local polyclinic\nThe Gist 2023: Singapore’s 5 most significant events in healthcare\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/companies-markets/amazon-belt-tightening-produces-strong-cloud-e-commerce-results",
        "date": "2024-12-11",
        "content": "SEATTLE\n– Amazon.com reported strong results that showed a company humming on all cylinders, a testament to its efforts to cut and reallocate costs and put the cloud computing and e-commerce giant on sounder footing.\nThe Amazon Web Services cloud division, which suffered record low sales growth in 2023, continued to regain momentum during the third quarter. The online retail operation, which sputtered coming out of the pandemic, grew unit sales by double digits. So did revenue at Amazon’s fast-growing advertising business.\nTotal third-quarter revenue increased 11 per cent to US$158.9 billion (S$210 billion), the company said on Oct 31 in a statement, exceeding estimates. Operating profit was US$17.4 billion, demolishing the average estimate of US$14.7 billion.\n“Amazon beat expectations in Q3 on the strength of the three pillars of its business: e-commerce, advertising and cloud services,” said Sky Canaves, an analyst at Emarketer.\nAmazon shares rose about 5 per cent in extended trading on Oct 31. The stock has increased 23 per cent in 2024.\nThe results show the fruits of chief executive Andy Jassy’s years-long push to cut costs and streamline Amazon’s logistics operation. That has given him room to spend heavily on the new data centres required for the boom in demand for artificial intelligence services.\nSpeaking to analysts on a conference call after the results, chief financial officer Brian Olsavsky said Amazon expects to devote a whopping US$75 billion to capital expenditures in 2024, the majority of which will go toward technology infrastructure. Mr Jassy said he expected the company to spend even more next year.\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nCloud unit revenue jumped 19 per cent to US$27.5 billion in the third quarter, in line with estimates. Operating income generated by the unit was US$10.4 billion, exceeding analysts’ average projection of US$9.12 billion.\n“People tend to get a little uptight when Amazon talks about ramped up spending, but they’ve got such a great track record of spending large sums of money and getting really good returns on that,” said Mr Brian Yarbrough, an analyst at Edward D. Jones &amp; Co.\nAmazon’s key cloud rivals, Alphabet’s Google and Microsoft, diverged sharply when they reported earnings earlier this week. Google posted quarterly cloud sales that grew more than analysts had projected, rising to US$11.4 billion, a 35 per cent increase from the year-earlier period. Microsoft, meanwhile, forecast slower quarterly cloud revenue growth, reflecting the company’s struggle to bring data centres online fast enough to keep up with demand for AI services.\nAmazon reported revenue from the online store unit increased 7 per cent to US$61.4 billion in the period ended Sept 30, while sales at the fast-growing advertising unit rose 19 per cent from a year earlier to US$14.3 billion.\nTotal operating expenses rose 7.2 per cent to US$141.5 billion – marking the seventh consecutive quarter that Amazon’s revenue increased at a higher rate than costs.\nThe Seattle-based company also projected strong growth in the holiday quarter ending in December. Operating income will be about US$18 billion, topping analysts’ average estimate of US$17.5 billion. Fourth-quarter sales will be as much as US$188.5 billion. Analysts, on average, projected US$186.4 billion, according to data compiled by Bloomberg. BLOOMBERG\nMore On This Topic\nAmazon workers ‘appalled’ by top exec’s full return-to-office remarks, urge policy reversal\nAmazon AWS CEO: Quit if you don’t want to return to the office\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/motoring/torque-shop-seat-belts-for-rear-passengers",
        "date": "2024-12-11",
        "content": "How important are rear seatbelts? Is it compulsory for passengers in the rear seat to wear them?\nThe rear seatbelts are part of the primary occupant restraint system in a passenger vehicle. They are indeed crucial in alleviating bodily injury in a traffic accident.\nIn Singapore, rear passengers are required by law to be belted up. Convicted first-time offenders can be fined up to $1,000 or jailed for up to three months. For repeat offenders, the penalty can be a fine not exceeding $2,000 or imprisonment for a term not exceeding six months.\nDuring a frontal collision, unrestrained rear-seat passengers are likely to be flung towards the back of the front seats, which are not designed to cushion a “speeding” human body.\nFacial injuries such as lacerations, broken nose and, in severe cases, blunt force trauma are not uncommon. Unbelted rear-seat passengers who wear spectacles have been known to sustain deep facial cuts.\nIn addition, the occupant of a front seat that is impacted by a rear-seat passenger can sustain secondary injuries.\nThe most disastrous cases are when rear passengers are thrown out of the vehicle during a rollover or a T-bone crash. A human flung out of a vehicle has a very slim chance of survival. Few have survived with fully recoverable injuries and even less fortunate are those who survive with debilitating paralysis.\nThe use of front seatbelts became compulsory in 1973, when all cars were required to have them as standard factory equipment.\nMost front-seat passengers, fortunately, do use their seatbelts. It is the rear seatbelt ruling that possibly ranks as the most flouted road traffic rule in Singapore.\nIt was mandatory for cars registered from 1993 to be equipped with rear seatbelts and for passengers seated in the back to be buckled up. This also means you are not allowed to carry four people in the back seat if the car has only three rear seatbelts.\nBoth the vehicle’s driver and passengers face penalties for not wearing seatbelts in a moving car.\nMore On This Topic\nTorque Shop: Car starter failure\nTorque shop: Wheels meant for a different make or model may not fit\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/wearing-your-seat-belt-gives-me-a-chance-to-save-your-life-ttsh-trauma-surgeon",
        "date": "2024-12-11",
        "content": "SINGAPORE – Belting up will not completely protect you from injury in a traffic accident, but you will be much less likely to suffer life-threatening injuries, a trauma surgeon said.\nAdjunct Assistant Professor Teo Li-Tserng, director of the Tan Tock Seng Hospital (TTSH) Trauma Centre, said the chances of an unbelted patient getting to a hospital alive after a bad crash is close to zero.\nProf Teo, who is also regional director of the Central Region Trauma Services under the National Healthcare Group, said many of these passengers are severely hurt by the time they reach the hospital, and some die on the spot.\nHe added: “Those who wear a seat belt may still get injured, but their injuries are usually not as immediately life-threatening. This gives them time to be transported to a hospital where they can be treated.”\nTTSH statistics paint a sobering picture.\nProf Teo said that since 2001, the percentage of unbelted accident patients at the hospital has been rising and consistently surpassed patients who were belted up.\nThe hospital admitted 12 rear seat passengers with moderate to severe injuries each year in 2022 and 2023.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nOf these, five were not wearing seat belts in 2022 and the figure rose to nine in 2023.\nTraffic Police statistics show the number of violations for failing to wear a seat belt, or wearing it improperly, have fallen recently.\nSuch violations went down from 5,863 in 2021, to 4,763 in 2022 and 3,559 in 2023.\nBut figures from the National University Centre for Trauma showed the number of traffic accident patients in the western region who were not wearing seat belts and got severely injured rose from 20 in 2022 to 25 in 2023.\nThe centre at the National University Hospital was launched in July and focuses on improving safety and trauma care for children, older adults and migrant workers.\nProf Teo said more rear seat passenger patients wore seat belts in 2009 – 60 per cent compared with 40 per cent who did not&nbsp;– after a nationwide reminder of Singapore’s seat belt laws.\n“This was transient. From 2011, the number of rear seat passenger patients who wore seat belts dropped precipitously to less than 20 per cent,” he added.\nProf Teo said he often sees unbelted patients suffer head, spinal and chest injuries. In more severe cases, they also suffer liver and spleen damage.\nAdjunct Assistant Professor Teo Li-Tserng said unbelted patients often suffer head, spinal and chest injuries. PHOTO: TAN TOCK SENG HOSPITAL\n“Unbelted patients tend to get flung around the vehicle. If they have severe brain and spinal injuries, these are not just life-threatening, but also lifestyle threatening.\n“Some of them end up in a permanent vegetative state after the accident.”\nProf Teo highlighted a recent case of an unbelted drunk front seat passenger who got into an accident while being sent home by a valet.\nHe said: “When the car crashed, the patient smashed against the windscreen and he suffered severe facial and spinal fractures.\n“He was also thrown forward and backwards in the car and sustained liver injuries.”\nThe patient is now dependent on his family members as he suffered personality changes due to a brain bleed. He is also wheelchair-bound for at least six months due to weak limbs.\nProf Teo said the simple act of wearing a seat belt can be the determining factor in whether a patient lives or dies in a serious accident.\n“Wearing your seat belt gives a trauma surgeon the chance to save your life. You need to make it to the hospital before we can help you.”\nThe doctor also urged parents to secure young children in car seats rather than carry them in their arms.\n“In the event of an accident, the child becomes a cannonball within a cabin. It’s a recipe for disaster,” he added.\nMore On This Topic\n‘I did not wear seat belt and can’t recall 15 years of my life after accident’: Former ICU patient\nS'pore PR fined $1,000 for not wearing seat belt properly during holiday in Australia\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/i-did-not-wear-seat-belt-and-can-t-recall-15-years-of-my-life-after-accident-former-icu-patient",
        "date": "2024-12-11",
        "content": "SINGAPORE – It would have taken her seconds to fasten her seat belt in a private-hire car, but she did not do so, as she felt Singapore’s roads were very safe.\nMs Nurul Azimah Mas’Ot’s complacency nearly got her killed when the vehicle collided with a taxi on the Bukit Timah Expressway on May 30.\nThe 21-year-old was catapulted from the rear seat to the car’s dashboard, causing her to suffer head and spinal injuries.\nShe was in a coma for three days in Khoo Teck Puat Hospital’s (KTPH) intensive care unit, underwent brain surgery and was hospitalised for more than a month.\nWhile therapy has helped Ms Azimah recover her motor skills, she struggles with doing simple things like alighting from a bus or making digital payments.\nThis is because most of her memory from the last 15 years was gone after she regained consciousness.\nThe Singapore Civil Defence Force said that on May 30 at about 8.05pm, it was alerted to a road traffic accident on the BKE towards Woodlands before the Mandai Road exit.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nFive people were sent to KTPH.\nThe police said a 69-year-old male taxi driver is assisting with investigations.\nMs Azimah returned to work as an auditor on Sept 4. As she lost a large chunk of her memory, she has to relearn many things, including some aspects of her job.\nShe said: “It’s as though I’ve never lived those years of my life. I can’t recall the people I’ve met, the places I’ve been to, or the skills I’ve learnt.\n“Even simple things like how to tap out when I’m getting off a bus or how to use Microsoft programs, I have to relearn them.”\nTraffic Police statistics show the number of violations for failing to wear a seat belt, or wearing it improperly, have fallen recently.\nSuch violations went down from 5,863 in 2021, to 4,763 in 2022 and 3,559 in 2023.\nData from three hospitals, however, show more patients were not wearing seat belts in a traffic accident.\nMs Nurul Azimah Mas’Ot (right), 21, who lost memory from the last 15 years&nbsp;after an accident, with her mother Nurizzah. ST PHOTO: JASON QUAH\nFigures from the National University Centre for Trauma showed the number of traffic accident patients in the western region who were not wearing seat belts and got severely injured rose from 20 in 2022 to 25 in 2023.\nThe centre at the National University Hospital (NUH) was launched in July and focuses on improving safety and trauma care for children, older adults and migrant workers.\nAt Tan Tock Seng Hospital, 12 rear-seat passengers with moderate to severe injuries were admitted each year in 2022 and 2023. Of these, five were unbelted in 2022 and nine in 2023.\nOf the 10 motor vehicle crash patients KTPH admitted each year in 2022 and 2023, four were unbelted in 2022 and six in 2023.\nDoctors said accident patients who do not wear seat belts tend to suffer more severe and varied injuries, as they can get thrown out of their seats and flung out of the vehicle.\nCiting medical literature, the director of NUH’s trauma centre, Adjunct Assistant Professor Raj Menon, said wearing a seat belt reduces one’s risk of mortality by 40 per cent to 60 per cent.\nHe added: “Without a seat belt, people can be flung against the doors, dashboard and windshield, or even be ejected out of vehicles. There is a much higher energy transfer to the body and this can result in more severe injuries to the head, neck and torso.”\nKTPH’s head of general surgery, Dr Jerry Goo, said the most common cause of death in a traffic accident is brain injury, followed by internal bleeding.\n“When a person hits his head against any part of the car, there is a high chance of death, or neurological damage where he can become paralysed or fall into a coma,” he said.\nHe added the force of the collision may cause organ damage and internal bleeding, which can be hard for doctors to treat in severe cases.\nMore On This Topic\n‘Wearing your seat belt gives me a chance to save your life’: TTSH trauma surgeon\nCar seat belts, child seats: Seeing blind spots only when someone dies\nDr Goo highlighted a case several years ago where a woman was travelling to Changi Airport with her parents in a taxi when they were hit by another vehicle.\nDr Goo said the woman, who was sitting in front, suffered minor injuries and was discharged that day, while the taxi driver was hospitalised for a week. Both were wearing seat belts.\nHer parents were unbelted in the rear seats. One of them died and the other was hospitalised for nearly two months.\nSaid Dr Goo: “Though the impact of the crash may have been different for each of them, this case shows that wearing a seat belt can make a huge difference between life and death.”\nDr Koh Shao Hui, a consultant at Sengkang General Hospital’s Department of Emergency Medicine, said being belted up reduces the risk of getting ejected out of the vehicle by at least double.\n“Belting up minimises the movement of passengers and helps to distribute the forces of impact across more resilient parts of the body, such as the pelvis and rib cage,” he added.\nTen passengers who did not belt up often, whom The Straits Times spoke to, gave three broad reasons why: it was uncomfortable; the journey was short; and the driver was not speeding.\nSingapore Road Safety Council chairman Bernard Tay said everyone should be belted up, even during a five-minute journey, as accidents can happen within seconds.\nHe added: “Even if your driver is driving safely, others may not be. The only reason for not wearing a seat belt is if you have a medical exemption.”\nIt became compulsory for front-seat passengers to be belted up in 1983. For rear-seat passengers, this came into force in 1993.\nOffending passengers can be fined $150, while the driver can be fined the same amount and get three demerit points.\nThe seat belt rule is also enforced in countries like Australia and Britain. On July 26, a\nSingapore permanent resident was fined A$1,106 (S$960)\nby the Queensland authorities for not wearing a seat belt properly.\nCriminal lawyer Rajan Supramaniam said not wearing a seat belt can affect insurance claims and compensation amounts in an accident. He added: “While no insurance claim can be rejected if seat belts are not worn, it may reduce the compensation available due to what’s known as contributory negligence, or your share of fault in the severity of injuries.”\nWith the encouragement of her family, Ms Azimah is soldiering on in her recovery process.\nShe said: “It was a painful lesson for me, but I’m very fortunate to have survived. I hope my story reminds everyone not to take any chances and to always wear your seat belt.”\nMore On This Topic\nRise in fatal accidents involving speeding, drink driving in first half of 2024\nS'pore PR fined $1,000 for not wearing seat belt properly during holiday in Australia\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/courts-crime/man-abused-11-year-old-girl-with-special-needs-hitting-her-with-belt-while-her-mother-just-stood-by",
        "date": "2024-12-11",
        "content": "SINGAPORE – Angered by what he perceived as misbehaviour, a man slapped and used various objects to hit his girlfriend’s 11-year-old daughter, who has special needs, till she had bruises all over her body.\nThe abuse took place in the presence of the girl’s mother, who stood by and allowed it to happen.\nOn Aug 19, the man admitted to one charge of ill-treating the victim under the Children and Young Persons Act, while the woman pleaded guilty to knowingly permitting the abuse.\nBoth of them, who are aged 36, cannot be named due to a gag order to protect the victim’s identity.\nDeputy Public Prosecutor Niranjan Ranjakunalan told the court that the victim has high-functioning autism, mild fluency disorder, dyslexia and attention deficit hyperactivity disorder.\nIn February 2020, the man moved in with the woman and the victim in their Housing Board flat. The couple’s relationship with the girl was close, with the girl even calling the man “Daddy”.\nShortly after the man moved in, the couple started to cane the victim with a hanger or a cane when they perceived she had misbehaved, such as not completing her school assignment, complaining about having to do household chores, not waking up for school or not turning off the alarm when it rang.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nThe deputy public prosecutor (DPP) cited seven incidents where the man or the couple caned the victim between June and August 2020.\nOn Aug 11, 2020, the girl’s teacher noticed cane marks on her body and scheduled a meeting with the woman on Aug 26, because the woman was not available on an earlier date.\nThe abusive acts escalated on Aug 22, four days before the scheduled meeting.\nThat day, the man struck the victim on her arms and legs as she had lost her pocket money and performed poorly in school, among other reasons.\nSaid the DPP: “When the victim told (the man) that the cane would not work, (he) lost his temper and decided to hit the victim with a leather belt instead.”\nIn the presence of the girl’s mother, the man slapped the child’s face and hit her arms and legs with the leather belt about 20 times.\nThe victim subsequently had more than 10 bruises all over her body.\nMore On This Topic\nBaby found with fractured skull in January dies; woman’s assault charge amended to murder\n20 months’ jail for maid who repeatedly abused employer’s toddler\nWhen the girl attended school two days later, she told her teacher about what the man had done, and said she was very scared to return to the flat.\nThe teacher informed her superiors, and the school called the Ministry of Social and Family Development (MSF).\nThe same day, a child protection officer from MSF took the girl to the hospital, where she was hospitalised for 10 days.\nThe hospital referred the case to the police, and the couple were arrested the next day.\nDuring investigations, the couple admitted that they “went overboard and punished the victim very harshly”, said the DPP.\nA report in February 2021 stated that the victim had felt sad and fearful since the abuse, and had nightmares and recurring thoughts about it.\nThe couple will be sentenced on Sept 12.\nFor ill-treating a child, or knowingly permitting a child to be ill-treated, they could each be jailed for up to eight years, fined up to $8,000, or both.\nMore On This Topic\nJail for man who abused stepson while out on bail after assaulting his 1-year-old baby\nOver 17 years’ jail for woman, 73, who abused family friend almost to death\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/woman-fined-1000-for-not-wearing-seat-belt-properly-in-australia",
        "date": "2024-12-11",
        "content": "SINGAPORE - A woman was fined A$1,106 (S$1,000) by the Queensland government on July 26, over a month after returning to Singapore from a road trip in Australia.\nMs Shelley Lu told The Straits Times she had been caught by traffic cameras wearing her seat belt tucked under her arm while riding in the front passenger seat in a rental car.\nThe Singapore permanent resident, 42, said she was fined for wearing her seat belt improperly, denying previous media reports that she had been penalised for not wearing one.\n“I feel it’s so itchy when it touches my neck, so I put it under my arm,” said Ms Lu, who is a Chinese national. “It should have been over my shoulder.”\nMs Lu, who works at a non-profit organisation, said the fine came as a shock to her family, who drove from Brisbane to the Gold Coast during a holiday from June 13 to 19.&nbsp;\nShe expressed surprise on several counts over the incident.\nFirst, “that a breach of this traffic rule could cost a thousand dollars”.\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“Second is the rule itself,” she added. “I’ve never known that even though I’ve put a seat belt on, that I could still be fined because I didn’t put it at the right place.”\nMs Lu also said she was shocked because she did not know that a camera could accurately detect that she had put the seat belt on but had not done so correctly.\n“And how it found me amongst thousands of cars,” she added.\nThe transport and motoring section on the Queensland government’s website specifies that seat belts must be worn with the belt running over the shoulder, across the chest, and the belt must be buckled low on the hip. “Wearing a seat belt any other way will result in a fine,” it adds.\nBut Ms Lu feels no indignation at the fine and said she approved of the Australian law “for passenger safety”. The deadline for payment was extended from Aug 1 to Aug 26 after she contested it.\nA screengrab from the Queensland government website showing the correct way to wear a seat belt. PHOTO: SCREENGRAB FROM QUEENSLAND GOVERNMENT WEBSITE\n“Definitely, I will pay it,” she said, adding that she does not want any trouble should she return to Australia.\nAccording to a media statement issued in August 2023, to mark Queensland Road Safety Week, Mr Mark Bailey, then Queensland Minister for Transport and Main Roads, noted that travelling unrestrained was one of the top five contributing factors to lives lost on the state’s roads, with 30 per cent of fatalities either wearing a seat belt incorrectly or not at all.\nA media fact sheet also said that information provided by Queensland Health medical practitioners revealed that a person wearing a seat belt under the arm or looped under the arm could suffer injuries, including fractures to the sternum, ribs, vertebra, skull, face or neck. The lungs, heart, oesophagus, stomach and bowel could also be injured. Shoulder dislocations or fractures are also possible.\nMore On This Topic\n4 drivers nabbed for providing illegal chauffeured services between S'pore and Malaysia\nMotorcyclist fined for causing wife’s death in accident on TPE\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/singapore-to-play-bigger-role-in-helping-chinese-firms-partners-mediate-disputes-in-belt-and-road-projects",
        "date": "2024-12-11",
        "content": "SINGAPORE – A new multimillion-dollar airport was built, but the builders were unhappy.\nThe main builder, an Asian construction company, had held back payments to its subcontractor, a Chinese state-owned enterprise, because the latter could not meet the terms of the contract due to unforeseen circumstances.\nAfter a two-year stalemate, representatives of both companies flew to Singapore, sat down in the presence of a mediator and, within a day, shook hands on a payment arrangement that satisfied both sides.\n“If you want to carry on with business, then each side has to give and take,” said Mr George Lim, the Singaporean mediator for the airport project.&nbsp;\n“You suffer a bit, I suffer a bit, we carry on, and maybe in the next project, we make more together.”\nMr Lim chairs the Singapore International Mediation Centre (SIMC), a non-profit organisation that is part of Singapore’s efforts to position itself as a hub for dispute resolution.\nHe is proud of his 75 per cent success rate when it comes to resolving disputes through mediation. His secret: Serving tea to calm parties down and get them into a friendlier mood.&nbsp;\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nAfter the centre signed a&nbsp;memorandum of understanding with the China International Contractors Association on Aug 27, more Chinese companies will likely take their disputes with foreign companies to Singapore for mediation.\nMany of the association’s 1,500 members are state-owned companies involved in Belt and Road projects.&nbsp;The Belt and Road Initiative is Chinese President Xi Jinping’s signature policy to build infrastructure across the world. Chinese companies sometimes team up with foreign companies to complete these projects.\nWhen cost overruns or delays happen, disputes arise.&nbsp;\nSpeaking to reporters on Aug 28 at Shangri-La Hotel during a ceremony to mark the 10th anniversary of SIMC, Mr Lim quoted the example of the airport project to show how mediation can be a cheaper, faster and better way to resolve disputes than suing the other party in open court – as in litigation – or behind closed doors, as happens in arbitration.\n“When you sue, it is win or lose. You have to say bad things about the other parties. Usually in the end, it means a breakdown of the business relationship,” he said.&nbsp;\nMediation, in contrast, is a less contentious process by which both sides can try to understand the underlying concerns behind the demands and try to find a middle ground in a face-saving manner.\nIt allows both sides to thrash out their differences privately without the public airing of dirty linen like in a court case, he explained.\nHe said that although China has signed but not yet ratified the Singapore Convention on Mediation, the SIMC so far has had no problem enforcing mediation outcomes in China.\nMore On This Topic\nTwo international judges appointed to Singapore International Commercial Court from 2024\nSingapore set to grow as arbitration powerhouse\nMr Xin Xiuming, vice-chairman of&nbsp;the China International Contractors Association, told reporters at the Shangri-La event that while it is often the foreign partner of a Chinese company asking for disputes to be mediated outside China,&nbsp;there is no downside for the Chinese company to do so in Singapore instead of on home ground.&nbsp;\n“SIMC is professional and has international influence. The outcome of the mediation is reached after mutual consultation.&nbsp;If I don’t accept the mediation outcome, I can always walk away and try litigation or arbitration.”\nThe demand for mediation services outside of China will likely grow as Chinese companies seek more partnerships with foreign construction companies.&nbsp;\nIn&nbsp;the first seven months of 2024, members of the association received from foreign companies contracts worth US$134 billion (S$174 billion), a 25 per cent jump from the same period in 2023, said Mr Xin.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": true,
        "title": "Mediation in Singapore: A Path to Resolving Disputes for Chinese Companies",
        "is_title_contain_shared_future": false,
        "sentiment": "positive",
        "main_keywords": [
            {
                "Belt and Road Initiative": 2
            }
        ]
    },
    {
        "url": "https://straitstimes.com/opinion/forum/forum-focus-more-on-getting-rear-seat-passengers-to-wear-seat-belts",
        "date": "2024-12-11",
        "content": "I am comforted that the Traffic Police will be launching a road safety campaign later this year (\nMore road safety measures ahead,\nMay 3).\nOne aspect of road safety that seems to have been overlooked is the use of seat belts in vehicles, especially by rear-seat passengers.\nI discussed this issue with friends and estimate that about 50 per cent of drivers in Singapore do not ensure their rear-seat passengers wear seat belts.\nQuite often, we read about passengers in vehicles involved in a serious accident being flung out, resulting in serious injuries or death. The result could have been different if they had worn seat belts – it is the difference between life and death.\nCurrently, passengers caught not wearing a seat belt face a fine of $120, while the driver would be fined the same amount and get three demerit points. Perhaps it is time to increase this penalty.\nThe campaign this year should emphasise the importance of wearing seat belts and the serious consequences of not doing so.\nIt is also the responsibility of parents to inculcate a seat belt-wearing habit in their children so that they will do it naturally, even after they have grown up.\nEveryone should be aware that wearing seat belts is for our safety and not just to avoid paying a fine.\nS\nteve Goh Han Choon\nMore On This Topic\nForum: What readers are saying\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/meta-amazon-job-cuts-and-belt-tightening-helped-deliver-their-stellar-results",
        "date": "2024-12-11",
        "content": "SAN FRANCISCO\n- Meta Platforms and Amazon.com spent 2023 cutting costs and refocusing their businesses. It was a strategy that upended the lives of displaced tech workers in Seattle and Silicon Valley, but appears to have paid off handsomely for investors, who are likely to continue reaping benefits.\nBoth companies reported better than expected earnings on Feb 1,\nsending their stock prices soaring and validating the belt-tightening strategies that defined the tech industry’s past 16 months.\nFacebook owner Meta,\nwhich cut headcount by 22 per cent in 2023,\nunveiled plans for a US$50 billion (S$66.8 billion) stock buyback, and even announced its first ever quarterly dividend – a sign to investors that it has money to spare and a reason for them to stick around.\nAmazon investors asked about any plans to return capital to shareholders and executives were non-committal. It initiated its biggest-ever round of corporate job cuts beginning in 2022 that affected about 35,000 people in 2023.\nAlready in 2024, the company has said more positions will be eliminated in its Prime Video, studios and Twitch live-streaming businesses.&nbsp;\nInvestors were happy to see tech companies – often prone to splurge on moonshot projects with no foreseeable payout – narrow their investments to profitable business lines, said Mr Gil Luria, managing director at D.A. Davidson &amp; Co, a wealth management firm.\n“This new-found cost discipline is paying off for investors, as these companies were able to prune less productive businesses while still being able to invest some of those savings in the faster-growing parts of their business,” he said. “At the same time, these companies have been able to accelerate revenue growth, thus significantly increasing margins.”\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBoth companies also reported holiday quarter revenue growth in their central businesses – digital advertising for Meta and e-commerce sales for Amazon – that surpassed estimates.\nThe results sent Meta’s shares up 15 per cent in extended trading, while Amazon’s stock rose more than 7 per cent.&nbsp;\nMeta chief executive Mark Zuckerberg acknowledged that the strong business results raise questions about whether Meta should start investing heavily again.\n“The biggest thing that’s holding me back from doing that is that at this point I feel like I’ve really come around to thinking that we operate better as a leaner company,” he said on Feb 1. “There are always these questions about adding a few people here or there to do something, and I guess I just have more of an appreciation about how all of that adds up.”\nFor years, Meta and Amazon reinvested profits back into the companies, fuelling hiring sprees and expanding into new technologies and business lines.\nThe strategy was increasingly apparent in the wake of the Covid-19 pandemic, when both companies spent aggressively.\nMeta’s headcount increased 30 per cent in 2020, and another 23 per cent in 2021, while pivoting the entire company towards a massive investment in augmented and virtual reality technology dubbed the metaverse.\nAmazon, for its part, doubled the size of its logistics network to meet pandemic demand and increased its workforce almost 30 per cent in 2022 before it cooled on hiring and building new facilities.\nThe question now becomes whether leaner, more focused versions of Meta and Amazon can continue to strive for the bold and ambitious tech advancements that have made them household names.\nIn Meta’s case, that includes spending aggressively on artificial intelligence (AI) advancements, both in generative AI but also on the background technologies to help feed it social media products and power its ad targeting.\nMr Zuckerberg is also still committed to virtual reality and augmented reality headsets, even though the company’s Reality Labs division building these kinds of technologies lost US$16 billion in 2023.&nbsp;He plans to keep headcount growth “relatively minimal” for 2024 and beyond, despite the lofty ambitions.\n“Until we reach a point where we are just really underwater on our ability to execute, I kind of want to keep things lean because I think that’s the right thing for us to do culturally.”\nAmazon CEO Andy Jassy said Amazon reduced the cost to serve a customer’s order by 45 US cents per unit in 2023, its first decrease in that metric in five years, and he vowed to continue to look for ways to bring those costs even lower.&nbsp;\nChief financial officer Brian Olsavsky said the company would be cautious about new investments.\n“Where we can find efficiencies and do more with less, we’re going to do that as well,” he said. BLOOMBERG\nMore On This Topic\nFacebook owner Meta, Amazon beat expectations with stellar results\nTech’s job cuts give little hope for return to rapid growth\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/travel/suite-life-explore-the-bustling-ginza-and-marunouchi-districts-in-tokyo",
        "date": "2024-12-11",
        "content": "TOKYO – Ginza, located near Tokyo Station, is one of the city’s busiest high-end shopping districts.\nIts main thoroughfare, Chuo Dori avenue, is chock-a-block with upmarket department stores, luxury boutiques and art galleries. It is also home to some of the oldest shops in Tokyo, including the stationery shop Itoya, which was founded in 1904 and occupies a 12-storey building today.\nAlready a subscriber?&nbsp;\nLog in\nRead the full story and more at $9.90/month\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nST One Digital\n$9.90\n&nbsp;\n$9.90/month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nUnlock these benefits\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to you\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/china-halts-ipos-of-three-major-bubble-tea-chains-after-shares-of-rivals-plunge-sources-say",
        "date": "2024-12-11",
        "content": "HONG KONG - The offshore share offering plans of at least three Chinese bubble tea makers have been put on hold by China’s securities regulator due to the dour market performance of peers in Hong Kong amid weaker consumer sentiment at home, said sources.\nMixue Bingcheng, Guming Holdings and Auntea Jenny are among those whose offshore listing plans have been delayed by the China Securities Regulatory Commission (CSRC) in 2024, they said.\nMixue, which has roughly 36,000 stores, was looking to raise up to US$1 billion (S$1.29 billion) in its Hong Kong initial public offering, which would have been the largest new share sale in at least a year in the city, said five of the sources.\nTwo of the sources said Guming, with 9,000 stores, aimed to raise up to US$500 million via a Hong Kong listing.\nBut, according to four of the sources, both Mixue and Guming’s\nIPO applications lapsed earlier in 2024\nafter six months of waiting for approval.\nAs part of rules unveiled by the CSRC in March 2023 to strengthen oversight of offshore listings, Chinese companies looking to list in Hong Kong or New York must first get approval from their home regulator.\nThe regulatory move to put the bubble tea makers’ IPO plans on hold was triggered by the nearly 27 per cent Hong Kong debut-day slump in shares of Sichuan Baicha Baidao Industrial, the Chinese tea chain known as Chabaidao, said the sources.\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nChabaidao, which raised US$330 million in April, has seen its shares falling 70 per cent from its HK$17.50 per share IPO price.\nThe regulator’s cautious stance underscores the tighter scrutiny of offshore IPO hopefuls in China, reducing the number of deals in Hong Kong and New York and stymieing Chinese companies’ intentions to tap the capital market for fund-raising.\nChinese companies have raised just US$2.56 billion via IPOs in Hong Kong in 2024, versus US$5.7 billion in the whole of 2023, according to Dealogic data.\nThe total haul in 2024 is far below the US$22.1 billion year-to-date record set in 2021.\nThe regulatory caution towards offshore share offerings by the bubble tea makers stems from low product differentiation and fierce competition in the sector at a time when consumers are tightening their belts in a slowing economy.\nHighlighting the tea sector’s weak performance, Chabaidao in August reported a 10 per cent drop in gross revenue and 19 per cent fall in gross profit in the first half of 2024, compared with the year-ago period.\nShares of Hong Kong-listed Nayuki, China’s only publicly traded bubble tea chain before Chabaidao, have dropped more than 90 per cent since their debut in 2021.\nThe bubble tea makers are not the only ones to take a hit from the heightened regulatory caution – Beijing currently has more than 110 offshore listing hopefuls awaiting their approvals. REUTERS\nMore On This Topic\nPenny-pinching youth transforming China's bubble tea craze\nChina’s bubble tea boom a brew for billionaires\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/soggy-asia-coffee-crop-means-world-s-caffeine-fix-to-stay-pricey",
        "date": "2024-12-11",
        "content": "Any hopes that a flood of coffee exports from Asia’s major growers would take the heat out of a blistering rally that has pushed robusta prices to the highest since the 1970s are fading fast.\nVietnam produces around a third of the worldwide supply of the variety that is mostly used for instant drinks and espresso blends, but a drought followed by weeks of heavy rain has hit the nation’s coffee belt hard just before harvesting that starts in October.\nThe climatic extremes, and a shrinkage in the amount of land devoted to coffee growing, will cut the country’s harvest by about 10 per cent to 15 per cent this season, said Mr Trinh Duc Minh, chairman of the Buon Ma Thuot Coffee Association in the biggest coffee-growing province of Dak Lak.&nbsp;\n“The drought has caused the trees to produce fewer beans, and the beans are also smaller,” he said. “The rain will hinder farmers from picking the beans and drying their coffee, while also causing transport difficulties.”\nMore than 95 per cent of Vietnam’s coffee output next season will be robusta, according to the US Department of Agriculture (USDA).\nThe growing popularity of instant and grab-and-go coffee drinks and weather-hit supply have spurred a more than doubling of robusta prices over the past year. It is now almost as expensive as the premium arabica variety, which has also rallied sharply. Volcafe, a major coffee trader, is forecasting a hefty global robusta deficit in the 2024/25 season that starts in October, the fourth annual shortfall in a row.\nIn Indonesia – which supplies around a tenth of the world’s robusta – it is rising domestic demand rather than problems with the weather that looks set to limit relief to global markets.&nbsp;\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nOutput may reach 10 million 60kg bags in 2024, which would be 14 per cent higher than 2023, said Mr Moelyono Soesilo, the head of downstream coffee at the Association of Indonesian Coffee Exporters and Industries. However, exports are likely to remain steady at about 250,000 tonnes due to a surge in local consumption, he said.&nbsp;\nThe amount of acreage in Vietnam used to grow coffee has been declining due to farmers switching to alternative crops like durian and avocados over the last few years. Reduced groundwater and shade also pose long-term challenges, as many Vietnamese farmers rely on wells for irrigation and forest cover helps slow evaporation, according to a USDA report.\nThe USDA in June forecast just a 1 per cent drop in Vietnamese robusta production in 2024/25 to 27.85 million 60kg bags. However, that is about 9 per cent lower than the 2021/22 season, illustrating the longer-term decline in output that is coinciding with surging global demand.\nRobusta is likely to keep gaining market share because it is more tolerant to heat and disease than arabica – although both beans face significant climate risks. That all adds up to bad news for the world’s coffee drinkers, who look set to face elevated prices for some time yet.\nVietnam’s coffee belt was already experiencing wet weather in August, but the downpours that happened in the aftermath of Typhoon Yagi, which\nmade landfall in the north of the country on Sept 7\n, drenched coffee plantations even further.\nThe continued rain means Vietnamese shipments that usually start in early November will be delayed until early December or even later, said assistant vice-president Daryl Kryst of commodity execution and sales at StoneX, a commodities brokerage. “We do expect (robusta) prices to ease off, but that may not be seen until the start of next year.” BLOOMBERG\nMore On This Topic\nVietnam’s coffee trees stunted by drought, heat and pests\nWhy is coffee getting so expensive?\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/nestle-ceo-joins-line-of-consumer-bosses-felled-by-rising-living-cost",
        "date": "2024-12-11",
        "content": "LONDON - Nestle chief executive officer Mark Schneider is the latest consumer-goods boss to be shown the door as companies struggle to coax shoppers back to premium brands after a period of high inflation and belt-tightening.\nAfter eight years at the helm of the Swiss maker of KitKat, Nespresso coffee and Purina pet foods, Mr Schneider will be replaced by the company’s Latin America chief Laurent Freixe, Nestle said on Aug 22.\nMr Schneider is not alone. Just last week, Mr Laxman Narasimhan lost his job as CEO of Starbucks after less than two years; he will be replaced by Chipotle Mexican Grill chief Brian Niccol. Estee Lauder CEO Fabrizio Freda plans to retire in 2025, after the cosmetics company ran into trouble in recent months.\nIn 2024, new bosses started at Dove soap maker Unilever, beleaguered infant-formula maker Reckitt Benckiser Group and Johnnie Walker whisky distiller Diageo, all of which are trying to win back investor confidence in an environment where interest rates remain high and shoppers continue to keep a tight grip on spending.\nWhile retailers like Walmart and Target have adapted to more price-conscious shoppers, in part by pushing their offering of cheaper private-label goods, companies like Nike have fallen behind.\n“The pandemic, the supply-chain disruptions, 50-year-high inflation, rapidly rising interest rates and the negative consumer sentiment effect have all conspired to create a difficult environment for the average consumer stock,” said Mr Eric Clark, portfolio manager at Accuvest Global Advisors.\nUntil recently, Mr Schneider was lauded by investors as the CEO who overhauled Nestle, fending off a 2017 attack from activist investor Third Point. He initiated lucrative disposals of the Swiss company’s skin injectables business, low-margin bottled water brands in the United States and some frozen products.\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nMr Schneider focused on persuading consumers to pay more for premium versions of existing product lines, developing Nestle’s offering of coffee and pet food, while building up its health and wellness business. Nestle also smoothly navigated the supply-chain struggles many companies faced in the pandemic, thanks to its localised production.\nOver the past couple of years, however, Mr Schneider’s star began to fade. Nestle has struggled to win back shoppers after the post-pandemic bout of inflation, repeatedly missing quarterly sales expectations.\nIn July, Nestle trimmed its sales growth outlook for the year to at least 3 per cent, lower than the roughly 4 per cent previously targeted. Frozen food in the US proved to be a particular problem area because lower-income consumers are struggling to make ends meet.\nNot all the blame lies with the weak consumer, though. Nestle has had problems at its vitamins unit – acquired in 2021 for US$5.75 billion. It also suffered shortages in its water business in the last couple of years.\n“Schneider did a good job when he came in making changes to the portfolio,” said Mr Donny Kranson, a portfolio manager at Vontobel Asset Management. “More recently, however, the company has had some struggles, some self-inflicted and some a function of the external environment.”\nThe stock has climbed 22 per cent since Mr Schneider took over at the start of 2017, about half the gain that Unilever has posted during the same span. The Anglo-Dutch rival’s prospects have improved under new CEO Hein Schumacher, even as Nestle has started to fall behind. BLOOMBERG\nMore On This Topic\nNestle faces investor challenge over healthy food targets\nNestle, Danone see price hikes slowing after years of sharp increases\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/sia-resumes-meal-service-when-seat-belt-sign-is-on-more-caught-for-using-or-possessing-vapes-in-1st-half-of-2024",
        "date": "2024-12-11",
        "content": "You are reading the Evening Update newsletter. Get up to speed with the important stories from the day.&nbsp;\nSubscribe to our newsletter.\nSIA resumes meal service when seat-belt sign is on, lifts stricter rules after SQ321 incident in May\nHot beverages, including soup, will still not be served if there is turbulence.\nREAD MORE HERE\nAround 5,480 caught for using or possessing vapes in first half of 2024 in Singapore\nFrom April to June, 690 students were referred to HSA by schools and institutes of higher learning.\nREAD MORE HERE\nFirst two new Bukit Panjang LRT train cars enter passenger service on Aug 1\nPassengers can expect an upgraded air-conditioning system with improved cooling abilities, LTA said.\nREAD MORE HERE\nCatch up on the news that everyone’s talking about\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nMore On This Topic\nGet newsletters curated for you\nAround 40% of VEP applications Malaysia received were incomplete, delaying approval\nA total of 24,104 applications were incomplete, said Malaysia Transport Minister Anthony Loke.\nREAD MORE HERE\nPM Wong to deliver National Day message on Aug 8\nThis will be his first National Day message as Prime Minister after being sworn in on May 15.\nREAD MORE HERE\nProperty agent issued Pofma order over false claims about HDB’s ethnic integration policy\nThe video was first posted on his TikTok and Instagram accounts on July 24 and then on YouTube on July 25.\nREAD MORE HERE\nSingdollar strength seen softening as US moves closer to interest rate cut\nThe Malaysian ringgit and Japanese yen have made gains against the Singapore dollar.\nREAD MORE HERE\nDeath of Hamas military leader Deif in July airstrike confirmed, Israel says\nIsrael previously said there were increasing signs that he had been killed.\nREAD MORE HERE\nPope Francis’ mass: Ticket ballot results out on Aug 5; 2nd ballot for unsuccessful applicants\nThe second ballot will open at 10am on Aug 5 and close at 11.59pm on Aug 18.\nREAD MORE HERE\nComplaints against entertainment industry up five times in first half of 2024: Case\nThree-quarters of such complaints were related to the botched Singapore Sky Lantern Festival.\nREAD MORE HERE\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/style/comeback-kids-5-fashion-trends-from-the-2000s-now-seen-on-gen-zs",
        "date": "2024-12-11",
        "content": "SINGAPORE – Have you spotted any Gen Z outfits recently and felt whiplashed back to the 2000s?&nbsp;\nThink back to the designs worn by socialite and reality TV star Paris Hilton, 43, or ex-actresses Mary-Kate and Ashley Olsen, both 38, more than 20 years ago.\nMany Gen Zers – born between 1997 and 2012 – are now discovering these looks for the first time and embracing these trends of yesteryear.\nBayonetta glasses\nGisele Bundchen in a scene from The Devil Wears Prada (2006), wearing thin-framed Bayonetta glasses. PHOTO: 20TH CENTURY FOX\nThe geeky look of thin or rimless glasses that Gen Zers scorned just a few years ago is now in style.\nThe term Bayonetta glasses references the titular character of a Japanese action-adventure video game, Bayonetta (2009), who dons a pair of thin-framed glasses. Most notably worn by supermodel Gisele Bundchen in The Devil Wears Prada (2006), these glasses exude what Gen Zers are calling corporate or librarian chic.\nThe search term “corporate chic” saw a 950 per cent increase from April 2023 to April 2024, according to Pinterest’s Summer 2024 Trend Report.&nbsp;An 870 per cent increase was observed in searches for “geek chic”.&nbsp;\nThe best part of this trend: You can get your hands on a pair at your local optician, if you do not want to go big with luxury iterations.&nbsp;\nModel Belicia Gwee wears the Jennie Barrette 02 glasses from Gentle Monster. PHOTO: COURTESY OF BELICIA GWEE\nModel Belicia Gwee, 25, bought her pair in May from South Korean eyewear brand Gentle Monster. She wears the Jennie Barrette 02 ($520), part of a limited-edition collaboration with K-pop idol Jennie from girl group Blackpink.\nTo Ms Gwee, who wears spectacles in daily life, Bayonetta glasses help elevate an outfit. She says anyone can style them by going for outfits that are Y2K, grungy or smart casual.&nbsp;\nSkirts over pants\nMiley Cyrus is seen in a bright turquoise dress over skinny jeans during the Teen Choice Awards in 2006. The look is recreated by NUS law student Chen Heng-Yi. PHOTOS: GETTY, COURTESY OF CHEN HENG-YI\nRemember a time when you wore leggings under dresses? This layered look is synonymous with tween stars of the 2000s, seen in the red-carpet looks of former child star Ashley Tisdale, 39, and ex-Teen Queen Miley Cyrus, 31, during their Disney days.\nRefreshed for today’s tastes, this look is far from frumpy, with softer, lighter fabrics like polyester employed by brands.\nFor instance, American designer Sandy Liang tapped the trend with the Sound Pant (US$395 or S$530), part of her Spring/Summer 2024 collection, which features a miniskirt with built-in flared pants.\nThe fashion label, popular among Gen Zers for its coquettish bow motifs and collaborations, is one of the most sought-after brands by young fashion enthusiasts today. To It girls everywhere, Liang putting her own spin on a trend signals its true return.\nFor Gen Zers, much of this skirt-with-pants appeal lies in the way they can mix and match items they already own.\nMs Chen Heng-Yi, 21, a law student at the National University of Singapore (NUS), frequently incorporates layering in her outfits and can often be spotted wearing a pair of pants under a skirt or dress.\n“I didn’t purchase anything new for this trend. That’s another fun thing about it – it’s a lot more about styling than the pieces themselves,” she says. “I find it exciting that I can experiment with new textures and materials to make old outfits completely new.”\nFor those feeling intimidated by the trend, she recommends starting with a dress instead of a skirt, or playing around with different textures if you are going for a monochromatic look.\nBallet flats\nRepetto and Commes des Garcons released their first collaboration in 2004. PHOTO: REPETTO\nBallet flats are now back in style.\nYou might recall popular brands such as French ballet shoe company Repetto, which collaborated with luxury brands such as Commes des Garcons and Issey Miyake in the early 2000s.\nWhat sparked this silhouette’s recent revival were Miu Miu’s Satin Ballerinas ($1,470), which made their first appearance in the brand’s Autumn/Winter 2022 collection.&nbsp;\nA medical student at the NUS Yong Loo Lin School of Medicine, 22-year-old Megan Loo says ballet flats have been her go-to footwear since she purchased her first two pairs in Seoul in October 2023.\nMedical student Megan Loo loves ballet flats in darker tones such as cherry red and navy. PHOTO: MEGAN LOO\n“They’re timeless and versatile, making every outfit slightly more feminine,” she says, adding that they can also be affordable, as hers cost less than $20 from South Korean brand Chaakan. “I love them in deep tones like cherry red and navy, or nude colours, because they just look so classic.”\nJorts\nAmerican rapper Missy Elliott in a pair of jorts during MTV2’s 2 Dollar Bill Concert in 2003. In her own recreation, university student Celest Wong styles a pair of baggy jorts that she bought from a thrift store in Johor Bahru. PHOTOS: GETTY, COURTESY OF CELEST WONG\nBaggy, over-the-knee jean shorts – better known as jorts – have become a staple in every Gen Zer’s wardrobe.\nAccording to Google Trends, looking at the last five years, searches for “jorts” in Singapore hit an all-time high in June.\nThe trend borrows from the style of popular hip-hop artistes of the 2000s, such as American rapper Missy Elliott, 53.\nThese days, the silhouette is most commonly associated with pop singer Billie Eilish, 22. From her stage outfits to street style, Eilish is almost always sporting a pair of jorts.\nTheir appeal? Being weather-appropriate in warm, humid Singapore.\nMs Celest Wong, 22, a business administration student at the Singapore Management University, got hers from a thrift store in Johor Bahru in December 2023&nbsp;for less than $10.\nAlthough she owns just one pair, she has been able to style them in various ways.\n“I like pairing jorts with smaller, more feminine tops to juxtapose the bagginess of it,” she says. “On days when I just want to be comfortable, I would wear a boxy T-shirt but accessorise heavily, or opt for a louder pair of shoes.”\nStatement belts\nAmerican singer-songwriter Beyonce with a statement belt during a media event in Houston, Texas, in January 2004. Model Hana Carlesater, 19, borrows belts from her mother to add to her outfits. PHOTOS: GETTY, COURTESY OF HANA CARLESATER\nGo big or go home – that is the guideline for belts these days. Take style cues from pop stars like Beyonce and Britney Spears, both 42, and the statement belts they flaunted in the early years of their careers.\nThrow a fun, chunky belt over any pair of bottoms – jeans, maxi skirts, shorts – or even a dress. Setting the standard these days is model Bella Hadid, 27, who is often snapped wearing a statement belt in her day-to-day outfits.&nbsp;\nModel Hana Carlesater, 19, has been adding a statement belt to most outfits since she was 16. “It brings something new to a silhouette and elevates even simple denim jeans, making them more colourful and textured,” she says.&nbsp;\nThe NUS law student borrows pieces from her mother, such as a vintage Ed Hardy belt, and her mother’s friends.&nbsp;\nMs Carlesater’s top style tip for chunky belts is to pair them with baggy, wide-leg or boot-cut jeans, along with a top that matches its colour or vibe.\nMore On This Topic\nFashioned by Gen Z: Young entrepreneurs who make and sell streetwear\nBack to the future: Digicams, vinyl records and photo booths hold retro appeal for Gen Z\nYour browser does not support iframes, but you can use the following link:\nLink\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/entertainment/hotels-aim-to-cash-in-on-taylor-swift-phenomenon-with-gig-tripping-perks",
        "date": "2024-12-11",
        "content": "LONDON –&nbsp;As it becomes clearer that Taylor Swift fans are more than happy to pay top dollar&nbsp;for their concert-going vacations, five-star hotels are starting to court the sequin set.\nIn London, the plush Four Seasons Hotel London at Park Lane&nbsp;has unveiled its own “gig-tripping package”, ahead of the American singer-songwriter’s series of eight&nbsp;Eras Tour shows at Wembley Stadium, which begins on June 21.\nThough the hotel is best known for its 10th-floor&nbsp;spa with spectacular views of London and destination restaurant Pavyllon&nbsp;by French star chef Yannick Alleno, it is significantly turning up the volume this summer.\nAmong other perks, guests who book the package will find karaoke machines in their rooms – an invitation&nbsp;to belt their hearts out before or after the shows.&nbsp;There are also glittery&nbsp;welcome drinks, portable phone chargers for the show (also&nbsp;glittery)&nbsp;and friendship bracelet-making kits, an Eras Tour tradition.\nAll this adds&nbsp;£200 (S$345)&nbsp;to each booking on top of the standard room rates, which run around £1,000 a night in June – up to a&nbsp;20 per cent mark-up, depending on how long you stay.&nbsp;\nGiven the strong data supporting&nbsp;the “Taylor Effect” – a rise in spending tied to Swift’s shows – all around the world since the tour started in March 2023, it was only a matter of time before the hotel industry attempted to cash in with add-ons.\nIn 2023,&nbsp;the first leg of her US tour&nbsp;contributed US$4.3 billion (S$5.8 billion) to gross domestic product, according to&nbsp;estimates&nbsp;from Bloomberg Economics.&nbsp;\nFour Seasons is not the only hotel brand trying to get in on the fun. Marriott International Inc has used Swift’s popularity to court new loyalty members with sweepstakes packages and&nbsp;hotel events in cities such as Madrid and Stockholm.\nMs Raquel Pirola, the Park Lane hotel’s marketing and sales director,&nbsp;says her team came up with the amenity as they saw more guests, particularly Gen Z and millennial travellers, working Four Seasons stays into itineraries that are driven primarily by concerts – not just in London, but also around the world.\nThe amenity can be personalised around other concerts happening this summer, she adds, citing excitement around the British Summer Time festival&nbsp;in&nbsp;neighbouring Hyde Park. The line-up&nbsp;includes Australian pop diva Kylie Minogue and American singer Stevie Nicks and musician SZA.&nbsp;\n“In recent years, entertainment and cultural events have started to really drive&nbsp;luxury travel trends,” says Ms Pirola,&nbsp;adding that she has seen Americans booking the gig-tripping package.\nLuxury is the key word. A&nbsp;report from Skyscanner says 44 per cent of US adults are willing to travel short-haul to see their favourite acts live, but only 18 per cent are willing to fly long-haul for the same reason.\nEmbed Instagram\nInstagram URL\nStill, the demand is significant enough to fill planes crossing the Atlantic.&nbsp;Data from United Airlines shows bookings&nbsp;for US flights to Milan during Swift’s tour dates in July are up 45 per cent compared with the same period in 2023. Demand&nbsp;to Munich is similarly high, with bookings&nbsp;up 40 per cent during the Eras shows.\nSwift is also outshining the Olympics, according to data from American travel agency Embark Beyond shared exclusively with Bloomberg, which showed the billionaire superstar being a bigger driver of demand to Paris for luxury travellers than the upcoming games in Paris.\nFor example, the Shangri-La&nbsp;Paris saw a 120 per cent increase in bookings over Swift’s travel dates in May, giving the palace hotel a revenue boost before peak summer season, according to data from the hotel shared with Bloomberg.\nThe Shangri-La has launched a concert concierge in response. The hotel’s teams can arrange things like beauty services to help guests get bejewelled before the gigs.&nbsp;\nMs Pirola is confident that the story will play out similarly in London, where data from Barclays shows The Eras Tour is likely to provide a&nbsp;£1 billion boost to the UK economy.&nbsp;\n“Guests will no doubt find a Swiftie&nbsp;or two to exchange friendship bracelets with here at the hotel,” she says.\nBut there may be signs that hotels are coming into the phenomenon too late.\nEven as Swift continues to smash records, the demand for concerts is fading, with some mid-tier&nbsp;acts struggling to sell tickets. Puerto Rican rapper Bad Bunny and American rock duo The Black Keys have cancelled tour dates this summer, while American singer-actress Jennifer Lopez cancelled her entire tour.&nbsp;\nFor Swifties, getting a chance to sing London Boy (2019) inside a room&nbsp;at one of London’s top hotels could be a dream come true. But the hotel is aware that it is not for everyone.\nMs Pirola says the rooms are soundproofed well enough that guests blasting their hearts out to one of Swift’s chart-topping hits ahead of The Eras tour will not keep their neighbours up at night.&nbsp;BLOOMBERG\nMore On This Topic\nTaylor Swift draws five times as many US luxury travellers as the Olympics\nSingapore hotel rates and other indicators fall in April from Taylor Swift-driven highs in March\nYour browser does not support iframes, but you can use the following link:\nLink\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/orchard-road-to-get-virtual-twin-to-woo-younger-shoppers",
        "date": "2024-12-11",
        "content": "SINGAPORE – The tills are not ringing like they used to and the footfall has eased at Singapore’s prime shopping belt in Orchard Road, but a home-grown technology start-up is hoping it can chart a new way for retailers there to draw the younger crowd.\nThe firm, Alteredverse, has teamed up with the Singapore Land Authority (SLA) and the Institute of Technical Education (ITE) to create a virtual replica of the Orchard Road shopping belt.\nAlready a subscriber?&nbsp;\nLog in\nRead the full story and more at $9.90/month\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nST One Digital\n$9.90\n&nbsp;\n$9.90/month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nUnlock these benefits\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to you\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/entertainment/you-need-to-calm-down-swift-mania-hits-australia",
        "date": "2024-12-11",
        "content": "MELBOURNE – Thousands of die-hard Taylor Swift fans flocked to a Melbourne stadium on Feb 16, snapping up bagfuls of merchandise hours before the first Australian date of her money-raking, two-year-long “Eras” tour.\nThe 34-year-old megastar kicked off seven Australia shows on Feb 16, with three stadium gigs in Melbourne, before heading to Sydney for four more sell-out dates.\n“The Eras Tour”, which takes fans through the Swift discography, is the\nhighest-grossing musical tour of all time\n, netting about US$1 billion (S$1.35 billion) in ticket sales, according to Pollstar, a trade publication.\n“The main thing that got me into her was probably the lyrics and how I can relate them to so many different situations,” said 21-year-old Australian fan Kendra Harris, who has been waiting months to see her hero in the flesh.\n“I also love how she’s so communicative with fans. She posts a lot of things on her social media and will comment on people’s TikToks, so it feels like she truly knows you,” Ms Harris added.\n“I know she used to invite fans to her house to listen to the album early, so I feel like doing things like that just shows how much she cares.”\nWith many fans coming from overseas or other states and tickets hard to come by, hotel groups are offering ticket-and-lodging packages that run into the thousands of dollars.\nAustralia’s consumer protection agency has warned that hundreds of fans have been scammed into buying fake tickets, with losses estimated to be in the tens of thousands of dollars.\nSurprise songs\nFans were\ngearing up for the concerts\nby creating Swift-themed friendship bracelets, preparing outfits and learning “fan chants” to belt out during performances.\nBead kits have reportedly sold out in some Melbourne and Sydney stores, as fans have rushed to make the bracelets, which are traded before shows.\n“I’ve made like six or seven, but I would like to make a few more before the concert… You trade them with people, and I think people just give them if you don’t have any,” Ms Harris said.\nMany concert outfits will be inspired by Swift’s self-described “Eras”, her transformation through a range of musical genres, from country to pop.\nFollowing the\nre-release of her album 1989 in 2023\n, Swift has made around US$500 million from streaming royalties and music purchases, according to Billboard.\nTaylor Swift fans show off their beaded bracelets ahead of the pop superstar’s concerts in Melbourne. PHOTO: EPA-EFE\nMuch to fans’ delight, Swift, whose hits include Shake It Off, Blank Space and You Need To Calm Down, also performs an acoustic set on piano and guitar featuring two surprise songs not on the official setlist.\nPromotion for the tour has been as carefully choreographed as the performance on stage, and helped by Swift recently scooping her\nfourth “Album of the Year” prize\nat the Grammys, followed by\na much-hyped appearance at the Super Bowl\n, where she cheered on boyfriend Travis Kelce of the winning Kansas City Chiefs.\nThousands line up to purchase Taylor Swift merchandise at the Melbourne Cricket Ground. PHOTO: EPA-EFE\nThe power of Taylor Swift has even seeped into academia, with the University of Melbourne holding a “Swiftposium” to discuss her influence across a range of disciplines.\n“Fans view her a lot more as the friend-next-door than they do as a billionaire superpower, which is the reality of what she is,” sociologist Georgia Carroll told the gathering. AFP\nMore On This Topic\nAcademics hold ‘Swiftposium’ as Taylor Swift heads to Australia\nTaylor Swift set to bring momentary boost to Australian economy\nYour browser does not support iframes, but you can use the following link:\nLink\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->",
        "is_related": false
    }
]