[
    {
        "url": "https://straitstimes.com/asia/italy-tells-china-it-is-leaving-belt-and-road-initiative",
        "content": "ROME  -     Italy has officially informed China that it is quitting the Belt and Road Initiative (BRI), dismissing fears the move might sour relations and damage the Italian economy, government sources said on Wednesday.\nItaly in 2019 became the first and so far only major Western nation to join the trade and investment programme, ignoring warnings from the United States that it might let China take control of sensitive technologies and vital infrastructure.\nHowever, when Prime Minister Giorgia Meloni took office last year, she said she wanted to withdraw from the deal, which was championed by President Xi Jinping, saying it had brought no significant gains to Italy.\nThe 2019 accord expires in March 2024 and an Italian government source said Rome had sent Beijing a letter \"in recent days\" informing China that it would not be renewing the pact.\nThere was no immediate comment from China.\n\"We have every intention of maintaining excellent relations with China even if we are no longer part of the Belt and Road Initiative,\" a second government source said.\n\"Other G7 nations have closer relations with China than we do, despite the fact they were never in (the BRI),\" he added.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nItaly will assume the presidency of the G7 in 2024.\nMore than 100 countries have signed agreements with China to cooperate on BRI infrastructure and building projects since the scheme was launched in 2013. The then Italian Prime Minister Giuseppe Conte hoped for a trade bonanza when he signed up in 2019, but Chinese firms seemed to be the main beneficiaries.\nItalian exports to China totalled 16.4 billion euros ($17.7 billion) last year from 13 billion euros in 2019. By contrast, Chinese exports to Italy rose to 57.5 billion from 31.7 billion over the same period, according to Italian data.\nItaly's main euro zone trading partners France and Germany exported significantly more to China last year, despite not being part of the BRI, which is modelled on the old Silk Road that linked China to the West.\nLooking to maintain strategic ties, Foreign Minister Antonio Tajani visited Beijing in September and President Sergio Mattarella is due to visit China at some stage next year.\nMeloni herself has said she wants to go to Beijing, but no date has been fixed.\nDespite being part of the BRI, successive governments in Rome signalled their doubts about the pact by vetoing some proposed takeovers or limiting the sway of Chinese companies over their Italian counterparts.\nIn June, Meloni's cabinet curbed the influence of Chinese shareholder Sinochem on Italian tyremaker Pirelli, using \"golden power\" rules designed to protect strategic assets.\nMeloni, who heads a conservative coalition, has been keen to burnish her credentials as a committed pro-NATO leader and a government source said that she had assured U.S. President Joe Biden earlier this year that Italy would quit the BRI. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nThanks for sharing!",
        "date": "2023-12-06",
        "is_related": true,
        "title": "Italy quits Belt and Road Initiative, seeks to maintain ties with China",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Community of shared destiny",
                0
            ],
            [
                "Community of common destiny of mankind",
                0
            ],
            [
                "Asian Infrastructure Investment Bank",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ],
            [
                "China dream",
                0
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/putin-sees-chinas-one-belt-one-road-initiative-as-desire-to-cooperate-russian-agencies",
        "content": "tp -     Russia President Vladimir Putin said that he sees China's One Belt One Road (OBOR) initiative as a desire to cooperate on the global arena, Russian news agencies reported on Sunday.\n\"We see that some perceive it as an attempt by the People's  Republic of China to crush someone under itself, but we don't see this that way: we just see a desire for cooperation,\" Russia's news agency cited Putin as saying. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nRussia\nVladimir Putin\nChina\nThanks for sharing!",
        "date": "2023-10-15",
        "is_related": true,
        "title": "Putin Sees China's One Belt One Road Initiative as Desire for Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                1
            ],
            [
                "China's influence",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/italys-belt-and-road-agreement-with-china",
        "content": "Italy has told China that it is quitting the Belt and Road Initiative (BRI), two government sources told Reuters on Wednesday, ending months of doubt over Rome's future in Beijing's ambitious infrastructure project.\nItaly signed a preliminary accord with China in March 2019 that made it the only Group of Seven (G7) country to join the BRI project, which was launched by Chinese President Xi Jinping in 2013.\nThe then Italian prime minister, Giuseppe Conte, hoped the deal would boost Italy's underperforming economy, but over the past four years it has produced little benefit.\nCritics had voiced concern it would enable China to gain control of sensitive technologies and infrastructure and Italy has since taken a number of steps to veto takeovers or limit the sway of Chinese companies over their Italian counterparts.\nINITIAL PREMISE\nThe two countries noted that they shared a common history, with Italy serving as the traditional landing place for the maritime section of the ancient Silk Route trading route linking Asia and western Europe.\nPRINCIPAL OBJECTIVES\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nChina and Italy committed to working together on strengthening their political relations and commercial ties, and promoting regional peace.\nPLANNED AREAS OF COOPERATION\n- Transport, logistics and infrastructure: Italy and China said they would work on projects such as roads, railways, bridges, civil aviation, ports, energy and telecommunications.\n- In the energy sector, State Grid Corporation of China has since 2014 owned a 35% stake in CDP Reti, a holding company that owns roughly a third of Italian power and gas grid operators Terna and Snam.\n- Removing obstacles to commerce and investment, promoting a partnership between their respective financial institutions.\n- Connectivity between people, developing a twinning network between cities and encouraging cultural, science, tourism and education exchanges.\n- Environmental cooperation, pursuing sustainable and ecological development. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nThanks for sharing!",
        "date": "2023-12-06",
        "is_related": true,
        "title": "Italy quits Belt and Road Initiative, ending months of doubt over Rome's future in China's ambitious infrastructure project",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                3
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/xi-sends-clear-signal-that-china-s-belt-and-road-initiative-is-for-the-long-haul",
        "content": "BEIJING\n-\nWhile China’s Belt and Road Initiative (BRI) may have met with some bumps in its implementation over the past decade, President Xi Jinping has sent a clear signal that he intends to stay the course.\nSpeaking at\nthe third Belt and Road Forum\nin Beijing on Wednesday, Mr Xi said his signature foreign policy initiative has boosted the flow of goods, capital and technology, bringing benefits to the countries involved.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nXi Jinping\nThanks for sharing!",
        "date": "2023-10-18",
        "is_related": true,
        "title": "China's Belt and Road Initiative: Xi Jinping's Commitment to International Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                2
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                0
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/putin-sees-belt-and-road-initiative-as-china-s-desire-to-cooperate-on-global-issues",
        "content": "BEIJING\n–\nRussian President Vladimir Putin said that he sees China’s Belt and Road Initiative (BRI) as a desire to cooperate in the global arena, Russian and Chinese news agencies reported on Sunday.\n“We see that some perceive it as an attempt by the People’s Republic of China to crush someone under itself, but we don’t see this that way – we just see a desire for cooperation,” Russia’s RIA state news agency cited Mr Putin as saying.\n“In my opinion, the main advantage of the cooperation concept proposed by China is that within the framework of cooperation, no one imposes anything on others,” Mr Putin said in an interview with China Media\nGroup\n.\nChina’s unique feature in building relations with other countries today is that “no one imposes or forces anything on anyone. They only provide opportunities”, he was quoted by Chinese state television as saying in Moscow.\n“This is the difference between President Xi Jinping’s Belt and Road Initiative and other projects pursued by countries with a colonialist flavour,” Mr Putin was quoted as saying.\nHe also said the BRI was timely and is developing well, according to RIA.\nMr Putin is due to attend\nthe third Belt and Road Forum,\nwhich will be held in Beijing from\nTuesday to Wednesday\n.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nHe attended the two previous forums, in 2017 and 2019.\nThe BRI is a plan for global infrastructure and energy networks that China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nREUTERS\nMore on this Topic\nTaliban to join China's Belt and Road forum, elevating ties\nDespite Rome’s scepticism,&nbsp;China says Belt and Road cooperation with Italy ‘fruitful’\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-10-15",
        "is_related": true,
        "title": "Putin Sees China's Belt and Road Initiative as a Desire for Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/china-says-90-countries-have-confirmed-attendance-for-belt-and-road-initiative",
        "content": "BEIJING - China said on Thursday that 90 countries have confirmed attendance for its Belt and Road Initiative conference being held in October.\nThe third Belt and Road Forum for International Cooperation will be held in Beijing in October, the foreign ministry has previously said, with 2023 marking the 10th anniversary of the Belt and Road Initiative.\nSeveral foreign leaders are expected to attend, including Serbian President Aleksandar Vucic and Argentine President Alberto Fernandez, state media reported.\nRussian President Vladimir Putin also has a scheduled visit to China in October when the country hosts the One Belt One Road forum, Mr Putin’s aide Yuri Ushakov said recently, according to Russia’s state news agency Tass.\n“We have received an invitation and plan to go to China,” Mr Ushakov said, according to a report from the Global Times.\nChina’s foreign ministry said the country has signed Belt and Road cooperation documents with more than 150 countries and over 30 international organisations, according to Xinhua.\n“Over the past decade, Belt and Road cooperation has achieved fruitful outcomes,” Chinese foreign ministry spokesman Wang Wenbin recently said at a press conference, adding that it has established more than 3,000 cooperation projects and galvanised nearly US$1 trillion (S$1.4 trillion) of investment, state media reported.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nCritics see the ambitious Belt and Road initiative – billed as recreating the ancient Silk Road to boost global trade infrastructure – as a tool for President Xi Jinping's China to spread its geopolitical and economic influence.\nDebate in the West over economic dependence on China has cast a shadow over longer-term trade and investment relations with Beijing. Italy, the sole Group of Seven nation in Belt and Road, said the decision by a previous government to join had been “atrocious”. REUTERS\nMore on this Topic\nChinese-funded railways bring tourists to SE Asia, but they also cause tensions\nChina’s BRI at 10: The journey continues, but has it outlived its purpose?\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nVladimir Putin\nThanks for sharing!",
        "date": "2023-09-07",
        "is_related": true,
        "title": "China's Belt and Road Initiative Conference to Host 90 Countries in October",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/china-to-host-belt-and-road-forum-in-beijing-oct-17-18",
        "content": "BEIJING\n–\nChina will host the third Belt and Road Forum in Beijing from\nnext Tuesday to Wednesday\n, the Chinese Foreign Ministry said on Wednesday,\na President Xi Jinping signature event that President Vladimir Putin is due to attend on a rare trip abroad\n.\nThe conference in Beijing on Oct 17 to Oct 18 marks the 10th anniversary of the Belt and Road Initiative (BRI) championed by Mr Xi,\nwith representatives from many developing countries, notably from Latin America and Africa, expected to attend.\nMr Putin attended the two previous forums, in 2017 and 2019, and the Kremlin said in September he had accepted an invitation to the forum and for talks with Mr Xi.\nThe Russian leader is not known to have gone abroad since the Hague-based International Criminal Court (ICC) issued a warrant for him in March over the deportation of children from Ukraine.\nMr Putin is expected to visit Kyrgyzstan on Thursday, before the Beijing meeting. Neither Kyrgyzstan nor China are members of the ICC, which was established to prosecute war crimes.\nThe BRI is a global infrastructure development strategy China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nBut critics see the plan – billed as recreating the ancient Silk Road to boost global trade infrastructure – as a tool for China to spread its geopolitical and economic influence.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nMr Putin, in a message to Mr Xi in October, said their talks would  deepen Russian-Chinese ties \"for the benefit of our friendly peoples, in interests of ensuring security and stability on the Eurasian continent and throughout the world\".\nChina had signed Belt and Road cooperation documents with more than 150 countries and more than 30 international organisations, the foreign ministry said.\nItaly, the only Group of Seven nation in Belt and Road, has publicly criticised joining the initiative, with its Foreign Minister Antonio Tajani recently saying trade between Italy and China had not improved since Rome joined four years ago.\nREUTERS\nMore on this Topic\nNo decision yet on quitting China’s Belt and Road: Italy PM Meloni\nChina says 90 countries have confirmed attendance for Belt and Road Initiative conference\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nTrade\nThanks for sharing!",
        "date": "2023-10-11",
        "is_related": true,
        "title": "China to Host Third Belt and Road Forum Amid Global Criticism",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/chinas-xi-wants-to-deepen-bri-cooperation-with-sri-lanka-under-new-leader",
        "content": "Beijing\n–\nChinese President Xi Jinping said on Sept 23 he hoped to broaden cooperation with Sri Lanka under his Belt and Road Initiative (BRI), as he congratulated the island’s new leader Anura Kumara Dissanayake on his inauguration, state media reported.\nMr Dissanayake, a self-avowed Marxist, took his oath at the Presidential Secretariat in Colombo on Sept 23, vowing to restore public faith in politics.\nThe country is emerging from a years-long economic collapse blamed partly on struggling high-debt Chinese mega-projects coordinated through the BRI, a massive infrastructure project that is a central pillar of Mr Xi’s bid to expand his country’s clout overseas.\n“I attach great importance to the development of China-Sri Lanka relations, and am willing to work with Mr President to continue our traditional friendship (and) enhance mutual political trust,” Mr Xi said in a message to Mr Dissanayake, according to state broadcaster CCTV.\nMr Xi said he hoped bilateral cooperation under\nhis flagship\nBRI would “bear more fruit”, CCTV added.\nHe said Beijing would “promote the steady progress of sincere mutual assistance between China and Sri Lanka as well as our age-old strategic cooperative partnership, and create more benefits for the peoples of both countries”.\nWestern critics accuse China of using the BRI to enmesh developing nations in unsustainable debt to exert diplomatic leverage over them, or even seize their assets.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBut a chorus of leaders – as well as research by leading global think-tanks like London’s Chatham House – have refuted the “debt trap” theory.\nIn December 2017, unable to repay a huge Chinese loan, Sri Lanka\nhanded its Hambantota port\nin the south of the island to a Beijing company on a 99-year lease for US$1.12 billion (S$1.44 billion).\nAnd the country defaulted on its foreign borrowings in 2022 during\na crisis that caused months of food, fuel and medicine shortages.\nChina is the nation’s largest bilateral creditor, with its loans accounting for US$4.66 billion of the US$10.58 billion that Sri Lanka has borrowed from other countries.\nIn 2023, the International Monetary Fund – the international lender of last resort – approved\na US$2.9 billion bailout loan for Sri Lanka.\nBeijing also agreed to restructure its loans to the country.\nAnd in September, Sri Lanka secured a deal with international bondholders to finalise a prolonged debt restructuring.\nAFP\nMore on this Topic\nSri Lanka gets leftist president who vows to curb corruption, help the poor\nNew leftist President vows to ‘rewrite Sri Lankan history’\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nSri Lanka\nThanks for sharing!",
        "date": "2024-09-23",
        "is_related": true,
        "title": "Chinese President Xi Jinping hopes to broaden cooperation with Sri Lanka under Belt and Road Initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/nigeria-and-china-sign-economic-nuclear-energy-pact",
        "content": "LAGOS - Nigeria and China agreed to strengthen ties in the Belt and Road initiative, human resources development and nuclear energy after the countries' leaders met on Tuesday, a government spokesperson said.\nChina is Nigeria's biggest bilateral lender, with loans amounting to $5 billion at the end of March, according to figures from Nigeria's Debt Management office.\nBoth countries have maintained diplomatic ties over the past 50 years. They were strengthened in 2018 when China and Nigeria became partners in the Belt and Road Initiative.\nThe ensuing partnership has delivered massive infrastructure projects in Nigeria from a deep sea port to rail lines.\n\"This comprehensive strategic partnership should result in robust development, stability, and security in the West African sub-region,\" President Bola Tinubu said.\nNigeria's Tinubu joins a summit of 50 African nations in Beijing this week at the 2024 Summit of the Forum on China-Africa which the Chinese leader called an opportunity to consolidate China-Africa relations.\n\"China and Nigeria, as major developing countries, strengthening strategic coordination, will inject fresh impetus to China-Africa relations in the new era and spearhead common progress among Global South countries,\" President Xi said.\nTinubu toured the Huawei Research lab and secured a commitment from Huawei to establish a joint solar PV test lab in Nigeria.\nAnother Chinese firm also pledged to establish an assembly plant for electric tricycles and train Nigerians in technology and renewable energy development. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nNigeria\nEnergy\nHuman resources\nThanks for sharing!",
        "date": "2024-09-03",
        "is_related": true,
        "title": "Nigeria and China Strengthen Ties in Belt and Road Initiative and Other Areas",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            {
                "Belt and Road Initiative": 3
            },
            {
                "Community of shared future": 1
            },
            {
                "China's influence": 1
            },
            {
                "Global South": 1
            }
        ]
    },
    {
        "url": "https://straitstimes.com/asia/taliban-says-plans-to-formally-join-chinas-belt-and-road-initiative",
        "content": "BEIJING – The Taliban administration wants to formally join Chinese President Xi Jinping’s huge Belt and Road infrastructure initiative and will send a technical team to China for talks, Afghanistan’s acting commerce minister said on Thursday.\nBeijing has sought to develop its ties with the Taliban-run government since it took over in 2021, even though no other foreign government has recognised the administration.\nIn September, China became the first country to appoint an ambassador to Kabul, with other nations retaining previous ambassadors or appointed heads of mission in a charge d’affaires capacity that does not involve formally presenting credentials to the government.\n“We requested China to allow us to be a part of the China-Pakistan Economic Corridor and Belt and Road Initiative (BRI)... (and) are discussing technical issues today,” acting commerce minister Haji Nooruddin Azizi told Reuters in an interview on Thursday, a day after the\nBelt and Road Forum ended in Beijing\n.\nThe Pakistan “economic corridor” refers to the huge flagship section of the BRI in Afghanistan’s neighbour.\nMr Azizi said the administration would also send a technical team to China to enable it to “better understand” the issues standing in the way of it joining the initiative, but did not elaborate on what was holding Afghanistan back.\nAfghanistan could offer China a wealth of coveted mineral resources. Several Chinese companies already operate there, including the Metallurgical Corp of China (MCC) which has held talks with the Taliban administration, as well as with the previous Western-backed government, over plans for a potentially huge copper mine.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“China, which invests all over the world, should also invest in Afghanistan... we have everything they need, such as lithium, copper and iron,” Mr Azizi said.\n“Afghanistan is now, more than ever, ready for investment.”\nAsked about the MCC talks, he said discussions had been delayed because the mine was near a historical site, but they were still ongoing.\n“The Chinese company has made a huge investment, and we support them,” he added.\nInvestors have said security remains a concern. The Islamic State militant group has targeted foreign embassies and a hotel popular with Chinese investors in Kabul.\nAsked about the security challenges, Mr Azizi said security was a priority for the Taliban-run government, adding that after 20 years of war – which ended when foreign forces withdrew and the Taliban took over – meant more parts of the country were safe.\n“It is now possible to travel to provinces where there is industry, agriculture and mines that one previously could not visit... security can be guaranteed,” he added.\nAfghanistan and 34 other countries agreed to work together on the digital economy and green development on the sidelines of the Belt and Road Forum on Wednesday. REUTERS\nMore on this Topic\nTaliban to join China's Belt and Road forum, elevating ties\nChina’s Xi warns against decoupling, lauds Belt and Road at forum\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nTaliban\nXi Jinping\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-10-19",
        "is_related": true,
        "title": "Taliban wants to join China's Belt and Road Initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/italian-pm-tells-chinas-premier-of-plan-to-quit-belt-and-road-initiative-media",
        "content": "ROME -\nItaly has not yet decided whether to quit China’s Belt and Road investment plan, Italian Prime Minister Giorgia Meloni said on Sunday, but doing so would not damage bilateral relations.\n“We have yet to make a decision,” Ms Meloni told a press conference at the close of the G-20 summit in New Delhi, a day after meeting for talks with Chinese Premier Li Qiang.\nShould Rome decide to quit, it “would not compromise relations” with China, Ms Meloni said.\nItaly, seeking to minimise any backlash from the decision from Beijing, would as a replacement aim to revitalise\na strategic partnership agreement with China,\naimed at fostering economic cooperation, it first signed in 2004.\nItaly is the only G7 nation to sign up to the\nBelt and Road Initiative\n.\nIt is a\nglobal trade and infrastructure plan modelled on the old Silk Road that linked imperial China and the West.\nCritics say the Belt and Road plan is a Trojan horse to increase China’s influence.\nThe deal automatically renews in March 2024 unless Italy opts out by the end of this year.\nItalian politicians have questioned the value of the BRI agreement signed by a previous administration in 2019.\nThe deal has been\na source of friction with Western allies due to wariness about spreading Chinese influence.\nItaly is the only one of a group of leading developed democracies to have signed up.\nAn Italian media report said earlier that Ms Meloni had outlined Italy’s plan to pull out of the pact during a meeting with Mr Li.\nThe Italians told the Chinese that their decision had not been dictated by the United States, the report added, comments echoed by similar reports in other Italian newspapers.\nMore on this Topic\nItalian PM Meloni, China's Li Qiang discuss closer ties at G20 summit\nPartnership with China more important than Belt and Road, says Italy’s Foreign Minister\nItaly has the G-7 presidency next year and recasting its relationship with Beijing would placate its Western allies.\nMs Meloni and Mr Li held talks at the G-20 summit in New Delhi on Saturday to discuss deepening relations, Ms Meloni's office said in a statement.\n\"Italy and China share a Global Strategic Partnership whose 20th anniversary will recur next year and which will be the beacon for the advancement of friendship and cooperation ... in every area of common interest,\" the statement added.\nThe Italian PM is tipped to travel to Beijing for a state visit in the next few months, or at the start of next year, but would not be drawn on a possible date.\n“It makes more sense to go to China when we have more elements about our bilateral cooperation and how to develop it,” she said.\nMs Meloni’s meeting with Mr Li, their first face-to-face, came as a broad alliance of states at the G-20 unveiled ambitious plans to create a modern-day Spice Route.\nIt seeks to link Europe, the Middle East and India.\nThe signatories hope it will offer a counterbalance to lavish Chinese infrastructure spending.\nAFP, REUTERS\nMore on this Topic\nChina says willing to work with Italy to improve trade, investment\nChina says 90 countries have confirmed attendance for Belt and Road Initiative conference\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nGiorgia Meloni\nItaly\nInfrastructure\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-09-10",
        "is_related": true,
        "title": "Italy's Decision on China's Belt and Road Initiative Remains Uncertain",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                3
            ],
            [
                "Community of shared future",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/life/arts/unusual-double-bill-of-puccini-s-gianni-schicchi-and-a-chinese-classic-about-growing-up",
        "content": "SINGAPORE –\nOpera buffs can look forward to an unusual double bill of Giacomo Puccini’s Gianni Schicchi and a light-hearted Chinese work, A Story Of Growing Up, at Singtel Waterfront Theatre on Dec 8 and 9.\nThe shows are presented by the China National Centre for the&nbsp;Performing Arts (NCPA) and the Asean-China Centre in&nbsp;collaboration with the Singapore Metropolitan Festival Orchestra, under the baton of Singapore Cultural Medallion recipient Yeh Tsung.&nbsp;\nThe productions mark the 10th&nbsp;anniversary of the Belt and Road initiative. The Chinese government introduced this global infrastructure development scheme in 2013 to invest in countries and international organisations.\nMs Iris Lanfen Wei, director of the NCPA’s department of production and artistic administration, tells The Straits Times: “NCPA has always emphasised both Chinese original creations and world classics in its repertoire production.\n“On the one hand, it develops and promotes Chinese culture, especially traditional culture. On the other hand, it also actively introduces world classics.”\nGianni Schicchi is the only opera buffa composed by opera&nbsp;master Puccini.&nbsp;\nThe comic opera in one act, about a witty fight for a family’s fortune, was an immediate hit when it was first performed&nbsp;at New York’s Metropolitan Opera&nbsp;in December 1918.&nbsp;\nIt garnered rave reviews&nbsp;and the score has been praised for its creativity and imagination.&nbsp;The aria,&nbsp;O Mio Babbino Caro (“O My Dear Daddy”), is one of the most famous lyric soprano arias in opera.&nbsp;\nNCPA first performed the work&nbsp;in China in 2021, following its productions of other famous works such as Turandot, Tosca and La Fanciulla del West by the same composer.&nbsp;\nA Story Of Growing Up is based on a 1956 fairy tale by Ren Rongrong, a famous Chinese&nbsp;translator and writer of children’s literature.\nThe production with bright and breezy music tells the story of two boys with bad habits –&nbsp;Meitounao (“Fool”) and Bugaoxing (“Unhappy”). After&nbsp;a dreamlike trip through time, they finally understand that their foibles could result in terrible mistakes.\nThough different in culture and background, both shows&nbsp;are full of humour and vitality.\nThe NCPA, inaugurated in December 2007, is a state-level art institution in Beijing whose facilities include an opera house, a concert hall, a theatre and an art museum.&nbsp;\nSince NCPA produced its first opera Turandot in 2008, it has put on more than 100 productions, covering opera, drama, dance drama, Peking opera and other\ngenres.&nbsp;\n&nbsp;\nMs Wei says of the double-bill programme for Singapore: “With his distinctive personal style and highly mature opera-writing techniques, Puccini presented a portrait of Italian society.&nbsp;As for the children’s opera,&nbsp;A Story\nOf\nGrowing Up, it has not only become a classic in the history of children’s literature, but also a common childhood memory for generations.\n“We hope that these two representative works can leave a deep impression on Singaporean audiences.”\nMaestro\nYeh\n, who is also Singapore Chinese Orchestra’s conductor emeritus, says: “Though these two operas are shorter in length and lighter in style, they show important aspects of human nature with a good sense of humour.” &nbsp;\nA Story Of Growing Up is a lively and witty production adapted from a fairy tale of the same title.\nPHOTO: CHINA NATIONAL CENTRE FOR THE PERFORMING ARTS\nBook It/Puccini Opera Gianni Schicchi\nWhere:\n&nbsp;Singtel Waterfront Theatre\n,&nbsp;Esplanade – Theatres on the Bay, 8 Raffles Avenue\nWhen:\nDec 8, 7.30pm\nAdmission:\n$58, $78\nInfo:\nThe performance\nis in Italian, with surtitles in English and Chinese. Go to\nwww.sistic.com.sg/events/pu1223\nA Story Of Growing Up\nWhere:\nSingtel Waterfront\nTheatre\nWhen:\nDec 9, 7.30pm\nAdmission:\n$58 and $78\nInfo:\nThe performance is in Mandarin,\nwith surtitles in English and Chinese. Go to\nwww.sistic.com.sg/events/child1223\nMore on this Topic\nEnter a golden chamber, play Singapore mahjong at youth festival Remix 2K23\nArts Picks: Mint museum’s new screening room, The Opera People, Singapore ceramicists on show\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nPerforming arts\nSingapore-China ties\nEsplanade\nOpera\nThanks for sharing!",
        "date": "2023-11-24",
        "is_related": true,
        "title": "Opera double bill featuring Puccini and a Chinese work to celebrate Belt and Road initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                2
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/world/russias-top-diplomat-lavrov-in-china-ahead-of-putin-visit",
        "content": "Beijing\n–\nRussia’s top diplomat Sergei Lavrov arrived in Beijing on Monday ahead of\nan expected visit by President Vladimir Putin to China,\nfor a gathering of representatives of 130 countries that will be overshadowed by the Israel-Gaza war.\nThis will be Mr Putin’s first trip to a major global power since\nthe Ukraine invasion.\nThe Foreign Ministry announced on social media platform X, formerly Twitter, that Mr Lavrov was in the Chinese capital as part of a Russian delegation.\nBeijing is hosting representatives of 130 countries from Tuesday to Wednesday to mark a decade of its Belt and Road Initiative (BRI) – a key geopolitical project of President Xi Jinping to extend China’s global reach.\nBut all eyes will be on Mr Putin, who in September told Beijing’s Foreign Minister Wang Yi in Saint Petersburg he had “gladly accepted” Mr Xi’s invitation to visit China for the BRI talking shop.\nThe Russian leader’s strategic dependence on China has only grown since his invasion of neighbouring Ukraine thrust his country into international isolation.\nMr Putin last week voiced concern at the “catastrophic increase” in the number of\ncivilian victims in Israel and the Gaza Strip.\nThe Kremlin ambassador to the United Nations has called for a “humanitarian ceasefire” in the Gaza Strip and Israel, while blaming the United States for the ongoing conflict.\nThis year, trade between China and Russia has soared to levels not seen since the beginning of Moscow’s war in Ukraine, with Chinese imports of Russian oil offering Moscow a critical lifeline as international sanctions bite.\nChina has refused to condemn the war in an effort to position itself as a neutral party, while at the same time offering Moscow vital diplomatic and financial support.\nAt the heart of the deepening partnership is the relationship between Mr Xi and Mr Putin, who have described each other as “dear friends”.\nBut their alliance is also forged by a symbiotic necessity, each seeing the other as a necessary bulwark in their shared struggle against Western dominance.\nIn an interview with Chinese state broadcaster CGTN ahead of his visit this week, Mr Putin hailed ties with Beijing and the “mutual benefits” of the BRI.\n“President Putin pointed out that a multipolar world is taking shape, and the concepts and initiatives put forward by President Xi Jinping are highly relevant and significant,” CGTN reported.\n“He stated that President Xi Jinping is a well-recognized leader on the world stage and is a true world leader,” it said.\nMore on this Topic\nPutin sees Belt and Road Initiative as China’s desire to cooperate on global issues: Reports\nDespite Rome’s scepticism,&nbsp;China says Belt and Road cooperation with Italy ‘fruitful’\nMr Putin also reportedly “shared pleasant memories between President Xi and him, and hoped the tradition would continue when they meet in China in the future”.\nA number of leaders have already arrived in Beijing ahead of the summit, according to China’s state news agency Xinhua.\nAmong them are Hungarian Prime Minister Viktor Orban, Chilean President Gabriel Boric, Kenyan President William Ruto and Ethiopian Prime Minister Abiy Ahmed.\nAFP\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nRussia\nDiplomacy\nThanks for sharing!",
        "date": "2023-10-16",
        "is_related": true,
        "title": "Russia’s Lavrov in Beijing ahead of Putin’s visit for Belt and Road Initiative summit",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ],
            [
                "mutual benefits",
                2
            ],
            [
                "global issues",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/putin-visits-dear-friend-xi-in-show-of-no-limits-partnership",
        "content": "BEIJING\n-\nRussian President Vladimir Putin arrived in Beijing on Tuesday to meet his “dear friend” Xi Jinping and bolster their relationship at a summit overshadowed by\nthe Israel-Hamas war.\nChina this week welcomed representatives of 130 countries to a forum on President Xi’s vast trade and infrastructure Belt and Road Initiative (BRI).\nAt the top of the guest list is Mr Putin, who is on his first trip to a major global power since\nMoscow’s Ukraine invasion\nthrew his regime into international isolation.\nHe is due to hold talks with Mr Xi on the sidelines of the forum on Wednesday, the Kremlin said, adding: “During the talks, special attention will be paid to international and regional issues.”\nWestern countries, led by the United States, have rallied to Israel’s side since Oct 7, when\nHamas launched a deadly attack on Israel.\nThe US has asked China to use its influence to help de-escalate the war, which has already seen over\na million people in the blockaded Gaza Strip flee\nthe relentless bombardment that Israel launched in retaliation for the Hamas attack.\nChina brokered an entente between key Hamas backer Iran and its regional foe Saudi Arabia earlier in 2023.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBeijing will send its Middle East envoy Zhai Jun to the volatile region this week. No details have been given about where or when exactly Mr Zhai would travel.\nChina’s state broadcaster CCTV has said he will push for a ceasefire and peace talks.\nRussia, which has traditionally maintained good relations with both Israeli and Palestinian authorities, has called for an “immediate ceasefire” in the conflict.\nIn Beijing, Mr Putin is on a mission to strengthen the already strong bond with his communist neighbour, though experts say Moscow is increasingly the junior partner in the relationship.\nChina is Russia’s largest trading partner, with exchange between the nations reaching a record US$190 billion (S$260  billion) in 2022, Beijing Customs data shows.\nBeijing has drawn criticism from Western countries for its stance on the Ukraine war, on which China insists it is neutral even as it refuses to criticise Moscow’s invasion.\nDuring Mr Xi’s state visit to Moscow in March, Mr Putin hailed the “truly unlimited possibilities” their countries’ partnership offered.\nBut while the BRI forum offers a fresh opportunity for Mr Putin and Mr Xi to showcase their alliance, experts do not expect any new major deals to be announced.\n“Russia is aware that China doesn’t want to sign any high publicity deals,” Mr Alexander Gabuev, director of the Carnegie Russia Eurasia Centre, told AFP. “China holds all of the cards.”\nFriends reunited\nMr Xi kicked off the summit on Tuesday with talks with Chilean and Kazakhstan presidents Gabriel Boric and Kassym-Jomart Tokayev, Chinese state media reported.\nHe then met Hungary’s Prime Minister Viktor Orban, describing the conservative leader as a “friend” and thanking him for his support for the BRI, state news agency Xinhua said.\nHungary’s Prime Minister Viktor Orban (left) and Chinese President Xi Jinping before their bilateral meeting in the Great Hall of the People in Beijing on Oct 17.\nPHOTO: EPA-EFE\nM\nr Xi also met the prime ministers of Papua New Guinea and Ethiopia.\nMr Putin had a meeting of his own with Mr Orban, during which he told the Hungarian Prime Minister he was satisfied to still maintain relations with some European countries, “despite... current geopolitical conditions”.\nMr Orban’s meeting with the Russian leader is likely to prompt a backlash from his European Union and North Atlantic Treaty Organisation allies as well as Ukraine, which have sought to isolate Mr Putin since Russia invaded Ukraine in 2022.\nHungary’s Prime Minister Viktor Orban (left) with Russian President Vladimir Putin on the sidelines of the Third Belt and Road Forum in Beijing, on Oct 17.\nPHOTO: AFP\nMr Putin also met Vietnam’s President Vo Van Thong, the Kremlin said.\nChina and Russia’s top diplomats were singing from the same song sheet when they met in Beijing on Monday.\nRussian Foreign Minister Sergei Lavrov thanked China for inviting Mr Putin as the summit’s “chief guest”, according to a readout from Moscow. It later said Mr Lavrov would head to North Korea after Beijing.\nMr Putin and Mr Xi will discuss the countries’ ties “in their entirety” when they meet this week, Mr Lavrov told his Chinese counterpart Wang Yi.\nThe two nations share a symbiotic alliance. China appreciates Russia’s role as a bulwark against the West, while Moscow is increasingly reliant on Beijing’s largesse in trade and geopolitical backing.\n“Since Moscow embarked on its all-out invasion of Ukraine, it has been put in a position where it is unprecedentedly dependent on China,” Assistant Professor Bjorn Alexander Duben of China’s Jilin University told AFP.\nAt the heart of the deepening partnership is the relationship between Mr Xi and Mr Putin, who have described each other as “dear friends”.\n“President Xi Jinping calls me his friend, and I call him my friend, too,” Mr Putin told Chinese state broadcaster CGTN ahead of his visit, according to a Kremlin readout.\nMore on this Topic\nChinese President Xi’s $1.3t ‘project of the century’ faces uncertain future\nIndonesia to seek China’s help to develop renewables at Belt and Road Forum\nSecond known trip since March\nThe visit to Beijing is Mr Putin’s second known trip abroad since the Hague-based\nInternational Criminal Court (ICC) issued an arrest warrant for him in March\n.\nIt is also the Kremlin chief’s first official trip outside the former Soviet Union in 2023,\nafter visiting Kyrgyzstan\n, a former Soviet republic, earlier in October.\nThe ICC, which accused Mr Putin of illegally deporting children from Ukraine, obliges the court’s 123 member states to arrest the Russian leader and transfer him to The Hague for trial if he sets foot on their territory.\nNeither Kyrgyzstan nor China is a member of the ICC, established to prosecute war crimes.\nMr Xi last saw his “dear friend” in Moscow just days after the ICC warrant was issued. At the time, Mr Xi invited Mr Putin to attend the third Belt and Road forum in Beijing.\nMr Putin last visited China for the Beijing Winter Olympics in February 2022, when Russia and China declared a “no-limits” partnership days before the Russian president sent tens of thousands of troops into Ukraine.\nIt would be Mr Putin’s third attendance of the Belt and Road Forum, which runs until Wednesday. He attended the two previous forums in 2017 and 2019.\nBelt and Road\nMr Xi launched the BRI a decade ago in hopes that it would build global infrastructure and energy networks connecting Asia with Africa and Europe through overland and maritime routes.\nMr Putin has praised the initiative\n, saying it is a platform for international cooperation, where “no one imposes anything on others”.\nSince the start of the Ukrainian conflict, Russia has cemented its energy ties with China in a sign of their economic cooperation.\nRussia exports around 2 million barrels of oil a day to China, more than a third of its total crude oil exports. Moscow aims to build a second natural gas pipeline to China.\nWhile the heads of Russia’s oil and gas giants Rosneft and Gazprom will be part of Mr Putin’s travelling delegation, no new deals in energy can be expected.\nThe trip is not a “full-fledged bilateral” visit, but one made on the sidelines of an international conference, according to the Kremlin.\nAFP, REUTERS, BLOOMBERG\nMore on this Topic\nPutin sees Belt and Road Initiative as China’s desire to cooperate on global issues: Reports\nRussia-China ties at ‘unprecedented historical level’, Putin says at meeting with Deputy Premier Zhang\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nBelt and Road Initiative\nChina\nRussia\nThanks for sharing!",
        "date": "2023-10-17",
        "is_related": true,
        "title": "Putin in Beijing to bolster ties with Xi at Belt and Road Forum",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                2
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/s-pore-officials-stress-supply-chain-resilience-green-financing-at-beijing-forum",
        "content": "BEIJING\n–\nSingapore politicians reiterated the Republic’s\nsupport for China’s Belt and Road Initiative (BRI) at\na high-level forum in Beijing,\nwhile also stressing the\nneed to strengthen global supply chains and bolster international cooperation on green financing.\nSpeaking at the Third Belt and Road Forum for International Cooperation on Wednesday, Acting Transport Minister Chee Hong Tat said the Covid-19 pandemic has underscored the importance of supply chain resilience.\nAs a trading nation, air hub and seaport, Singapore believes the way to achieve resilience is by diversifying trade links and enhancing interdependence and mutually beneficial cooperation, Mr Chee said,\nat a session titled Connectivity In An Open Global Economy.\nThis\nis why Singapore has been an early and strong supporter of the BRI, he said at the forum, which was held on Tuesday and Wednesday to mark 10 years since the initiative was launched to promote infrastructure and economic development\nwith other countries\n, as well as strengthen cultural ties.\nThe values that underpin the initiative are in line with Singapore’s objectives of developing an open, multilateral and rules-based system to strengthen global supply chains, and creating win-win outcomes for all stakeholders, Mr Chee said.\nSince 2013, China has worked with more than 150 countries on the BRI, which is seen as Chinese President Xi Jinping’s signature foreign policy.\nMore than 3,000 cooperation projects have been formed, including roads, ports and railways, with investments reaching nearly\nUS$1 trillion (S$1.37 trillion).\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nSingapore supports the BRI through the Chongqing Connectivity Initiative, an inter-governmental project that launched in 2015. The aim is to connect western China to South-east Asia and the rest of the world, with Singapore’s involvement.\nMr Chee said that besides being resilient, supply chains and connectivity options must also be environmentally sustainable.\n“There is scope for greater international collaboration, including through the BRI, to speed up technological advancement, develop supporting infrastructure to scale up adoption and invest in (the)\ntraining of workers to prepare them for the energy transition.”\nSenior Minister of State for Sustainability and the Environment Amy Khor said there was great potential for the BRI to build a greener Silk Road by championing environmental protection and climate action alongside economic, social and cultural development.\nThe next area for collaboration is in green finance, she said\nat a session titled New Outlook On Green Silk Road\n, adding that working in this area is a natural extension for Singapore, given its status as a global trading hub and reputable financial centre.\nMore must be done to reduce the barriers of capital flow to facilitate investments in this area. She noted that the Monetary Authority of Singapore and the People’s Bank of China\nannounced a taskforce in April\nto deepen cooperation in green and transition finance,\nas well as facilitate public-private sector partnerships.\n“This will help to galvanise collaboration on concrete initiatives that will catalyse capital flows to support a credible and inclusive transition to a low carbon future,” said Ms Khor.&nbsp;\nSingapore will do its part to contribute to sustainable development under the BRI, she added at a Wednesday session, Green Silk Road For Harmony With Nature.\n“As we continue our cooperation through the BRI, we can support climate mitigation and adaptation efforts alongside economic opportunities, while being mindful that our efforts to address climate change do not inadvertently create negative environmental impacts,” she said.\nMore on this Topic\nChina’s Xi warns against decoupling, lauds Belt and Road at forum\nIndonesia to seek China’s help to develop renewables at Belt and Road Forum\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's WhatsApp Channel\n&nbsp;\nand get the latest news and must-reads.\nSingapore\nChina\nBelt and Road Initiative\nSupply chains\nThanks for sharing!",
        "date": "2023-10-18",
        "is_related": true,
        "title": "Singapore politicians reiterate support for China's Belt and Road Initiative at high-level forum",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/chinas-xi-jinping-commits-to-more-investments-in-nigeria",
        "content": "ABUJA  -     China's President Xi Jinping pledged on Thursday for his country to increase investments in Nigeria's power generation sector and its digital economy, the Nigerian vice president's office said in the wake of a Belt And Road Initiative forum in Beijing.\nNigeria's National Agency for Science and Engineering Infrastructure (NASENI) and three Chinese partners signed contracts for new projects valued at $2 billion, Vice President Kashim Shettima's office said.\nIt added that another $4 billion worth of letters of intent was received for new projects and investments in different sectors of the economy.\nNigeria is seeking to attract investments to boost sluggish growth in Africa's biggest economy, which is saddled with mounting debt, high inflation and unemployment.\nThe agreements signed include vehicle assembly projects, solar products, vehicle design and production, drone technology transfer, clean energy utilisation and the development of an industrial park.\nNigeria also signed contracts with China Harbour Engineering Company for the construction of the Lekki Blue Seaport in Lagos.\nShettima met Xi, who asked for the protection of Chinese workers in Nigeria, according to the vice president's office.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nChina had committed to rail projects in Nigeria in the past and to a seaport in Bonny Island in the Niger Delta. But the projects are still waiting for loan disbursements after securing approvals from China Exim Bank and Nigeria's parliament.\nAt the Belt And Road Initiative Forum, China also committed to refinancing the completion of two rail projects that stalled due to a cut in China's funding commitments. China had earlier agreed to provide 85% of the financing for the rail projects. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nNigeria\nThanks for sharing!",
        "date": "2023-10-20",
        "is_related": true,
        "title": "China's President Xi Jinping pledges to increase investments in Nigeria's power generation sector and digital economy",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            {
                "Belt and Road Initiative": 2
            },
            {
                "Community of shared future": 1
            },
            {
                "China's influence": 1
            }
        ]
    },
    {
        "url": "https://straitstimes.com/asia/putin-and-xi-to-meet-in-beijing-in-october-russia-says",
        "content": "MOSCOW – Russia President Vladimir Putin will meet China’s Xi Jinping for talks in Beijing in October, Moscow said on Tuesday, his first known trip abroad since an arrest warrant was issued against him over the deportation of children from Ukraine.\nMr Nikolai Patrushev, a close Putin ally and the secretary of Russia’s Security Council, said Russia and China should deepen cooperation in the face of the West’s attempt to contain them both.\nHe was quoted by the Interfax news agency as saying that the talks in Beijing would be “thorough”, at a meeting in Moscow with China’s top diplomat, Wang Yi.\nMr Putin will attend the third Belt and Road Forum after an invitation by Mr Xi during a high-profile visit to Moscow in March.\nDays before that visit, the International Criminal Court (ICC) issued a warrant for Mr Putin’s arrest on suspicion of illegally deporting hundreds of children or more from Ukraine.\nMoscow denies the allegations and the Kremlin said the warrant was evidence of the West’s hostility to Russia, which opened a criminal case against the ICC prosecutor and the judges who issued the warrant.\nRussia’s full-scale invasion of Ukraine early last year has triggered one of the deadliest European conflicts since World War Two and the biggest confrontation between Moscow and the West since the 1962 Cuban Missile Crisis.\nMr Putin has pivoted towards China, and Mr Xi has stood by him.\nChinese-Russian trade has soared since the invasion, and Russia has sold Asian powers including China greater volumes of the oil it can no longer sell to the West because of sanctions.\nMr Putin last visited Beijing in February 2022, days before the invasion, where he and Mr Xi announced a “no limits” partnership. Moscow says this does not mean a military alliance, however.\nShared outlook\nBoth leaders share a broad world view, which sees the West as decadent and in decline just as China challenges US supremacy in everything from technology to espionage and military power.\nTrade between Russia and China soared 30 per cent in the first half of this year and will rise to more than US$200 billion (S$272 billion) in 2023, Russian Economy Minister Maxim Reshetnikov said on a visit to China.\n“We are actively developing investments, including in our large gas and petrochemical projects, where we actively use Chinese technologies,” Mr Reshetnikov said.\n“We are strongly interested in transforming technological cooperation into investment cooperation, so that Chinese companies actively enter into these projects, invest in capital, and lend money, because the projects are capital-intensive and not all of them can be fully provided for by the Russian financial system.”\nThe United States sees China as its gravest long-term “strategic competitor” and Russia as an “acute threat”.\nChina has refrained from condemning Russia’s operation against Ukraine or calling it an invasion, in line with the Kremlin, which casts the war as a “special military operation”.\nEarlier this year, CIA Director William Burns said Russia was becoming more and more dependent on China and was even at risk of becoming its “economic colony” in time. REUTERS\nMore on this Topic\nChina’s Wang Yi visits Russia ahead of possible Xi-Putin meeting\nRussia-China ties at ‘unprecedented historical level’, Putin says at meeting with Deputy Premier Zhang\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nChina\nRussia\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-09-19",
        "is_related": true,
        "title": "Putin to meet Xi in Beijing amid deepening Russia-China ties",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [
            {
                "Belt and Road Initiative": 2
            },
            {
                "China's influence": 0
            },
            {
                "China's soft power": 0
            },
            {
                "Community of shared future": 0
            },
            {
                "Community of common destiny": 0
            },
            {
                "Global Development Initiative": 0
            },
            {
                "Global Security Initiative": 0
            },
            {
                "Global Governance Initiative": 0
            },
            {
                "Global Civilization Initiative": 0
            }
        ]
    },
    {
        "url": "https://straitstimes.com/asia/pakistan-pm-sharif-calls-for-expansion-of-chinas-belt-and-road-initiative",
        "content": "ISLAMABAD – A China-led 10-state regional group criticised what it called protectionist trade measures on\nOct 16\n, part of an intensifying standoff between Beijing and Western countries over tariffs on Chinese products.\nThe Shanghai Cooperation Organisation (SCO), an Eurasian security and political group, also hit out at “unilateral sanctions” as member states Iran and Russia face curbs on trade.\nThe criticism came in a joint statement, following a heads of government meeting of the SCO in Islamabad, signed by 10 countries, including China, Russia, Iran, India and host Pakistan.\nThe statement said the 1\n0 member states\n“consider it important to continue joint efforts to counter protectionist trade measures” that are contrary to World Trade Organisation rules.\nThe United States and Canada have increased tariffs&nbsp;on Chinese products such as electric vehicles, aluminium and steel, and the European Union is set to follow suit. Beijing has termed the moves discriminatory, and responded with similar actions as the standoff intensifies.\nThe SCO also said that “unilateral application of sanctions” is against international law and has an impact on third countries.\nRussia and Iran, which\nface sanctions from the West, possess some of the world’s largest energy resources. But sanctions have meant that smaller countries have shied away from trade with the two SCO member states, even as larger more influential economies, such as China and India, continue to purchase energy from them.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nEnergy-starved Pakistan does not import gas or fuel from neighbouring Iran despite its cost-effectiveness, and a gas pipeline between the two nations has stalled due to Islamabad fearing US sanctions.\nEarlier at the meeting, Pakistan’s Prime Minister Shehbaz Sharif called for the expansion of China’s Belt and Road Initiative (BRI).&nbsp;&nbsp;&nbsp;&nbsp;\n“Flagship projects like the Belt and Road Initiative of President Xi Jinping... should be expanded focusing on developing road, rail and digital infrastructure that enhances integration and cooperation across&nbsp;our&nbsp;region,” he said in his speech as chair of the meeting.\nThe BRI is a\nUS$1 trillion (S$1.3 trillion)\nplan for global infrastructure and energy networks that China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nMore than 150 countries, including Russia, have signed up to participate in it.\nBeijing’s rivals see the BRI as a tool for China to spread its geopolitical and economic influence.\nWestern countries, under the G7 platform, last year announced a US$600 billion rival connectivity infrastructure development plan.\nThe\nChina-Pakistan Economic Corridor is a part of the BRI\nand has seen Beijing pump in billions of dollars into the South Asian country for road networks, a strategic port and an airport. REUTERS\nMore on this Topic\nPakistan to increase security for Chinese projects as Beijing calls for urgent steps\nChina sanctions US firms over arms sales to Taiwan\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nTrade\nShanghai Cooperation Organisation\nChina\nEmbargoes and economic sanctions\nThanks for sharing!",
        "date": "2024-10-16",
        "is_related": true,
        "title": "China-led regional group criticises protectionist trade measures amid standoff with West",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                3
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/china-issues-white-paper-on-global-community-of-shared-future-presses-on-with-green-bri-projects",
        "content": "BEIJING\n-\nChina on Tuesday unveiled its blueprint for a better world, raised by President Xi Jinping in 2013, through a policy paper on building a global community of shared future.\nBeijing also said it will continue to push for\ngreen development in Belt and Road Initiative (BRI) projects,\nrejecting claims that it has outsourced its environmental pollution,\na senior official from the country’s top economic planner\nsaid at a press conference on the wide-ranging policy paper about China’s global vision.\nThe White Paper titled “A Global Community of Shared Future: China’s Proposals and Actions” comes a decade after the vision was first proposed by Mr Xi, and has been presented as his alternative to the current Western-led world order, with an emphasis on what it calls Chinese-style diplomacy and various global initiatives.\nThis year\nalso\nmarks the 10th anniversary of the BRI, and China will host the third Belt and Road Forum for International Cooperation&nbsp;in\nOctober\n, with leaders and representatives from some 130 countries set to attend,\nincluding Russian President Vladimir Putin.\nBy July 2023, more than three-quarters of countries in the world and over 30 international organisations had signed agreements on Belt and Road cooperation with China, the White Paper said.\nIssued by the State Council Information Office, the White Paper said the vision rises above the exclusive rules of bloc politics, the notion of “might makes right” and the “universal values” defined by a handful of Western countries.&nbsp;\nChina has contributed to building a global community of shared future with actions including promoting high-quality Belt and Road cooperation, state news agency Xinhua said on Tuesday.&nbsp;\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nAt the press conference, in a rare appearance beyond his usual annual press conference in March, Foreign Minister Wang Yi said that by putting forward the creative idea, President Xi has shown “the correct path for the world”, building a strong consensus for international cooperation.\nChina has also proposed solutions to major global challenges in fields such as health, climate change and cyber security, Mr Wang added.&nbsp;\nHe said Beijing was willing to play a “constructive” role in the success of the Asia-Pacific Economic Cooperation (Apec) summit in November in San Francisco.\nIt paves the way for a possible meeting between Mr Xi and US President Joe Biden – both presidents last met on the sidelines of the Group of 20 (G-20) leaders’ summit&nbsp;in November\n2022\nin Bali.\nMr Xi did not attend the G-20 summit in India earlier in September, missing an opportunity to meet Mr Biden, and prompting the US to say China was “giving up” on the G-20 and building an alternative world order.\n“Of course, we and all parties also hope that the United States will realise its responsibilities as a host, show due openness, fairness, tolerance and responsibility, and create better conditions for the smooth holding of the meeting,” Mr Wang said, referring to the Apec summit.\nMore on this Topic\nChina Vice-President says country committed to opening itself wider to the world\nChina’s foreign policy is viewed negatively, but its investments are welcome: Pew report\nEarlier on Tuesday, Hong Kong Chief Executive John Lee said he had\nyet to receive any invitation to the November meeting.\nIt follows US media reports in July that he had been barred from the meetings after being sanctioned by Washington for what it calls his role in cracking down on civil liberties in the Asian financial hub.\nMr Wang repeated a frequent Chinese warning that China opposes “wanton expansion of military alliances” and the squeezing of the security space of other countries.\nBeijing has been critical of Washington’s continued attempts to increase military cooperation in the Indo-Pacific region, including the Quad and the Aukus groupings. It particularly disagrees with bases that are being built by the US in the north of the Philippines.\nDialogue between China and the US has been gradually resuming despite continued tensions, with several high-level\nvisits to Beijing in recent months by top US officials,\nincluding Secretary of State Antony Blinken,\nTreasury Secretary Janet Yellen and Secretary of Commerce Gina Raimondo.\nMeanwhile, not all is rosy with China’s BRI, which has been criticised for causing environmental destruction in project areas, including building coal-fired power plants overseas despite a national commitment domestically to reach peak carbon output by 2030, and to be carbon-neutral by 2060.\nEarlier in 2023, a report in The Jakarta Post said the Batang Toru hydropower project, which is 70 per cent owned by Chinese-owned State Development and Investment Corporation’s subsidiary SDIC Power, had encroached on the habitat of the endangered Tapanuli orangutan, forcing them to intrude on nearby farms and villages.\n“The joint construction of the ‘Belt and Road’ projects is carried out based on\nthe principle of\nextensive consultation, joint construction and shared benefits,” Mr Cong Liang, deputy director of the National Development and Reform Commission (NDRC), said in response to a question from The Straits Times at the press conference.\n“Whether the development is green or not, I think the (partner country) knows best, the local people have the most say, and facts are always more convincing than words.”\nMore on this Topic\nAs America’s influence in Asia wanes, Asian economies are integrating\nChinese-funded railways bring tourists to SE Asia, but they also cause tensions\nIt is “not worth refuting” the voices that slander the Green Silk Road – an initiative to make BRI projects more ecologically sustainable – and those who attempt to smear and interfere with joint projects will not succeed, he added.\nTouting the BRI’s success, officials said projects such as the high-speed rail between Jakarta and Bandung, the Phnom Penh-Sihanoukville Expressway, and the Greek port of Piraeus have increased connectivity, rejuvenating the local economies with jobs and trade.\n“In the next step, the NDRC will work with relevant departments… (and) continue to build high-quality landmark projects, promote ‘small but beautiful’ projects, deepen cooperation in key areas such as infrastructure and people’s livelihood projects to achieve complementary advantages, mutual benefits and win-win results,” Mr Cong&nbsp;said.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nEnvironmental issues\nThanks for sharing!",
        "date": "2023-09-26",
        "is_related": true,
        "title": "China unveils blueprint for global community of shared future",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Community of shared future",
                5
            ],
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                2
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/business/bt-future-of-finance-uob-building-community-through-art",
        "content": "UOB is a leading patron of art in Asia, championing Southeast Asian art and artists across the region over the past four decades. What is the connection between art and banking? How has this shared history shaped UOB’s business today?\nLee Kim Siang sits down with Christine Ip, head of group strategic communications and brand, UOB, to find out.\nSynopsis:&nbsp;\nThe Business Times\n&nbsp;Branded Podcasts; finely curated, intelligent, thought provoking content for decision-makers. Inspired by the newsroom of your trusted partner.\nFollow on audio apps Apple Podcasts, Spotify and Google Podcasts, or Google Home smart speaker devices. Produced by&nbsp;\nThe Business Times\n, SPH Media.\nThis episode of Future of Finance podcast is presented by UOB.\nHighlights:\n02:11 History of UOB’s Painting of the Year Competition\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n03:45 Art’s role in UOB Heartbeat, the bank’s CSR programme\n05:29 The impact of UOB’s Painting of the Year competition\n06:54 Collaboration with customers and artists\n08:01 Strengthening relationships with customers through art\nMore about:\nChampioning Southeast Asian Art -\nhttps://www.uobgroup.com/uobandart/index.html\nHosted by: Lee Kim Siang (\nkimsiang@sph.com.sg\n)\nWith Christine Ip, head of group strategic communications and brand, UOB\nEdited by: Emily Liu &amp; Claressa Monteiro\nProduced by: Emily Liu\nEngineered by: Joann Chai Pei Chieh\nExecutive producer: Claressa Monteiro\nA podcast by BT Podcasts,&nbsp;\nThe Business Times\n, SPH Media\n---&nbsp;\nFollow Future of Finance podcasts:\nChannel:&nbsp;bt.sg/btbrpod\nApple Podcasts:&nbsp;bt.sg/bpap\nSpotify:&nbsp;bt.sg/bpsp\nGoogle Podcasts:&nbsp;bt.sg/bpgo\nWebsite:&nbsp;bt.sg/brpod\nFeedback to:&nbsp;\nbtpodcasts@sph.com.sg\nDo note: This podcast is meant to provide general information only. SPH Media accepts no liability for loss arising from any reliance on the podcast or use of third party’s products and services. Please consult professional advisors for independent advice.&nbsp;\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nST Podcasts\nBT Podcast\nST Money &amp; Career Podcast\nThe Future of Finance\nThanks for sharing!",
        "date": "2024-02-26",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/g7-leaders-launch-initiative-for-global-food-security",
        "content": "BARI, Italy - Group of Seven leaders have pledged to step up efforts against global malnutrition, according to a draft statement on Friday that noted Russia's invasion of Ukraine had \"aggravated\" the world's food problems.\nThe G7 Apulia Food Systems Initiative (AFSI) - named after the Southern Italian region hosting the leaders' summit - will aim to \"overcome structural barriers to food security and nutrition,\" according to the draft.\nThe initiative will focus on low-income countries and support projects in Africa, one of the top priorities under Italy's rotating G7 presidency this year.\nPrime Minister Giorgia Meloni announced a flagship Italian plan to help Africa earlier this year and has repeatedly said that support for the continent is essential to address the root cause of illegal migration to Europe.\nThe Western powers also committed to work together to \"improve the fiscal space for food security\" including by reducing borrowing costs for poorer nations via mechanisms such as debt swaps.\nDebt-for-nature swaps are financial instruments through which a developing country's debt is cut in return for protecting vital ecosystems.\nThe AFSI initiative, whose details will be agreed by G7 development ministers in the coming months, drew criticism from African agricultural groups who said they had not been consulted.\n\"It is missing family farmers organisations that have not been involved even though small-scale producers will be key to its success,\" said Ibrahima Coulibaly, President of the West African Network of Peasants and Agricultural Producers.\n\"And it's missing a plan to ensure that the finance raised gets to family farmers and supports a shift to more diverse and nature friendly approaches which are key to adaptation. The G7 urgently needs to fill these gaps.\" REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nFood security\nGiorgia Meloni\nThanks for sharing!",
        "date": "2024-06-14",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/se-asia/soft-served-power-china-s-fb-brands-expand-in-south-east-asia",
        "content": "SINGAPORE -\nSweet treats from mainland China, from ice cream to bubble tea to lattes, are fast becoming a familiar sight across South-east Asia.\nOne unmistakable flag-bearer is Mixue, a wallet-friendly soft-serve ice cream and bubble tea chain from the central Chinese province of Henan.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nChinese food\nAsean\nFood and drink\nFood and beverage sector\nST Asia Future Summit\nThanks for sharing!",
        "date": "2023-12-24",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/china-s-hit-game-black-myth-wukong-has-tricky-legends-behind-it",
        "content": "I’m not a gamer, but I perked up to the news recently that millions of people around the world are obsessed by a virtual role-playing extravaganza based on a 16th-century Chinese novel about a trickster monkey, a naive monk, a laconic hermit and a libidinous pig.\nBlack Myth: Wukong,\nseven years in the making from Shenzhen-based Game Science, set records on Steam, the online store and video-game distribution service that about 70 million people use daily. On the day it made its debut alone, more than 2.1 million people got on the site to engage in Black Myth’s swords-and-sorcery duels. That is a one-day record for a single-player game and, when all on Steam are considered, is exceeded by only one other – the multiple-participant PUBG: Battlegrounds, where 100 individual gamers race to ransack a variety of sites and terrains until only one remains.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nGaming/Video games\nCulture\nThanks for sharing!",
        "date": "2024-08-25",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/football/games-politics-officiating-mishaps-mar-chinas-covid-delayed-games",
        "content": "HANGZHOU – With no major security incidents and a record gold medal haul for its athletes, China will regard the 19th Asian Games in Hangzhou as a soft power triumph that ticked a number of political, sporting and operational boxes for the hosts.\nIn reality, the nation's first major sporting event in the post-COVID era was marred by diplomatic tensions, slapdash officiating and a dearth of accountability by the organising bodies.\nBefore its dazzling opening ceremony, the Games were overshadowed by a visa row that prevented three Indian athletes from competing.\nThe martial artists were from a region of India contested by China, and India’s sports minister cancelled a planned visit to the Games in protest.\nThe Olympic Council of Asia (OCA), which runs the multi-sport event, said it was looking into the issue but never offered another word about it.\nThe Games' clumsy official slogan was \"Heart to Heart, @Future\" but a more suitable one might have been: \"Let things slide.\"\nNorth Korea arrived in force for its first major sporting event since the 2018 Asian Games, having shut its doors to the world — and international drug testers — for years.\nBeing non-compliant to the global anti-doping code, the reclusive nation’s flag is banned at multisport events outside the Olympics but flew at Hangzhou with the backing of the OCA.\nAbout 12,400 athletes from 45 countries competed, a year later than scheduled because of COVID-19.\nWorld-class quality was sparse in much of the 40-sport programme but there were some stunning achievements, notably in the pool, where China's swimmers shone.\nHaving been beaten by Japan for swimming medals at Jakarta, China won 28 of the 41 titles, continuing its resurgence after an impressive world championships in Fukuoka.\nButterfly queen Zhang Yufei and breaststroke king Qin Haiyang combined for 11 golds, earning the Games' MVP awards.\nTeenager Pan Zhanle emerged as a threat for the Olympic 100 metres freestyle next year, swimming at world record pace in the 4x100m medley relay.\nDominating in their traditional strengths of badminton, diving and table tennis, China topped the medal table for the 11th successive Games with 201 golds, outstripping their previous best of 199 at Guangzhou in 2010.\nSecond-placed Japan had 52 golds and South Korea was third with 42. Big improvers India were thrilled to finish fourth with a national record 28 golds, and smashed their target of 100 medals overall.\nBreakdancers competed at the Games for the first time in a preview of the discipline's Paris Olympic debut.\nEsports' debut as a medal event proved a hit. Local fans  flocked to see star South Korean gamer Lee Sang-hyeok, better known as \"Faker\", in the \"League of Legends\" category.\nRested from the final, Lee joined his teammates in winning gold and a coveted exemption from South Korea's compulsory military service.\nParis St Germain midfielder Lee Kang-in can also skip military service, with South Korea beating Japan 2-1 in the men's soccer final.\nQatari high jump great Mutaz Barshim cruised to a third Asian Games gold, but the athletics was marred by controversy and official blunders.\nAn official suffered a broken leg and serious bleeding after being hit by a misthrown hammer.\nOlympic and world champion Neeraj Chopra won the javelin but had to re-take his first effort after a long and confusing hiatus, with officials having failed to record his mark.\nThe women's 100m hurdles descended into farce when China's Wu Yanni had a clear false start only for officials to disqualify Indian rival Jyothi Yarraji.\nEventual silver medallist Yarraji, who was a step behind Wu, protested and officials corrected their decision, but Wu was allowed to run under protest before finally being disqualified.\nThe men's kabaddi final between India and Iran was halted for an hour over an officiating dispute that saw both teams stage sit-down protests.\nAfghanistan, however, had no recourse when their men's cricket final against India was abandoned because of rain.\nWith no spare day allocated for the weather and no provision to share the medal, India were awarded the gold purely by virtue of their higher world ranking.\nNorth Korea were sore losers after falling 2-1 to Japan in the men's soccer quarter-finals. Security staff intervened after several of their players mobbed and manhandled the referee on field after the match ended.\nThe Games' drug testers reported seven athletes had been banned for positive tests, including a Turkmenistan athlete who took silver in kurash, the central Asian wrestling event.\nBacked by the OCA and the IOC, women represented Afghanistan in cycling, volleyball and athletics, in defiance of the Taliban, which has halted women's sport in the country.\n\"Nowadays, they are looking for hope,\" said Afghan volleyballer Mursal Khedri of women athletes in the nation. \"By seeing us here they can find hope.\"\nREUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nAsian Games\nWrestling\nWorld record\nThanks for sharing!",
        "date": "2023-10-09",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/lula-struggles-to-revive-brazils-soft-power-amid-us-china-tensions",
        "content": "BRASILIA  -     Since he returned to office in January, Brazil's President Luiz Inacio Lula da Silva has traveled to 21 countries and met with more than 50 heads of state, including two kings and the Pope.\nThe globe-trotting leftist leader, the first head of state to address the United Nations General Assembly on Tuesday, has prioritized foreign trips in his third term so far, as he strives to restore his country as a global player.\n\"Brazil is back,\" he repeats in speeches across five continents, in contrast with the growing isolation that came with his predecessor Jair Bolsonaro's hard-right political stance and dismal environmental record.\nBut diplomats and foreign policy experts say Lula is far from restoring the \"soft power\" status Brazil enjoyed after his first two terms, from 2003 to 2010, when the country became a voice for the rising global south while remaining independent from both the U.S. and China.\nIn part, that reflects the choppier waters the 77-year-old Brazilian leader now navigates, as Beijing and Washington flirt with a new Cold War while war rages in Ukraine. Brazil has also become increasingly dependent on Asian markets, which buy half of its exports. China alone, Brazil's main trading partner, buys 37% of its farm exports.\n\"This is a very tricky balancing act and Lula so far has not been able to find the right equilibrium,\" said Oliver Stuenkel, an associate professor of international relations at the FGV think tank in Sao Paulo. \"There is a perception in Brazilian society now that he is tilting towards the Sino-Russian axis more than the West.\"\nOn Wednesday, Lula is scheduled to meet U.S. President Joe Biden to discuss the climate crisis on the sidelines of the U.N. General Assembly, focusing where the Brazilian leader has shined.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nLula has helped to restore Brazil's central role in climate diplomacy, leading a regional rainforest summit, drawing global contributions to protect the Amazon and overhauling policies to bring down deforestation sharply.\nEven before he took office, Lula was greeted like a rock star last November at the U.N. climate change conference in Egypt. His polices have helped to nearly halve deforestation of the Brazilian Amazon through August, compared to the first eight months of last year, rebuilding Brazil's credibility for climate talks.\nBut his comments about the war in Ukraine - he has said both sides are responsible for the conflict as he sought to broker a peace deal - have angered U.S. and European allies, who have accused him of parroting Russian rhetoric.\nLula's penchant for off-the cuff remarks have occasionally made matters worse.\nDuring a G20 meeting in India this month, he said there was \"no way\"&nbsp;Russian President Vladimir Putin would be arrested if he attended next year's summit in Rio de Janeiro. When reporters probed him on Brazil's commitments to enforce an arrest warrant issued by the International Criminal Court, he rowed back his comments but suggested Brazil could leave the ICC.\n\"There have been some bruising moments. The whole Russia -Ukraine issue was a lesson learned,\" said Thomas Shannon, a former U.S. ambassador to Brazil who is now senior international policy advisor at Arnold &amp;amp; Porter.\nAt last month's BRICS summit in South Africa, where the group of leading emerging economies expanded its membership as China called for, Brazil got Chinese backing for a permanent U.N. Security Council seat it wants. But that is unlikely to happen any time soon, according to Shannon.\nThe closer ties to Beijing could complicate Brazil's relationship with Washington, including access to key technology, Shannon added.\n'OUTDATED AGENDA'\nCloser to home, Lula has reaped little in concrete terms from Latin America's broad left-of-center alignment. The Mercosur trade bloc took nearly half a year to respond formally to a new European position on a trade deal now on the ropes.\nAnd Lula's longstanding sympathies with leftist governments in Nicaragua and Venezuela accused of human rights abuses have him looking out of step with a new generation of progressive Latin American leaders.\nLula rolled out the red carpet for Venezuelan President Nicolas Maduro in Brasilia at a regional summit in May, helping to bring the socialist leader out of isolation. Other leaders, including Chile's leftist President Gabriel Boric, criticized Maduro's presence.\nImpressions of ideological bias may hurt Brazil's image as the country returns to the international spotlight, putting Lula at odds sometimes with his Foreign Ministry, said Rubens Barbosa, a former Brazilian ambassador to London and Washington.\n\"Where is Brazil the defender of human rights? It's not clear what Brazil stands for today when it picks Putin and Maduro as allies,\" said a South American ambassador in Brasilia, who asked not to be identified.\n\"Brazil is rapidly wasting its soft power by trying to be an international player with an outdated agenda,\" he said. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBrazil\nVladimir Putin\nLatin America\nThanks for sharing!",
        "date": "2023-09-18",
        "is_related": true,
        "title": "Lula's Global Diplomacy: Balancing Act Between East and West",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/opinion/china-s-global-south-strategy-is-paying-off",
        "content": "Major world leaders gather this week in India for the G-20 summit. All, that is, except one: China’s President Xi Jinping is\nreported to be planning on skipping the meeting,\nsending Premier Li Qiang to New Delhi in his place.\nMr Xi’s decision underlines the challenges faced by the G-20, arguably still the world’s most important multilateral grouping. The body has struggled over recent years to operate effectively in the face of rising geopolitical competition. Its attempts to solve world problems typically end up stymied in rows between the United States and its partners on the one hand, and China and Russia on the other.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nIndia\nG-20 (Group of 20)\nGeopolitics\nDiplomacy\nThanks for sharing!",
        "date": "2023-09-04",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/world/us-and-vietnam-ink-historic-partnership-in-biden-visit-with-eyes-on-china",
        "content": "HANOI/WASHINGTON\n-\nUS President Joe Biden on Sunday secured deals with Vietnam on semiconductors and minerals as the strategic South-east Asian nation lifted Washington to Hanoi's highest diplomatic status alongside China and Russia.\nThe US has been pushing for the upgrade for months as it sees the manufacturing dynamo as a key country in its strategy to\nsecure global supply chains from China-related risks.\nA half-century after a lengthy and brutal Cold War-era conflict, Mr Biden arrived in Hanoi to a ceremony organised by the ruling Communist Party that included school children waving American flags and honour guards carrying bayoneted rifles.\nHe noted the strides that had been taken towards improved ties.\n\"We can trace a 50-year arc of progress between our nations, from conflict to normalisation, to this new elevated status,\" he said.\nThe partnership with Vietnam is part of the Biden administration’s push\n“to demonstrate to our  Indo-Pacific partners and to the world, the United States is a Pacific nation and we’re not going anywhere”, Mr Biden told reporters after the meeting in Hanoi.\nVietnam is navigating frosty relations between Washington and Beijing as the tech and textile exporter seeks its own foothold in the international competition to be a low-cost manufacturing hub.\nTop Chinese officials, possibly including President Xi Jinping, are expected to visit Vietnam in the coming days or weeks, officials and diplomats said, as Hanoi seeks to maintain good relations with all super powers.\nMr Biden also said in Hanoi he had talked with Mr Xi's deputy at the G-20, and that the two discussed  stability.\nCommunist Party General Secretary Nguyen Phu Trong, 79, remarked on the 80-year-old US president’s appearance inside party headquarters, saying: “You have nary aged a day and I would say you look even better than before.”\nRussian arms talks&nbsp;\nVietnam's longstanding relationship with Russia faces tests over the war in Ukraine, including talks with Moscow over a new arms supply deal that could trigger US sanctions.\nReuters has seen documents describing talks for a credit facility that Russia would extend to Vietnam to buy heavy weaponry, including anti-ship missiles, anti-submarine aircraft and helicopters, anti-aircraft missile systems and fighter jets.\nOne of them, a letter sent in May by Vietnam’s Prime Minister Pham Minh Chinh to the Russian government, showed interest in the possible new deal.\nMore on this Topic\nUS and China to discuss export controls but analysts do not expect breakthroughs\nUS’ Raimondo raises chip issues with China officials; working group set up to discuss trade tensions\nA Vietnamese military officer confirmed the authenticity of the letter and the talks for a new US$8 billion (S$11 billion) credit facility to buy heavy weaponry.\nA spokesman for Vietnam's foreign ministry did not respond to multiple requests for comment on the documents, which show Moscow pushing for months for a loan deal that would bypass Western sanctions on Moscow.\nHanoi is in similar talks with multiple arms suppliers, including the United States. In recent weeks, Vietnam has engaged in several high-level defence meetings with top Russian officials.\nThe US-Vietnam upgrade will include a security dimension, Mr Jon Finer, the US principal deputy national security adviser, told reporters on Sunday, while on the plane with Mr Biden to Vietnam from a Group of 20 summit in India.\nHe said he had no arms deals to announce at this stage but stressed that the US and its partners could offer Vietnam help to diversify away from Russian military supplies, an offer which he said Vietnam was receptive to.\nThat would help Vietnam reduce military reliance on Moscow, “a relationship we think they are increasingly uncomfortable with”, Mr Finer said.\nChips, rare earths\nMr Biden's visit comes as bilateral trade and investment ties are growing and a long-simmering territorial dispute between Vietnam and China heats up in the South China Sea.\nVietnam Airlines is expected to sign an initial agreement to buy about 50 Boeing (BA.N) 737 Max jets in a deal valued at US$10 billion, timed to the trip.\nHighlighting Vietnam’s growing importance as a “friend-shoring” destination for US technology companies, executives from Google, Intel, Amkor, Marvell, GlobalFoundries and Boeing are expected to meet on Monday with Vietnamese tech executives and Secretary of State Antony Blinken in Hanoi.\nStill, semiconductors are the centrepiece of an action plan adopted during Mr Biden’s visit, US officials said.\nBesides possible announcements by US corporations, it is unclear what else the the partnership could mean. The US government has US$100 million a year for five years available under the Chips Act to support semiconductor supply chains globally. A large part of it could go to Vietnam, officials said.\nMore support to train skilled workers is also part of the deal, as Vietnam faces a major shortage of engineers in the chips sector.\nAnother key issue is strengthening supply chains of critical minerals, especially rare earths, of which Vietnam has the world's largest deposits after China, according to US estimates, officials said.\nTwo people familiar with the plans said an agreement on rare earths was expected during Mr Biden's visit, which ends on Monday when he flies back to America.\nDetails, however, are scant. Past attempts by US companies to partner with Vietnamese rare earth firms have not succeeded, according to a person involved in one recent plan.\nHuman rights remain a controversial issue, with US officials regularly criticising Hanoi for jailing activists and limiting freedom of expression. Vietnam may show goodwill, with diplomats suggesting activists could be freed.\nREUTERS\nMore on this Topic\nUS’ Raimondo raises chip issues with China officials; working group set up to discuss trade tensions\nChip companies, top US officials discuss China policy\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVietnam\nSupply chains\nXi Jinping\nUS news\nThanks for sharing!",
        "date": "2023-09-10",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/se-asia/indonesia-vietnam-discuss-south-china-sea-security-evs-as-jokowi-visits",
        "content": "HANOI – The leaders of Indonesia and Vietnam highlighted security in the South China Sea and investments in Indonesia by\nelectric vehicle (EV) maker VinFast\nin joint statements after a meeting on Jan 1\n2,\nas President Joko Widodo visited Hanoi.\nThe two South-east Asian countries are strengthening their ties with corporate investments, more trade and closer cooperation on boosting security in the\ncontested South China Sea amid tensions with Beijing.\nVietnam’s President Vo Van Thuong stressed the importance of maintaining peace and stability in the South China Sea in a statement after he met Mr Widodo, widely known as Jokowi.\nThe two countries signed a memorandum of understanding (MOU) on fisheries cooperation. The text is not public, but it may address Vietnamese fishermen’s encroachments in other countries’ waters, which is a regular source of tension in the region.\nAhead of Mr Widodo’s trip, Indonesia’s Foreign Minister Retno Marsudi said the country was ready to work with other South-east Asian nations to finalise a long-delayed code of conduct for the South China Sea, a strategic waterway for trade and energy.\nA Vietnamese official confirmed the matter would be discussed in Hanoi during Mr Widodo’s visit.\nA South-east Asian code of conduct would be seen as a blow to China.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBeijing and South-east Asian nations have been trying since 2002 to set up a framework to negotiate the code of conduct, but progress has been slow despite commitments by all parties to advance and expedite the process.\nIndonesia and Vietnam agreed in 2022 to recognise the boundaries of their exclusive economic zones in the South China Sea, a move that was seen as a challenge to Beijing, which claims almost the entire strategic trade route.\nIndonesia had previously said it planned to export gas to Vietnam from gas fields in the South China Sea.\n“We agreed to cooperate on energy transition,” Mr Widodo said in his statement alongside Mr Thuong.\nMore on this Topic\nVietnam’s&nbsp;top leader Nguyen Phu Trong misses meetings amid health concerns\nRussia’s dilemma in the South China Sea\nVinFast\nMr Widodo, who will visit VinFast’s EV factory in northern Vietnam on Jan 1\n3\n, praised the company’s plans to invest US$1.2 billion (S$1.6 billion) in a plant and other operations over the longer term in Indonesia.\nMr Thuong encouraged Indonesian firms to invest more in Vietnam, including in the banking sector.\nThe two nations also signed an MOU on information technology and communication cooperation.\nBilateral trade between the nations rose by 23 per cent to US$14.1 billion in 202\n3\nand the goal is for that to soon reach US$15 billion, the Vietnamese President said.\nMr Widodo’s visit to Hanoi is part of a larger South-east Asian trip including\na prior stop in the Philippines\nand an expected visit to Brunei this weekend, before Indonesian elections in Februar\ny\n.\nHe is expected to meet other Vietnamese leaders on Jan 1\n2\n, but contrary to normal practice, Mr Widodo is not scheduled to meet\nCommunist Party general secretary Nguyen Phu Trong\n, amid concerns about the elderly leader’s health.\nSince 2022, Vietnam has pursued a strategy of improving ties with global powers and partners, and Mr Thuong said he was confident formal relations could be boosted with Indonesia as well.\nREUTERS\nMore on this Topic\nVietnam EV maker VinFast to invest up to $2.66 billion in India\nAn inside look into VinFast, Vietnam's Tesla hopeful with lofty goals\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVietnam\nIndonesia\nJoko Widodo\nPoliticians\nDiplomacy\nThanks for sharing!",
        "date": "2024-01-12",
        "is_related": true,
        "title": "Leaders of Indonesia and Vietnam Highlight Security and Investments Amid South China Sea Tensions",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/opinion/why-the-west-should-not-dismiss-the-building-of-a-brics-wall",
        "content": "Back in February 2022, when Russia\nlaunched a full-scale military invasion of Ukraine,\nit was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah.\nYet for much of this week, Mr Putin will act as gracious host to dozens of heads of state and government from around the world attending a summit of\nthe so-called\nBrics, an intergovernmental association initially founded by Brazil, Russia, India and China, and then – after a brief interval – joined by South Africa.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBrics\nChina\nRussia\nGeopolitics\nUS-China ties\nUS-Russia ties\nEmbargoes and economic sanctions\nUkraine\nBrazil\nThanks for sharing!",
        "date": "2024-10-21",
        "is_related": true,
        "title": "Back in February 2022, when Russia launched a full-scale military invasion of Ukraine, it was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah. Yet for much of this week, Mr Putin will act as gracious host to dozens of heads of state and government from around the world attending a summit of the so-called Brics, an intergovernmental association initially founded by Brazil, Russia, India and China, and then – after a brief interval – joined by South Africa.",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/asia/putin-arrives-in-kazakhstan-for-russia-china-dominated-sco-summit",
        "content": "ASTANA - Russian President Vladimir Putin and China's Xi Jinping hailed  their Eurasian security club on Wednesday as a force for global stability at a summit of the regional body, which is seen by Moscow and Beijing as a tool to counter Western influence.\nPutin and the Chinese president have expanded the Shanghai Cooperation Organisation (SCO), a club founded in 2001 with Russia, China and Central Asian nations, to include India, Iran and Pakistan as a counterweight to the West.\n\"The organisation has firmly established itself as one of the key pillars of a fair, multipolar world order,\" Putin said, adding that bilateral ties between Moscow and Beijing were at their best in history.\n\"Our cooperation is not aimed against anyone, we are not creating any blocs or alliances, we are just acting in the interests of our peoples,\" Putin said.\nIn his opening remarks, Xi told Putin that China and Russia should \"uphold the original aspiration of friendship for generations\" in response to an \"ever-changing international situation\".\nCalling Putin an \"old friend\", Xi alluded to the progress the two countries had made in putting in place \"plans and arrangements for the next development of bilateral relations\".\nThe Kremlin said Putin had held a series of bilateral meetings on the sidelines of the SCO summit, which is taking place in Astana, capital of Kazakhstan, and ends on Thursday.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nThe SCO promotes common approaches to external security threats such as drug trafficking and also focuses on countering any domestic instability.\nAhead of his meeting with Xi, Putin met Turkish President Tayyip Erdogan, Pakistani Prime Minister Shehbaz Sharif, and the presidents of Azerbaijan and Mongolia, Ilham Aliyev and Ukhnaagiin Khurelsukh.\nIndia said Prime Minister Narendra Modi, who is expected in Moscow later this month, would not attend the Astana gathering, sending Foreign Minister Subrahmanyam Jaishankar instead.\n'NO LIMITS' PARTNERSHIP\nChina and Russia declared a \"no limits\" partnership in February 2022 when Putin visited Beijing, days before he sent tens of thousands of troops into Ukraine. Since then, Xi and Putin have deepened relations.\nXi and Putin believe the U.S-dominated post-Cold War era is crumbling. The U.S. casts China as its biggest competitor and Russia as its biggest nation-state threat. U.S. President Joe Biden says this century will be defined by an existential contest between democracies and autocracies.\nAt last year's virtual summit, the group criticised what it called the negative impact of \"unilateral and unlimited expansion of global missile defence systems by certain countries or groups of countries\", without directly referring to NATO expansion or Western military assistance to Ukraine.\nIn a move that highlighted Beijing's pragmatic economy- driven approach, Xi presided over a ceremony on Wednesday with his Kazakh counterpart just hours before meeting Putin, to mark the departure of a fresh batch of cargo along the Trans-Caspian International Transport Route.\nThe route, also known as the Middle Corridor, starts in southeast Asia and China, runs through Kazakhstan, the Caspian Sea, Azerbaijan, Georgia and further to Europe. It has been heavily promoted by the West as an alternative to Asia-Europe land transit via Russia.\nBelarus will attend the Astana summit for the first time as a full member of the SCO, the Kremlin said. United Nations Secretary-General Antonio Guterres is also expected to attend the Astana gathering. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nChina\nXi Jinping\nThanks for sharing!",
        "date": "2024-07-03",
        "is_related": true,
        "title": "Putin and Xi hail Eurasian security club as force for global stability",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/opinion/from-apple-to-starbucks-western-firms-china-dreams-are-dying",
        "content": "Things have never looked rosier for foreign firms in China – at least according to the country’s Council for the Promotion of International Trade. The body, which is controlled by the Commerce Ministry, claims that 90 per cent of foreign companies rate their experience in China as satisfactory or better. According to a recent survey by the council, foreign firms say the economy is strong, local markets are attractive, and their outlook is bright. Following years of isolation during the Covid-19 pandemic, China’s government insists that the country is open again for business, and that reforms have made life easier for foreign companies.\nExecutives of those companies scoff at all this. Many say they now struggle to justify investing in the country and talk instead of cutting staff. In a recent survey by the American Chamber of Commerce in Shanghai, less than half of respondents said they were optimistic about the prospects for their business in China over the next five years – a record low. On Dec 4, Ms Mary Barra, the boss of General Motors (GM), said the American carmaker would write down the value of its joint ventures in the country by more than US$5 billion (S$6.7 billion) and close factories there. Many American and European companies with once-thriving businesses in China are watching these unravel.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nInvestment\nDonald Trump\nUS-China trade war\nApple\nVolkswagen\nThanks for sharing!",
        "date": "2024-12-09",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/football/late-zhang-yuning-winner-reignites-chinas-world-cup-dream-saudis-hold-australia",
        "content": "JAKARTA - China reignited their World Cup qualification hopes with a last-gasp 1-0 win over Bahrain in Riffa thanks to a Zhang Yuning strike after Herve Renard marked his return to the Saudi Arabia dugout with a 0-0 draw against hosts Australia on Nov 14.\nThe Chinese moved to six points from five games with Zhang's 91st minute winner, the result pulling Branko Ivankovic's side level with the Australians and Saudis and four points behind Japan in Group C as the qualifiers reach the halfway point.\nSouth Korea cemented their hold on top spot in Group B with a 3-1 win at hosts Kuwait, while Group A leaders Iran survived a second-half scare to defeat North Korea 3-2 after conceding two goals following Shojae Khalilizadeh's 51st minute red card.\nThe top two finishers in each of Asia's three qualifying groups advance automatically to the 2026 finals in North America while the third and fourth placed nations progress to another phase of preliminaries.\nThe Chinese rekindled their hopes of a first World Cup appearance since 2002 when Zhang pounced to defeat Bahrain with a goal from close range moments after the hosts had seen Ali Haram's effort ruled out by VAR for offside.\nChina's win leaves them level with Australia and Saudi Arabia, who shared the points at Melbourne Rectangular Stadium.\nThe Australians continue to hold onto second place in the group on goal difference from Renard's Saudi Arabia with China in fourth. Bahrain are fifth on five points.\nJapan lead with 10 points and take on last-placed Indonesia in Jakarta on Nov 15.\nIran consolidate\nIran consolidated their position at the top of Group A after Amir Ghalenoei's side survived a turbulent second half to hand North Korea defeat in a five-goal thriller at the New Laos National Stadium in Vientiane.\nMehdi Ghayedi put the visitors ahead in the 29th minute before two goals in four minutes from Mohammad Mohebi gave the Iranians a comfortable halftime cushion.\nBut Khalilzadeh's sending off for a foul on Ri Jo Guk changed the game.\nMehdi Taremi sliced in an own goal in the 56th before Kim Yu Song bundled home a second for the Koreans three minutes later.\nTaremi was then denied from the penalty spot by Kang Ju Hyok after 67 minutes and Ri hit the bar as Iran clung on to escape with the win.\nSouth Korea maintained their grip on top spot in Group B with victory over Kuwait as Son Heung-min scored his 50th international goal.\nOh Se-hun headed Korea's opener in the 10th minute before Son doubled the lead from the penalty spot nine minutes later.\nAlthough Mohammad Daham pulled one back on the hour mark, Bae Jun-ho struck with 16 minutes left to wrap up a win that takes Hong Myung-bo's side to 13 points.\nJordan, who were in second in Group B going into Thursday's matches, will face Iraq later with Oman hosting Palestine.\nIn Group A, Asian champions Qatar take on Uzbekistan while the United Arab Emirates face Kyrygzstan. REUTERS\nMore on this Topic\nLate drama as Saudi Arabia hold Australia in World Cup qualifier\nFootball ‘world order’ is changing, says Brazil coach\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nWorld Cup\nChina\nSaudi Arabia\nThanks for sharing!",
        "date": "2024-11-14",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/shooting-chinas-xie-shoots-gold-in-dream-debut",
        "content": "CHATEAUROUX, France - Xie Yu of China struck gold in a dream Olympic debut, displaying the poise of a veteran in the men's 10 metre air pistol event on Sunday.\nSouth Korea dominated the women's event claiming the gold and silver through Oh Ye-jin and Kim Ye-ji respectively.\nManu Bhaker's bronze is India's first medal in the Paris Games.\nAfter China won the 10 metre air rifle mixed team event on Saturday, Xie (240.9) mined another gold from the Chateauroux Shooting Centre, beating Italian Federico Nilo Maldini (240) who took the silver medal.\nPaolo Monna (218.6) claimed bronze with clear daylight between the top three and rest of the field.\n\"If I hadn't won, this may have been my biggest regret,\" Xie told reporters.\n\"It is very difficult to be selected for China for the Olympics, so to be able to stand here today, on this higher stage, is very significant for me.\"\nXie carried a wafer-thin cushion of 0.4 going into the final shot after Maldini had reduced the gap in the elimination section.\nThe Italian lost his momentum at the last minute, however, and stood gazing at the floor after signing off with a modest 9.5.\nXie scored 10 to seal the gold and flashed a shy smile as his teammates in bright red-and-white erupted in the stands.\n\"We both made some silly mistakes but we have no regrets whatsoever,\" Maldini said, referring to compatriot Monna.\n\"I had good vibes since the beginning of the final,\" Monna said. \"It's certainly emotional and a very rare one because we are friends.\n\"This is the first time we're on the podium together and it is the most important one.\" REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nOlympics\nSouth Korea\nThanks for sharing!",
        "date": "2024-07-28",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/three-person-crew-blasts-off-for-chinas-tiangong-space-station",
        "content": "JIQUAN\n-\nThree Chinese astronauts, including China’s only female spaceflight engineer, entered the Tiangong space station on Oct 30 following an early morning launch into orbit.\nThe Shenzhou-19 mission took off with its trio of space explorers at 4.27am from the Jiuquan Satellite Launch Centre in north-west China, state news agency Xinhua and state broadcaster CCTV reported.\nAmong the crew is Lieutenant-Colonel Wang Haoze, 34, who is China’s only female spaceflight engineer, according to the China Manned Space Agency (CMSA). She is the third Chinese woman to take part in a crewed mission.\nThe crew arrived around 12.51pm and met with the astronauts from the previous Shenzhou-18 mission, “starting a new round of in-orbit crew handover”, state news agency Xinhua said.\nThe new Tiangong team will carry out experiments with an eye to the space programme’s ambitious goal of placing astronauts on the moon by 2030 and eventually constructing a lunar base.\n“Like everyone else, I dream of going to the space station to have a look,” Lt-Col Wang told a media gathering on Oct 29 alongside her fellow crew members, lined up behind podiums and tall panes of glass to seal them off from the public.\n“I want to meticulously complete each task and protect our home in space,” she said.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“I also want to travel in deep space and wave at the stars.”\nThe space agency deemed the launch a “complete success”, Xinhua said, adding that about 10 minutes after taking off, the spaceship separated from the rocket and entered its designated orbit.\nXinhua later said the spaceship had “made a fast, automated rendezvous and docking with the front port of the space station’s core module Tianhe at 11am”, and that the trio would then enter the module.\nHeaded by Senior Colonel Cai Xuzhe, the team will return to earth in late April or early May 2025, CMSA deputy director Lin Xiqiang said at a separate press event ahead of the launch.\nSenior Colonel Cai, 48, brings experience from a previous stint aboard Tiangong as part of the Shenzhou-14 mission in 2022.\n“Having been selected for the new crew, taking on a new role, facing new tasks and new challenges, I feel the honour of my mission with a great responsibility,” he said.\nThe aerospace veteran added that the crew was now “fully prepared mentally, technically, physically and psychologically” for the mission ahead.\nA Long March-2F carrier rocket carrying the Shenzhou-19 spacecraft and crew of three astronauts lifts off from the Jiuquan Satellite Launch Centre.\nPHOTO: AFP\nCompleting the astronaut line-up is 34-year-old fighter pilot Song Lingdong.\nThe CMSA’s Mr Lin said the crew currently aboard the Tiangong space station is scheduled to return to earth on Nov 4 after completing handover procedures with the incoming astronauts.\n‘Space dream’\nChina has ramped up\nplans to achieve its “space dream” under President Xi Jinping.\nIts space programme was the third to put humans in orbit and has also landed robotic rovers on Mars and the Moon.\nThe Long March-2F rocket carrying the Shenzhou-19 spacecraft and crew of three astronauts lifting off from the Jiuquan Satellite Launch Centre, in the Gobi Desert in north-west China, on Oct 30.\nPHOTO: AFP\nCrewed by teams of three astronauts that are rotated every six months, the Tiangong space station is the programme’s crown jewel.\nBeijing says it is on track to send a crewed mission to the moon by 2030, where it intends to construct a base on the lunar surface.\nMore on this Topic\nChina says foreign spies trying to steal space programme secrets\nChinese start-up to sell tickets for 2027 space tourism flights\nThe Shenzhou-19 crew’s time aboard Tiangong will see them carry out various experiments, including some involving “bricks” made from components imitating lunar soil, CCTV reported.\nThese items – to be delivered to Tiangong by the Tianzhou-8 cargo ship in November – will be tested to see how they fare in extreme radiation, gravity, temperature and other conditions.\nDue to the high cost of transporting materials into space, Chinese scientists hope to be able to use lunar soil for the construction of the future base, CCTV reported.\nDr&nbsp;Jonathan McDowell, an astronomer at the Harvard-Smithsonian Centre for Astrophysics in the United States, told AFP that the Shenzhou-19 mission is primarily about “accumulating additional experience”.\nWhile this particular swop of astronaut crews and upcoming six-month stint aboard Tiangong may not witness major breakthroughs or feats, it is still “very valuable to do”, said Dr McDowell.\nChina has in recent decades injected billions of dollars into developing an advanced space programme on a par with the US and Europe.\nIn 2019, China successfully landed its Chang’e-4 probe on the far side of the moon – the first spacecraft ever to do so.\nIn 2021, it landed a small robot on Mars.\nTiangong, whose core module launched in 2021, is planned to be used for about 10 years.\nAFP\nMore on this Topic\nChina’s space agency says Chang’e-6 lunar mission a ‘complete success’\nChina sends astronauts to its  space station for six-month stay\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nSpace and cosmos\nInternational Space Station\nThanks for sharing!",
        "date": "2024-10-29",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/tennis/table-tennis-veteran-61-year-old-nis-dream-run-ends-in-defeat-by-chinas-sun",
        "content": "PARIS - Luxembourg's former China table tennis player Ni Xialian's sixth Olympics was cut short on Wednesday by Chinese top seed Sun Yingsha, who the 61-year-old helped train this week to prepare for opponents with an unusual paddle in the mixed doubles final.\nFor Ni, a former world champion with China who now represents Luxembourg, her stint in Paris was a dream come true.\n\"I am very excited and grateful to have the opportunity to play against Shasha, the world number one,\" said Ni, who lost 4-0 in the round of 32.\n\"I truly had my eyes opened to what it means to be the world number one.\n\"Many shots that would score in other games were just like scratching an itch for her, barely affecting her at all.\"\nNi, world champion in 1983, is the oldest athlete competing in table tennis at the Paris Games.\nShe moved to Luxembourg in the late 1980s after winning two world championship gold medals for China.\nNi missed the 1996 Olympics because she did not want to represent anyone but China, although she had a change of heart years later after realising sport is not just about nationality.\nStill nimble on court, Ni attributed her extended career to the fundamental skills she learned in China, as well as support from her team in Luxembourg, including her coach and husband Tommy Danielsson.\nGRATEFUL NI\nWhen China's team contacted her for help before Tuesday's mixed doubles final to get used to the unusual style of paddle the North Korean team uses she jumped at the chance.\n\"I believe each of us should have a sense of gratitude. I feel very fortunate to have this opportunity to give back and to help our Chinese team,\" Ni said.\nChina's Sun and Wang Chuqin beat North Korea's Ri Jong Sik and Kim Kum Yong 4-2 in the mixed doubles final, the first step in what could be a Chinese gold medal sweep in the sport.\nNi's valiant defeat at the hands of Sun earned her a kiss from her husband, a standing ovation in the packed stadium, and words of encouragement from Henri, Grand Duke of Luxembourg, and his wife, who had come to cheer for her.\n\"With such recognition from them, what more could I ask for? This is enough to fulfill my life,\" Ni added.\nThree years ago in Tokyo, she thought she was at her last Olympics. Ni is not so quick to call Paris her last now.\n\"I don't dare to think about this question,\" she said.\nFor Sun, the 23-year-old who won her first gold medal on Tuesday, playing against \"Auntie Ni\" was an inspiration.\n\"I never thought about having a career like Auntie Ni,\" she said. \"Seeing her still competing on the court is truly inspiring for us younger athletes. We can always look up to her as a role model.\" REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nTable tennis\nLuxembourg\nNorth Korea\nThanks for sharing!",
        "date": "2024-07-31",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/diving-chinas-yang-and-lian-win-mens-synchronised-10m-platform",
        "content": "PARIS - Yang Hao and Lian Junjie played their parts with aplomb in China's bid to take all eight diving golds on offer by winning the men's synchronised 10 metre platform event on Monday.\nThe pair led the event from the first round and finished on 490.35 points - becoming the second Chinese diving pair to top the podium so far at the Paris Olympics.\nTom Daley and Noah Williams of Britain took silver with 463.44 points, followed by Canada's Ryan Wiens and Nathan Zsombor-Murray who won bronze.\nYang, 26, and 23-year-old Lian have dominated the world championships in the last three years in the event but it was their first time to stand on top of the Olympic podium.\nThe Chinese pair, the 7th to start, kicked off their routines with a forward dive in pike position and immediately established their lead.\nTheir skill in their last dive and the most difficult routine in their programme – the forward four and a half somersault with a near-perfect entry - landed the event’s highest score on Monday, 103.23 points.\n\"We've held our breaths until after the very last dive,\" Lian told reporters after the event. \"There is after all so much uncertainty in the competition. We couldn't have been entirely relaxed until the end.\"\n\"When we first saw the draw that the British team would dive right before us, we felt some pressure as they were also an excellent pair, but we did better today and that was how we won,\" he said.\nDaley fell short of upsetting China's dream team but he and partner Williams received roaring cheers from the fans, as they witnessed what might have been the 30-year-old five-time Olympian's last Games performance. Daley has not said what he plans to do after Paris.\n\"The Chinese did absolutely incredible today. They were on incredible form. Every single one of their dives was flawless,\" said Daley of his Chinese opponents.\nDaley and Williams started training as a pair only 9 months ago. Daley had stepped away from the sport after the Toyko Olympics in his long Olympic journey that first started as a 14-year-old in Beijing 2008.\n\"For me the achievement was getting back to competition readiness within a year (which) is something I didn't expect to be able to do,\" he said.\nCanada's Wiens and Zsombor-Murray walked away the pool with a big smile as they claimed their first medal in an Olympic diving event.\n\"It is absolutely amazing, unreal,\" Wiens said. \"When we just got the results in and found we were third we were jumping up and down and the feeling was surreal.\"\nChen Yiwen and Chang Yani won China's first diving gold on Saturday in the women's synchronised 3-metre springboard event. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nDiving\nChina\nOlympics\nThanks for sharing!",
        "date": "2024-07-29",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/business/china-ev-dream-came-true-10-years-on-walls-are-going-up",
        "content": "Hong Kong\n–\nTen years ago almost to the day, while checking out a handful of luxury sedans from one of China’s largest automakers, SAIC Motor, President Xi Jinping gave a pivotal speech that would set China on the course to dominate the electric vehicle (EV) industry.\nThe path to becoming a strong automaking nation lies in developing new energy vehicles, Mr Xi said, according to a Xinhua report in 2014. Claiming a head start, or “high ground”, in this sector is key to the global competition, he said.\nIn 2014, China sold around 75,000 EVs and hybrids, and exported about 533,000 cars. The domestic market was dominated by international manufacturers such as Volkswagen and General Motors, which were allowed to enter by forming joint ventures with local players in the 1980s and 1990s.\nThis helped China transform from a bike-riding nation to a car-driving one. Home-grown carmakers and brands that did not work with foreign partners were seen as inferior and lagging behind in engine and other automotive technologies.\nTo get ahead and tackle environmental challenges, Beijing bet on fuel-efficient and alternative energy vehicles. The state had published a guideline in 2012 that established ways to develop the industry by setting sales goals, providing subsidies and allocating resources for building EV charging infrastructure, among other things.\nMr Xi’s speech two years later signalled China’s determination to use this as a way to leapfrog traditional Western and Asian auto powerhouses, in particular Japan, home to Toyota Motor.\nWith the stage set, China needed a catalyst to spur consumer interest in EVs, which in the early 2010s were mostly cheap cars with short ranges. That ended up being Tesla, which became the first foreign automaker to set up a wholly owned operation in China.\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nWith that special permission, Tesla completed its Shanghai factory in 2019. Its entry into the market motivated local players to come up with better EVs with longer ranges.\nFast-forward to 2024, China has become the world’s largest auto market and sells more electrified vehicles than any other country, with 9.5 million cars delivered\nin 2023\n. It also controls the majority of the battery supply chain.\nHome-grown champion BYD dethroned Volkswagen to become the best-selling brand in China and, in the last quarter of 2023, surpassed Tesla as the world’s largest producer of EVs. China also overtook Japan as the largest auto exporter, sending 4.14 million units abroad, with 1.55 million of them being EVs or plug-in hybrids.\nThe achievements prove that\nBeijing’s industrial policy and investments have paid off. But they are also adding to tensions with the West. China’s success in EVs, which could disrupt traditional auto supply chains that employ millions of people, has become a key source of discomfort in Washington and Brussels.\nAs a price war at home and slowing growth drive Chinese automakers to search for buyers for its affordable and tech-laden EVs elsewhere, they are running into trade barriers, especially in the European Union and the US, which are meanwhile trying to develop their own EV supply chains. Both have accused China of exporting its excess capacity.\nThe US has quadrupled import tariffs on Chinese cars to more than 100 per cent, while the EU is investigating Chinese EVs to see if there has been an unfair advantage from government subsidies.\nBrazil recently removed a tax break on imported EVs and even Russia, arguably Beijing’s strongest ally and the largest destination for Chinese auto exports since the war with Ukraine, has asked Chinese carmakers to consider localising production.\nBeijing has threatened to hit back, with the China Chamber of Commerce to the EU saying on May 22 that the import tariffs on cars with large engines may be raised to 25 per cent from 15 per cent. There is a June 5 deadline for the EU to inform Chinese EV exporters of preliminary findings and whether tariffs will be imposed.\nSAIC\n, the state-owned manufacturer whose facility Mr Xi visited 10 years ago,\nhappens to be one of three Chinese automakers, along with BYD and Zhejiang Geely Holding Group, selected for further scrutiny by the EU in its anti-subsidy investigation. SAIC owns British-origin MG, which is one of the top-selling EV brands in Europe.\nAt an event on\nMay 24\nmarking the 10th anniversary of Mr Xi’s speech, SAIC officials, including chief engineer Zu Sijie, said they have remembered the President’s instructions well, and the company has consistently innovated around technologies like smart driving and connected cars.\nMr Li Zheng, co-founder of SAIC Qingtao New Energy Technology, a battery start-up backed by SAIC, took the opportunity to promise that executives will not be complacent\nas EV competition rises\n, noting that progress in solid-state batteries, which have a higher energy density and reduced fire risk, will be one way for China to maintain its edge.\n“New energy vehicles have become a strategic industry, fiercely contested by countries around the world,” Mr Li said. “They’re a key supporting force to our country’s revitalisation of green sectors.”\nA lot can happen in 10 years, but with SAIC having invested about 150 billion yuan (S$28.5 billion) in research and development over the past decade alone, even despite trade wars, 2034 looks bright.\nBLOOMBERG\nMore on this Topic\nChina EV makers taking longer to pay bills amid rising stress\n‘Bloodbath looms’ in China’s overcrowded EV industry\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nElectric and hybrid vehicles\nXi Jinping\nThanks for sharing!",
        "date": "2024-05-27",
        "is_related": true,
        "title": "China's EV Industry: A Decade of Growth and Global Tensions",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/asia/chinas-food-security-dream-faces-land-soil-and-water-woes",
        "content": "BEIJING\n–\nChina, the world’s biggest agriculture importer, has set targets to drastically reduce its reliance on overseas buying over the coming decade in line with its push for food security, but they will be exceedingly difficult to meet, experts say.\nWith limited land and water, China will have to sharply increase farming productivity through technology, including genetically modified crops, and expand area under cultivation to meet Beijing’s 10-year projections.\nThe government envisions 92 per cent self-sufficiency in staple grains and beans by 2033, up from 84 per cent during 2021 to 2023, according to a document released in late April, on a path towards President Xi Jinping’s goal to become an “agriculture power” by the middle of the century.\nCutting the country’s imports would be a blow to producers from the United States to Brazil and Indonesia, who have expanded capacity to meet demand from China’s 1.4 billion people, the world’s largest market for soya beans, meat and grains.\nOver the 10 years to 2033, the Agriculture Ministry projects a 75 per cent plunge in corn imports to 6.8 million tonnes and a 60 per cent drop for wheat to 4.85 million tonnes.\nFor soya beans, the biggest item on a farm import bill that totalled US$234 billion (S$315 billion) in 2023, Beijing sees imports falling 21 per cent to 78.7 million tonnes in a decade.\nThose targets defy the trends of the past decade, in which grains and oilseed imports have surged 87 per cent.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“Forecasting a sharp reversal where in 10 years the country will be importing less than it does today seems questionable,” said Mr Darin Friedrichs, co-founder of Shanghai-based Sitonia Consulting.\nChina will struggle to meet its targets mainly due to a lack of land and water, five analysts and industry executives say.\nIn stark contrast to Beijing’s projections, the US Department of Agriculture (USDA) sees China’s corn imports in 2033/34 roughly in line with current levels and wheat imports declining 20 per cent. In the biggest divergence, USDA expects soya bean imports to rise 39 per cent.\nThe USDA also expects growth in demand for animal feed, a key user of soya beans and corn, to outpace domestic corn output expansion and spur imports of sorghum and barley.\nNational security\nFood security has long been a priority for China, which has a painful history of famine and must feed nearly 20 per cent of the global population with less than 9 per cent of its arable land and 6 per cent of its water resources.\nThe urgency to cut dependence on imports grew after China faced supply chain disruptions during the Covid-19 pandemic and the Russia-Ukraine conflict.\nA trade war with the US, its No. 2 agriculture supplier after Brazil, and climate shocks such as heavy rain in 2023 that damaged China’s wheat harvest have added to the challenge.\nOn June 1, China will implement a food security law that calls for absolute self-sufficiency in staple grains and requires local governments to include food security in their economic and development plans.\nThat will add to other efforts to bolster food production, including stepped-up grains insurance cover for farmers to protect their income, announced this week.\nIn April, Beijing launched a drive to raise grain output by at least 50 million tonnes by 2030, spotlighting upgraded farmland and investments in seed technology for higher crop yields and quality.\nMore on this Topic\nThe rich, black soil that fed a growing China is washing away\nChina floods hit rice, corn crops and trigger food inflation worries\nSoil changes\nChina increased production of corn, soya beans, potatoes and oilseeds in 2023 after expanding planting on previously uncultivated land and encouraging farmers to switch from cash crops to staples.\nHowever, even as the world’s No. 2 corn producer harvested a record 288.84 million tonnes in 2023, imports surged to a near-record 27.1 million tonnes, driven by traders’ preference for corn from overseas that is often higher quality and cheaper.\nProduction growth has hit a bottleneck due to insufficient arable land, small production scale and a lack of farmers and agriculture technology, state media reported.\nChina’s arable land per capita is less than one-third the level in Brazil and one-sixth the level of the US, World Bank data from 2021 shows.\nDegraded and polluted soil in a country where a significant share of land is either rocky mountains or desert leave it with little space for expansion.\nThe government, which has increasingly called for protection of its fertile black soil, is set to complete a four-year soil survey in 2025. The last survey, in 2014, found that 40 per cent of its arable land was degraded from overuse of chemicals and heavy metal contamination.\nTo compensate, China is pouring millions of dollars into research of farming water-intensive crops such as rice in the deserts of Inner Mongolia and Xinjiang.\nBy turning sand into soil and breeding saline-tolerant crops, it aims to develop more farmland, a strategy industry executives say will take time and heavy investments in fertiliser, irrigation and biotechnology.\nOne obstacle is China’s predominance of small farms, run by ageing owners who may not be able to afford or operate machinery such as drone sprayers, more productive seeds and technology such as big data and AI.\nFarms in China average 0.65ha, compared with 187ha in the US and 60ha in Germany. China is gradually shifting towards a consolidation of its fragmented farms.\nAfter decades of hesitation, it is slowly adopting genetically modified crops, in 2024 approving the planting of corn and soya bean varieties that are higher yielding and insect resistant, as well as gene-edited, disease-resistant wheat in hopes of accelerating production growth.\nChina’s soya bean yields, at 1.99 tonnes per hectare, lag the 3.38 and 3.4 tonne yields in Brazil and the US, which have embraced genetically modified soya beans.\nBut analysts say the government’s target for cutting soya bean imports is unrealistic. At best, China could ease its dependence on soya bean imports to 70 per cent from more than 80 per cent now, said Professor Carl Pray at Rutgers University in the US.\nAlmost all of China’s soya beans are high protein varieties to produce tofu, and to replace imports it would need to rapidly expand production of high-oil producing varieties for cooking oil, which he said would be hard, even with research.\n“To produce enough soya beans to replace the Brazilian and US imports, there is just not enough land,” Prof Pray said.\nREUTERS\nMore on this Topic\nChina probes agriculture minister for suspected disciplinary violations\nVillage vloggers in China cash in on live streaming\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nAgriculture/farming\nFood security\nThanks for sharing!",
        "date": "2024-05-23",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/formula-one/f1-faces-a-fresh-challenge-on-return-to-china",
        "content": "SHANGHAI\n–\nFormula One returns to China for the first time in five years this week with a packed programme including a Saturday sprint race, but not everyone is happy with the Shanghai schedule.\nChampionship leader Max Verstappen and Ferrari’s Carlos Sainz were among those who have expressed doubts about having limited practice on a resurfaced circuit that is unknown to the current specification of Formula One cars.\nChina’s closed borders during the pandemic meant the Shanghai International Circuit – which hosted a Covid-19 hospital two years ago – has not had a grand prix since April 2019.\nAnd because of that, it could be bumpier than before.\nThis weekend has just 60 minutes of free practice on April 19 morning ahead of sprint qualifying, leaving drivers fearful about the lack of preparation.\n“I think it’s not great,” said Red Bull’s three-time world champion Verstappen about F1’s choice of\nChina as the first of the season’s six sprint venues.\n“When you have been away from a track for quite a while, you never know what you’re going to experience.\n“It would have been better to have a normal race weekend. But on the other hand, it probably spices things up a bit more, and that’s maybe what they would like to see.”\nThere will be at least one contented face in the paddock – Sauber’s Zhou Guanyu will be driving in front of his own fans for the first time in F1.\nShanghai-born Zhou was a five-year-old spectator at the inaugural Chinese Grand Prix in 2004.\n“I couldn’t be more excited to finally race on home soil in Shanghai,” said the 24-year-old, who drove an F2 car for Renault at the circuit in 2019 before stepping up to F1 in 2022.\n“To be the first Chinese driver ever to compete in Formula One in China means a lot to me. It fills me with immense joy, pride and responsibility. I have fulfilled my dream.”\nThe sprint weekend schedule has changed this season, with Shanghai’s 19-lap sprint race on April 20 morning followed by main qualifying in its normal afternoon slot to determine the grid for the 56-lap race on April 21.\nVerstappen has won three out of the four grands prix this season with Sainz taking the chequered flag in the other, in Melbourne. The Spaniard too has concerns about this weekend.\n“I think it’s going to be a tough weekend for everyone. With how tricky one bump could make the car, I think it’s not a good choice to choose to put the sprint after four or five years’ absence,” said Sainz.\n“Maybe for people watching at home it’s exciting, but for engineers and drivers, it’s something that, in my opinion, we shouldn’t take the risk and (we should) have a normal weekend.”\nMercedes were previously the dominant force on the 5.451km Shanghai circuit, winning six times from 2012. But the Silver Arrows have struggled again this season.\nBoth Lewis Hamilton, who won the 2019 Shanghai race, and George Russell failed to finish in Melbourne and in the last race, the Japanese GP, they were ninth and seventh respectively.\nIt was a Red Bull one-two at Suzuka and Mercedes were also well beaten by both Ferraris, with the McLaren of Lando Norris and Aston Martin’s Fernando Alonso finishing ahead of Russell as well.\nFerrari’s Charles Leclerc and Sainz look the most likely to challenge the dominance of Verstappen and Red Bull teammate Sergio Perez again this weekend.\nLeclerc said Ferrari’s race pace was not the issue – it was qualifying they needed to improve on.\n“We’ve had some difficulties putting the tyres in the right window on the out laps in qualifying,” said the Monegasque.\n“So we really have to focus on that to make sure we can put it all together in China.”\nAFP, REUTERS\nMore on this Topic\nLewis Hamilton ready for ‘emotional’ farewell season with Mercedes\nRed Bull’s Max Verstappen dominates F1’s Bahrain season-opener\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nMotor racing\nFormula One\nChina\nGrand Prix\nRed Bull\nMax Verstappen\nFerrari\nCharles Leclerc\nThanks for sharing!",
        "date": "2024-04-17",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/chinese-space-station-crew-returns-after-six-months-in-orbit",
        "content": "BEIJING - A three-person Chinese crew returned to Earth early on Nov 4 after more than six months aboard the Tiangong space station, reported state news agency Xinhua.\nAstronauts Ye Guangfu, Li Cong and Li Guangsu were all “in good health” after touching down in the return capsule of their Shenzhou spaceship at the Dongfeng landing site in Inner Mongolia, Xinhua said.\nThe three men\nhad travelled to Tiangong in late April\nand were met on Oct 30 by three new astronauts, including the country’s only woman spaceflight engineer, with whom they did a five-day handover before making their return journey.\nChina has ramped up plans to achieve its “space dream” under President Xi Jinping.\nIts space programme was the third to put humans in orbit and has also landed robotic rovers on Mars and the Moon.\nCrewed by teams of three astronauts that are rotated every three to six months, the Tiangong space station is the programme’s crown jewel.\nIts core module was launched in 2021, and it is planned to be used for about 10 years.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBeijing says it is on track to send a crewed mission to the Moon by 2030, where it intends to construct a base on the lunar surface. AFP\nMore on this Topic\nThree-person crew starts ‘dream mission’ inside China’s Tiangong space station\nChina reveals names of new manned moon spaceship, lander\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nSpace and cosmos\nXi Jinping\nThanks for sharing!",
        "date": "2024-11-03",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/no-good-grades-no-good-jobs-how-china-s-youth-are-chasing-their-dreams-in-an-uncertain-future",
        "content": "BEIJING – For China’s college graduates, 2023 is not a good year.\nIn a normal scenario, they would be gearing up to send out resumes to potential employers, hopeful of securing interviews as soon as possible.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nInsight\nChina\nChina economy\nEmployment\nWorld Insight\nThanks for sharing!",
        "date": "2023-12-22",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/st-picks-no-good-grades-no-good-jobs-china-s-youth-chasing-dreams-amid-uncertainty",
        "content": "BEIJING – For China’s college graduates, 2023 is not a good year.\nIn a normal scenario, they would be gearing up to send out resumes to potential employers, hopeful of securing interviews as soon as possible.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nInsight\nChina\nChina economy\nEmployment\nWorld Insight\nThanks for sharing!",
        "date": "2023-12-23",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-oct-30-2024",
        "content": "Three-person crew blasts off for China’s Tiangong space station\nThree Chinese astronauts including the country’s only woman spaceflight engineer blasted off on a “dream” mission to the Tiangong space station in the early hours of Oct 30.\nThe new Tiangong team will carry out experiments with an eye to the space programme’s ambitious goal of placing astronauts on the Moon by 2030 and eventually constructing a lunar base.\nThe Shenzhou-19 mission took off with its trio of space explorers from the Jiuquan Satellite Launch Center in northwest China, state news agency Xinhua and state broadcaster CCTV reported.\nREAD MORE HERE\nUK teen accused of Southport girls’ murder charged with possessing ricin, terrorism offence\nPolice said the incident was still not being treated as terrorist related.\nPHOTO: REUTERS\nA teenager accused of murdering three young girls in a knife attack in northern England in July has been further charged with a terrorism offence and the production of deadly poison ricin, police and prosecutors said on Oct 29.\nAxel Rudakubana, 18, is accused of killing the three young girls aged between six and nine at a Taylor Swift dance event in Southport, murders which shocked the nation and provoked days of rioting across the country.\nPolice said the incident was still not being treated as terrorist related but said after searches of his home, Rudakubana had now been charged with two further offences: production of a deadly biological toxin, ricin, and the possession of an al Qaeda training manual.\nREAD MORE HERE\nGaza humanitarian crisis could develop into famine, WFP says\nThe UN World Food Programmed called on Oct 29 for immediate action to avert famine in the Gaza Strip, warning that the humanitarian crisis there could soon worsen amid what it said were severe restrictions on aid flows.\nA global monitor warned this month that the whole of the Palestinian enclave remained at risk of famine, with Israeli military operations adding to concerns and hampering humanitarian access.\n“Now, as the situation in northern Gaza continues to deteriorate, the likelihood of a larger group being impacted by famine will surely increase unless conditions on the ground improve,” said WFP, the United Nations’ food agency.\nREAD MORE HERE\nGermany recalls envoy to Iran over execution of German-Iranian national\nGermany has recalled its ambassador to Iran over the execution of German-Iranian national Jamshid Sharmahd and summoned the Iranian charge d’affaires to voice Berlin’s protest, the German foreign office said on Oct 29.\n“We have sent our strongest protest against the actions of the Iranian regime reserve the right to take further action,” the foreign ministry said in a post on X.\nGermany’s ambassador in Teheran protested in the strongest possible terms against the killing of Sharmahd, the post said, adding that German Foreign Minister Annalena Baerbock had recalled the ambassador to Berlin for consultations.\nREAD MORE HERE\nIkea pledges cash to atone for East German forced labour\nIkea pledged Oct 29 to pay six million euros (S$8.59 million) into a hardship fund for victims of the East German dictatorship after admitting some of its suppliers used political prisoners as forced labourers.\nThe Swedish furniture giant handed over a declaration of intent to Evelyn Zupke, the top official in charge of atoning for the injustices of the former East German communist government.\nThe declaration was the result of “close exchanges over several years” between Ikea, the victims’ group UOKG and Zupke, who became the government commissioner on the issue in 2021, her office said in a statement.\nREAD MORE HERE\nAmorim set to be new Man Utd boss as Sporting confirm interest\nRuben Amorim is set to become the next manager of Manchester United with the Premier League club prepared to pay Sporting the 10 million euros (S$14.31 million) release clause, the Portuguese club said on Oct 29.\nThe news comes a day after the team sacked Erik ten Hag with United languishing in 14th place in the Premier League standings. The Portuguese coach could be in place for Sunday’s league game against Leicester City at Old Trafford.\n“Manchester United FC expressed interest in hiring coach Ruben Amorim, with Sporting’s board of directors referring to the terms and conditions set out in the employment contract in force between the company and the coach, specifically the respective termination clause and for the amount of Euro 10,000,000,” a statement from the Lisbon-based club said.\nREAD MORE HERE\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBritain\nTerrorism\nGaza\nIsrael\nGermany\nIran\nIkea\nLabour issues\nManchester United\nThanks for sharing!",
        "date": "2024-10-29",
        "is_related": true,
        "title": "Three-person crew blasts off for China’s Tiangong space station",
        "is_title_contain_shared_future": false,
        "sentiment": "positive",
        "main_keywords": []
    },
    {
        "url": "https://straitstimes.com/asia/chasing-a-different-china-dream-young-digital-nomads-head-for-the-hills",
        "content": "DALI, China - In this mountain town in China's\nsouth-west\n, drifters and tarot card readers rub shoulders with tech entrepreneurs and artists. Many are former city-dwellers in search of an elusive prize in authoritarian China: Space for open discussion and exchange of ideas.\nIn one co-working space, a group of young adults asked questions about the effect of Trump-era populism on US media during a discussion led by a Chinese journalist about the American position on the Israel-Gaza conflict. In a nearby cafe, others discussed art, sexual harassment and the listlessness of China's youth.\nAs President Xi Jinping tightens his grip on the restricted personal freedoms of Chinese citizens and the economy stutters, exacerbating a youth unemployment crisis, Dali in Yunnan province has become a haven for those seeking to escape the pressure.\nThey are drawn by the cheap rents, mild climate, stunning scenery and a history of relative tolerance, which were popularised by a television drama this year about a digital nomad.\nDali's Old Town district, administratively part of a city of 650,000, has attracted culture workers since the late 1990s, said\nDr\nMinhua Ling, an expert on Chinese migration at the Geneva Graduate Institute, adding that the normalisation of remote work and Dali's less restrictive policies during\nChina's zero-Covid crackdown\nalso increased its appeal.\nIn November, searches for “Dali” on WeChat were up 7\nper cent\nfrom a year ago, having surged some 290\nper cent\non one day in late July, when many Chinese were booking summer trips.\nReuters interviewed 13 Chinese migrants to Dali, who described a refuge on the fringes of mainstream society, but also one that implicitly challenges Xi’s “China Dream” of a prosperous nation ideologically loyal to the Communist Party. Many of them spoke on condition of anonymity for fear of government retaliation.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n\"When younger generations are materially sufficient but spiritually lost, of course they will seek personal growth and freedom,\" said\nMs\nBai Yunxi, a Dali-based 33-year-old civil servant-turned-astrologer.\nSix of the people expressed concern about increased police scrutiny of their activities, citing abrupt cancellations of large-scale events and police raids.\nDali city's propaganda bureau did not respond to a faxed request for comment on the crackdowns and Dali's efforts to attract young skilled workers.\n‘Ideal kingdom’\nWith\nyouth unemployment at a record high\nthis summer — when China stopped releasing the statistic — and a stagnant rural population due to low fertility rates and urban migration, Beijing has tried to enlist young people in “rural revitalisation”.\nXi has urged graduates to “return to their hometowns” and “actively seek hardships”, alluding to his experience during the Cultural Revolution. But the message does not appear to resonate with urban youths who grew up with expectations of prosperity but now find social mobility hard to attain.\nDali, where several of the people interviewed by Reuters said they found an escape from the conservative social values of rural China, is an exception to the flight of youth to large cities that has occurred since China's economic modernisation.\nVisitors take pictures at a tower overlooking the old town of Dali in Yunnan.\nPHOTO: REUTERS\nMs\nBai moved to Dali in September, quitting her government job to give online astrology readings. She shares a three-storey house with her partner, a friend and three cats. “My living situation provides enough space to develop my career and personal life without interference from others,” she said.\nShe also referenced Dali’s nickname, “Ideal Kingdom”— a pun on its Chinese characters that also reflects its 10th-century status as an independent state — as part of its appeal.\nRecruitment startup founder\nMr\nChen Zhengyun, 37, said living in Dali freed him from societal pressure to get married early, as state calls for matrimony grow louder amid China's demographic crisis.\n“There are some personal topics that you can’t bring up elsewhere that you can talk about here,” said\nMr\nChen, adding that the concentration of like-minded young people, social events and tolerance for diverse lifestyles allowed him to explore open relationships.\nPeople attend a discussion session at a youth community hub in Dali, on Nov 9.\nPHOTO: REUTERS\nMore on this Topic\nFor China’s jobless youth, hostels are a refuge for those seeking work\nChina’s jobless youth and the parable of Kong Yiji\nPolice oversight\nThe local government has sought to attract young tech talent and in September asked digital nomads for input on policies, two community organisers told Reuters.\nBut the town's population also includes many young people who say they are sceptical of Beijing's attempts to shape their personal lives.\nA large digital nomad conference with art and tech-related seminars was abruptly cancelled on Nov 2, a week before its scheduled start, due to “deep consideration of various factors”, the organiser, co-working space NCC, wrote on social media.\nNCC declined to elaborate publicly, citing sensitivities.\nDuring a recent visit, Reuters saw a police surveillance camera trained on NCC's main communal area.\nThree people familiar with event organisers in Dali said the November forum — like another conference on decentralised internet technologies planned last year — was cancelled after the government abruptly withdrew funding and support.\nMany digital nomads who use co-working spaces are involved with technologies like blockchain, according to organisers, which they say has drawn scrutiny from local authorities.\nPeople sit and chat around a table at a youth co-working hub in Dali.\nPHOTO: REUTERS\nTwo other co-working spaces were shut down unexpectedly for months, with one also visited by local police earlier this year, according to three people familiar with the matter.\nChina banned cryptocurrency mining and trading in 2021, part of a broader crackdown on the tech sector.\n“We are more low-key and do not emphasise digital nomads in our marketing anymore,” one co-working space staffer told Reuters, adding that conservative local governments in rural towns like Dali are “cautious of emerging technologies”.\nSuch state monitoring efforts do not surprise\nDr\nLing, the academic. Since digital nomads, unlike university students, “are not subject to structured discipline, they are harder to manage”, she said. REUTERS\nMore on this Topic\nDigital nomad visas expand&nbsp;as Spain, Canada vie for global talent\nIndonesia's Bitung dreams of becoming like Bali\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nPeople\nPopulation/Demographics\nThanks for sharing!",
        "date": "2023-11-24",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/china-has-sharpened-its-tech-sector-not-destroyed-it",
        "content": "To most Western observers, it would appear that China has driven its technology industry off a cliff.\nThe number of start-ups&nbsp;fell by 50,000 between the peak in 2018 and 2023, with 2024 on track to be even lower. The market capitalisations of the&nbsp;biggest tech companies, including Alibaba Group Holding&nbsp;and Tencent Holdings,&nbsp;have shrunk to the tune of hundreds of billions, and pale in comparison with US peers.\nThere is no sign that the sector will ever rebound\nto what&nbsp;it was before a&nbsp;government crackdown that kicked off in late 2020, even as policymakers have signalled it’s over. Becoming a billionaire entrepreneur has become something to be feared, rather than celebrated.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nTechnology sector\nInnovation\nXi Jinping\nThanks for sharing!",
        "date": "2024-10-02",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/young-chinese-women-hire-female-cosplayers-to-play-dream-men",
        "content": "SHANGHAI – During her final years of high school, Chinese teenager Xu Yunting found an unusual way to make some pocket money – transforming herself into male video game characters and taking their female devotees on dates.\nThe trend, called “cos commissioning”, has gained traction in China recently, with social media posts garnering millions of views as an increasing number of young women use their purchasing power to engineer a meeting with their dream man in real life.\nOne early morning in Shanghai in August, Ms Xu carefully inserted contacts to enlarge her irises and adjusted a tangerine wig to transform into Jesse, a character from the romance quest mobile game Light And Night.\nA tall and sensitive musician, he is one of five characters who woo players throughout the game – and, for client Feng Xinyu, a vivacious 19-year-old, the ideal partner.\n“I don’t have a boyfriend because I’m not interested in 3D men,” says Ms Feng, using a term for real-life men as opposed to those on the page or screen. “I like anime characters a little bit more, they’re more appealing to me.”\nLight And Night, made by tech giant Tencent and aimed at young women, promises a “brand-new interactive experience of highly immersive love”.\nPlayers such as Ms Feng, who form strong emotional connections with characters in such games, are known as “dream girls” – and cos commissioning takes the immersion to the next level by dragging those 2D beaus off the screen and into the real world.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nMs Feng has commissioned Ms Xu twice before, for a fee of around US$70 (S$90).\nIn August, she spent US$2,800 on a multi-day trip with another Jesse cosplayer to a different province.\nBut she decided she preferred Ms Xu’s portrayal and hired her for a third date.\n“We really click,” Ms Feng said. “She’s just like the character from the game. It feels like we were meant to be together.”\nCosplayer Xu Yunting applying make-up to transform to Jesse, a male character from the video game Light And Night.\nPHOTO: AFP\n‘Reconstructing gender rules’\nMs Feng was waiting for Ms Xu at a metro station\n, and grinned in delight when she spotted her\n.\nThe two appeared relaxed and chatted happily as they headed to their first activity.&nbsp;\nTheir date – all planned and paid for by Ms Feng – lasted all day, beginning with tea and ending with a hotpot meal and\na stroll.\nAt both a doll-painting workshop and cake-decorating class they attended, they were one of many cos commission pairs. Staff at the latter business say they sometimes\nhave dozens of couples on busy days.\nPart of the appeal, experts studying the phenomenon say, is that it gives young women a way to perform an idealised heteronormative relationship.\nConservative social attitudes towards women remain widespread in China, often reinforced by state media and popular culture.\nAside from assuaging safety concerns, hiring a female cosplayer ensures a level of equality and understanding not necessarily guaranteed in a real-life relationship.\n“I don’t think it’s important what gender the person being commissioned is,” said Fudan University’s Tian Qian.\n“What is important is that (the cosplayer) is a vessel, because the client needs a vehicle for their emotions.”\nAnother academic, Ms Zhou Zixing, wrote that cos commissioning allows women “to gain a voice that is fully respected by the opposite sex... responding to, breaking, and reconstructing the gender rules of the real world”.\nCosplayer Xu Yunting (right) and Ms Feng Xinyu making a cake at a pastry shop during their “cos commissioning” date in Shanghai.\nPHOTO: AFP\n‘Low-quality guys’\nAt the cake-decorating class, Ms Feng leaned over the table, fondly watching Ms Xu pipe generous amounts of icing onto a sponge cake.\nAfterwards, Ms Xu gently helped Ms Feng remove her apron, modelling Jesse’s gentlemanly behaviour.\n“The guys in the games are all quality guys,” said Ms Xu. “I think (clients) will be able to improve their requirements in real life in terms of what they want from a man, so that they don’t settle for low-quality guys.”\nMs Xu’s mother Fang Xiuqing admitted her initial reaction when she learnt what\nher daughter\nwas doing was: “How could this happen to\nher\n?“\nBut she has since come around to the idea. “I don’t think it’s a profession, it’s a hobby,” said Madam Fang. “She gets enjoyment from it, and she also brings joy to others.”\nFudan University’s Ms Tian said cos commissions can act as “emotional sustenance”.\n“Although this is a paid interaction, it still gives a sense of being seen, which has a certain healing effect to it.”\nAFP\nMore on this Topic\nEmployees in China given time off to play new Black Myth: Wukong video game\nCosplay ‘angel’ wins praise in China for saving a man who blacked out in the rain\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nSocial conditions and trends\nDating/Relationships\nThanks for sharing!",
        "date": "2024-09-04",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/tennis/review-olympics-table-tennis-china-still-dominates-while-swede-and-french-shine",
        "content": "PARIS - The Chinese dream team came to Paris on a mission to claim every gold medal on offer, after missing out on one in Tokyo - the inaugural mixed doubles title.\nUnder enormous pressure they duly delivered, securing Ma Long a spot in history as the only six-time gold medalist in table tennis and China's most decorated Olympian.\nChina's dominance in the sport speaks for itself. They have earned 37 gold medals out of the 42 contested so far at the summer Olympics. The women's singles final was between two Chinese players, a replay of Tokyo. In the best-of-five team competitions, neither the Chinese men's nor women's teams dropped a single match.\nEven with the best team, however, the golden sweep wasn't achieved without twists and turns. The biggest surprise happened when Sweden's 19th seed Truls Moregard knocked out China's world number one Wang Chuqin in the round of 32.\nThat boosted the confidence of 22-year-old Moregard, who went on to clinch the first silver for Sweden in the event since 2000.\n\"I didn’t plan for this when I came here and it feels surreal. I really felt I should just let it all go and really believe in myself and play the table tennis that I like,\" said Moregard.\nThe sport also had its moment in France thanks to the sensational Lebrun brothers. With football legend Zinedine Zidane among the fans, 17-year-old Felix Lebrun won several thrilling deciding games and eventually clinched bronze.\nHe then led the French team, with his brother Alexis and Simon Gauzy, to add another bronze for France after overcoming the Japanese team.\n\"He is a champion, we will try to make him a legend,\" said French team coach Nathanael Molin of Lebrun, the youngest ever to win a table tennis singles Olympics medal.\nWhile Sweden and France's performance marked the first time two European nations climbed on the podium for the teams event, beating the Chinese remains the Everest of table tennis.\nFan Zhendong, with a powerful backhand serve and steady performance under pressure, beat Japan's Tomokazu Harimoto after a 9-9 tie in the seventh game in singles, and then survived a showdown with Moregard a second time in a deciding game in the team event.\nChinese duo Chen Meng and Wang Manyu were 9-5 behind in the last game of the doubles match against Japan but managed to fight back and claim the match.\n\"Since the last point hadn't been decided, there was still a chance to come back. Our intense desire to win, with the unwavering belief that we could do it, kept us going,\" said Chen, who has four gold medals. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nOlympics\nTable tennis\nThanks for sharing!",
        "date": "2024-08-12",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/dream-come-true-for-olympic-debutant-58-despite-loss",
        "content": "PARIS - Table tennis player Zeng Zhiying said her “dream came true” on June 27 after making her Olympic debut aged 58, despite suffering defeat for her adopted Chile.\nZeng represented China, the country of her birth, as a young player, but retired at 20 and moved to Chile, where she has lived for the past 35 years.\nShe did not touch a table tennis bat for decades until she began playing again during the pandemic, and she quickly rose through the ranks to become one of South America’s best players.\nHer comeback has taken her all the way to Paris, where she lost 4-1 to Lebanon’s Mariana Sahakian - herself 46 - in the preliminary round.\nPlaying in front of a full house and with extra support from a small but noisy group of Chilean fans, Zeng said the experience had been a rewarding one.\n“After 30 years I came back to table tennis, and now that I have been able to play at the Olympics, my dream came true,” Zeng said, in comments translated from Spanish, which she speaks with a Chilean accent.\n“I gave my best in every competition and that’s how I managed to get here.”\nZeng was born in the southern Chinese city of Guangzhou and began playing from an early age under the tutelage of her table tennis coach mother.\nShe was chosen for China’s national team at 16 but her career hit the skids before table tennis made its Olympic debut in 1988 and she quit the sport.\nShe moved to Chile to coach schoolchildren but then drifted away from table tennis and stopped playing to focus on her business.\nSedate pace\nNow, she is back on the scene and refuses to rule out another Olympic appearance after getting her first taste of the big time.\n“It will be a little difficult but I will always keep playing until my body says stop,” said Zeng, who will be 62 by the time of the next Games, in Los Angeles.\nZeng’s match against Sahakian, another veteran, played out at a noticeably more sedate pace than the other matches being played at the South Paris Arena.\nZeng took the first game but then fell out of contention as her opponent began to take control of the match.\nZeng Zhiying’s opponent, Mariana Sahakian of Lebanon, is herself 46 years old.\nPHOTO: REUTERS\n“My opponent was very patient,” said Zeng.\n“In the first game she was a bit anxious but she settled down as the match went on and it was quite hard to beat her from then on.\n“I gave everything in the game. Of course there are regrets, but it’s fine that I didn’t manage to win.”\nZeng is not even the oldest player in the women’s tournament at the Paris Games - Luxembourg’s 61-year-old Ni Xialian takes that title.\nNi was also born in China before switching allegiance to another country.\nZeng believes the nation of her birth will continue to produce champions.\n“The system of repetition and timing is unique,” she said.\n“What makes the difference is how many times the young players play – all day, every day, over and over.” AFP\nMore on this Topic\nIn Pictures: The Olympic Games opening ceremony in Paris\nParis Olympics 2024: Get the latest updates, TeamSG highlights and visual stories\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nOlympics\nOlympics 2024\nTable tennis\nChile\nChina\nThanks for sharing!",
        "date": "2024-07-28",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/tennis/elina-svitolina-ends-ons-jabeurs-wimbledon-dream-in-third-round",
        "content": "LONDON - Fifty one weeks after a heartbroken Ons Jabeur trudged off Wimbledon’s Centre Court with tears streaking down her face after a second successive defeat in the final, the tormented Tunisian was left to digest another painful loss on July 6.\nJabeur’s long-cherished dream to hold aloft the Venus Rosewater Dish was dashed for at least another year, following a brutal 6-1 7-6(4) defeat by Elina Svitolina in the third round.\nThe popular Tunisian could have been 2-0 up right at the start as she had a break point in Svitolina’s opening service game and a game point in the next.\nInstead, it was Ukrainian 21st seed Svitolina who struck the killer blows early to open up a 2-0 lead and she never moved her eye off the ball as she romped through to bag the first set after Jabeur tamely netted a service return on set point.\nThe 10th seed managed to put up more of a fight in the second set and even had set point at 6-5 up on Svitolina’s serve.\nBut the nightmare memories Jabeur is starting to collect from Centre Court will have another addition as her forehand down the line fell millilitres wide and Svitolina grabbed that reprieve to get out of trouble.\nA backhand error on match point condemned Jabeur to her earliest defeat at the All England Club for five years, leaving Svitolina to lap up the applause from the crowd which included her husband Gael Monfils.\nShe will next face China’s Wang Xinyu. AFP\nOns Jabeur’s long-cherished dream to hold aloft the Wimbledon trophy was dashed for another year.\nPHOTO: EPA-EFE\nMore on this Topic\nWorld number one Iga Swiatek crashes to Yulia Putintseva at Wimbledon\nAndy Murray’s Wimbledon career over as Emma Raducanu pulls out of mixed doubles\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nWimbledon\nWomen's tennis\nGrand Slam\nThanks for sharing!",
        "date": "2024-07-07",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/entertainment/singer-actor-wu-chun-showcases-his-dream-mansion-in-brunei",
        "content": "Bandar Seri Begawan\n– Brunei singer-actor Wu Chun designed his dream mansion around the theme of love – complete with a pool built in the centre of the house.\nThe former member of Taiwanese boy band Fahrenheit posted a video and several photos of his swanky abode in Brunei on social media after it was featured in the magazine Architectural Digest China.\nThe 43-year-old is married to housewife Lin Liying, also 43.\nThe couple have a 12-year-old daughter, Neinei, and a nine-year-old son, Max. The family have lived there for about two years.\nWu, who is based in Shanghai, China, said in the video: “When I was designing this house, I hoped that it could be a vacation house. So I placed the pool in the centre to make it visible from more angles.”\nHe added that he has a deep passion for architectural design.\n“For me, the life I live starts from the word ‘love’, so my home starts from ‘love’ as well,” he said, showing a door made up of the four letters of “love”.\nOn a round table in the entryway is an artwork called Four Loves by Italian sculptor Lorenzo Quinn.\nOn the wall hangs one of Wu’s own creations, comprising his and his wife’s fingerprints overlapping&nbsp;in the shape of a heart.\nThe star also showcased his living room, kitchen and dining room in the video. There is a piano in the house, although he does not play the instrument.\nA big fan of American basketball legend&nbsp;Michael&nbsp;Jordan, Wu has a gallery where he displays the former Chicago Bulls player’s jerseys, championship rings, signed photos and shoes – which he began amassing when he was 12.\nHe also has a collection of magazine covers featuring himself and mementos of other celebrities, such as martial arts legend Bruce Lee and boxer Sugar Ray Leonard.\n“I never thought I would make movies and perform in concerts,” he said. “These people whom I look up to taught me to face failure without fear.”\nMany netizens were impressed by Wu’s mansion, with some commenting it looks more like a hotel than a home.\nSome remarked that they would never leave such a place, to which Wu replied that he had intended it as such, “so that my family can spend more time together”.\nMore on this Topic\nJackie Chan buys a luxury mansion in Hangzhou for $8m\nHong Kong actress Carina Lau gives rare peek at her mansion\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nCelebrities\nHome &amp; Garden\nSocial media\nBrunei\nThanks for sharing!",
        "date": "2023-09-05",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/us-has-a-wrong-perception-of-china-says-foreign-minister",
        "content": "BEIJING - The U.S. continues to hold the wrong perception of China and has yet to fulfill its promises despite some progress since presidents Joe Biden and Xi Jinping met last November, China's Foreign Minister Wang Yi said on Thursday.\nSpeaking at a news conference on the sidelines of an annual parliament meeting in Beijing, Wang said exchanges between both countries can only continue if both sides respect and recognize their differences.\n\"It has to be pointed out that the U.S. side's erroneous perception of China continues, and the promises it has made have not really been fulfilled,\" Wang said at the National People's Congress.\n\"The methods of suppressing China are constantly being renewed, and the list of unilateral sanctions is constantly being extended,\" he said.\nThe \"crimes\" the U.S. wanted to add to it \"have reached an unbelievable level,\" Wang said.\nBiden had made it clear the U.S. would not seek a new Cold War nor seek to change the Chinese system or back Taiwan's independence, Wang said.\nIn an annual and wide-ranging discussion, Wang struck a relatively measured tone as he also covered relations with Russia and the Ukraine conflict, China's stuttering economy and its ambitions in artificial intelligence.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nTensions between the two superpowers have slightly eased since Biden and Xi staged their landmark summit in San Francisco last November, but they remain in an uneasy detente ahead of the U.S. election this year which could see Republican China hawk Donald Trump return to the White House.\nWashington has repeatedly stated its desire to put a floor under the relationship after it spiralled to its worst in decades last year over issues including Taiwan, tech competition, trade and an alleged Chinese spy balloon shot down by the U.S. off its east coast.\nChina alleges the U.S. is trying to contain and suppress its high-tech development and industrial policy, while both militaries eye each other closely amid increased deployments across East Asia.\n\"So we urge the U.S. to understand the historical development trend, objectively and rationally look at China's development (and) actively and pragmatically carry out interactions with China.\"\nBeijing also faces ongoing geopolitical confrontations on multiple fronts, including with Europe on trade and the Ukraine war, Japan on a variety of issues, and the Philippines over the South China Sea, a regional hotbed of competing territorial claims.\nWang also said China is willing to work with Russia to foster new drivers of cooperation and consolidate friendship.\nChina and Russia had declared a \"no limits\" partnership in February 2022 when Putin visited Beijing just days before he sent tens of thousands of troops into Ukraine, triggering the deadliest land war in Europe since World War Two. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nSouth China Sea\nJoe Biden\nThanks for sharing!",
        "date": "2024-03-07",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/se-asia/dubai-move-plot-to-topple-malaysia-pm-anwar-is-unlikely-but-perception-of-instability-remains",
        "content": "KUALA LUMPUR\n–\nTalk of a purported plot to oust Prime Minister Anwar Ibrahim\nthat surfaced in the dying days of 2023\nrefuses to fade away, resulting even in Malaysia’s top cop announcing on Jan 9 a probe into such claims.\nThat speculation persists of the “Dubai Move” – named after the city where opposition figures and government backbenchers allegedly met in the United Arab Emirates in December – says less about the possibility of defections, and more about the perception of the government’s stability.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nMalaysia\nMalaysian politics\nAnwar Ibrahim\nUmno\nPerikatan Nasional\nThanks for sharing!",
        "date": "2024-01-12",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/world/united-states/jeff-bezos-defends-decision-to-end-washington-post-endorsements",
        "content": "WASHINGTON\n-\nMr Jeff Bezos, the billionaire owner of The Washington Post, whose decision to\nend presidential endorsements at the paper\nset off a firestorm inside and outside the paper last week, said on\nOct 28\nin his first comments about the change that it had been done to improve the newsroom’s credibility, not to protect his own personal interests.\n“Presidential endorsements do nothing to tip the scales of an election,” Mr Bezos wrote in an essay published on The Post’s website.\nHe added: “What presidential endorsements actually do is create a perception of bias. A perception of non-independence. Ending them is a principled decision, and it’s the right one.”\nThe paper had announced the decision to end endorsements on\nOct 25\n, in a note put out by Mr Will Lewis, its chief executive, who said it was “a statement in support of our readers’ ability to make up their own minds” about the election.\nBut at the time, the company said nothing about Mr Bezos’ motivation for the decision.\nSome speculated without evidence that Mr Bezos, the founder of Amazon, who has owned the paper since 2013, was trying to gain favor with a potential Trump administration. The paper’s editorial board had already drafted an endorsement of Vice-President Kamala Harris.\nMr Bezos said on\nOct 28\nthat he had not and would not pursue his personal interests through his ownership of the Post, and that “no quid pro quo of any kind is at work here”.\n“You can see my wealth and business interests as a bulwark against intimidation, or you can see them as a web of conflicting interests,” he added.\n“Only my own principles can tip the balance from one to the other. I assure you that my views here are, in fact, principled, and I believe my track record as owner of the Post since 2013 backs this up.”\nMr Bezos said that while he wished his decision had come earlier than it did, less than two weeks before the election, the timing was because of “inadequate planning, and not some intentional strategy”.\nAfter the announcement on\nOct 25\n, some of the paper’s best-known journalists spoke out about the decision and thousands of readers complained about it in comments on the Post’s website.\nMr Marty Baron, the recent editor of the Post who led the paper through a period of editorial and business success, called the decision “cowardice, with democracy as its casualty”, in a post on the social platform X.\nLegendary Post journalists Bob Woodward and Carl Bernstein said in a statement that the decision ignored “The Washington Post’s own overwhelming reportorial evidence on the threat Donald Trump poses to democracy”.\nThe paper’s news coverage of Trump has continued to be aggressive in recent days.\nEarlier on\nOct 28\n, three journalists said they were stepping down from the Post’s 10-person editorial board. All three are staying at the paper in other roles.\nThe three – Mr David Hoffman, who has worked at the Post since 1982; Ms Molly Roberts; and Ms Mili Mitra, the director of audience for the opinion department – all said during a mid-morning meeting of the editorial board that they were stepping down, according to a person with knowledge of the discussion.\nIn online statements, Mr Hoffman and Ms Roberts said publicly that they felt it was important for the paper to endorse Ms Harris because they considered Trump a danger to the country. Ms Mitra did not respond to requests for comment.\n“I believe we face a very real threat of autocracy in the candidacy of Donald Trump,” Mr Hoffman said in his letter announcing his intent to step down to the editor of the opinion department, Mr David Shipley.\n“I find it untenable and unconscionable that we have lost our voice at this perilous moment.”\nMr Hoffman received a Pulitzer Prize for editorial writing at a ceremony on\nOct 24\nfor a series on authoritarian regimes suppressing dissent.\nHe said he would continue working on several projects he had under way, “including the expanded effort to support press freedom around the world”.\nMs Roberts said in a post on X: “The mission of an editorial board is simpler than it may seem: We want to make the country and the world a better place by supporting the best candidate or the best policy, and condemning the worst. We want to change minds. But above all else, we want to write with moral clarity. If we can’t do that, what are we doing at all?”\nMs Roberts said the imperative on the editorial board to endorse Ms Harris over Trump was “about as morally clear as it gets”.\nMr Bezos ended his essay by saying that he would not allow the paper to “fade into irrelevance”, and that to regain trust among readers the paper needed to exercise “new muscles”.\n“Some changes will be a return to the past, and some will be new inventions,” he continued. “Criticism will be part and parcel of anything new, of course.”\nNYTIMES\nMore on this Topic\nOver 200,000 people cancel Washington Post subscriptions after it blocks Harris endorsement: NPR\nDaughter of LA Times owner says decision not to endorse Kamala Harris stems from stance on Gaza war\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nUS presidential election 2024\nJournalism\nJeff Bezos\nNewspapers\nThanks for sharing!",
        "date": "2024-10-29",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/singapore/breaking-down-barriers-for-disabled-zoe-zora-inspiring-inclusive-society",
        "content": "At 20, a devastating car accident left Ms Fathimah Zohra paralysed from her neck down. Despite facing chronic pain seven years on, which she manages through medication, she is determined to overcome every challenge in her second chance at life.&nbsp;\n“Life can change in seconds. But what you make of the new life you have is what matters,” says the 27-year-old, who’s better known as Zoe Zora.&nbsp;\nOnce an athletic teenager who played soccer and participated in track and field, Zora has learned to thrive in her new reality.\nIt took about one year of intensive rehabilitation and exercise before she regained enough movement in her arms to carry out tasks independently – from doing her own make-up to completing a strength-training workout.&nbsp;\n“Exercising gives me the physical and mental strength to live each day to the best of my ability, whether it’s to work or do the things I love.”\nAnd one of the things that she has directed this strength to is to help empower others with disabilities. Two years ago, she joined Inclus, a social enterprise that enables people with disabilities to pursue gainful employment and independence\n.\n“At 25, I felt like I wanted to do more for the community,” she recalls. “I’ve always wanted to contribute to the inclusive employment space and help other individuals with disabilities live sustainable and independent lives.”\nWatch this video to find out how Zoe Zora is making society more inclusive:\nFinding newfound purpose through inclusive employment\nAs an inclusive employment recruiter, Zora works closely with employers to promote disability inclusion. For instance, she helps them break away from outdated stereotypes and stigmas about people with disabilities through initiatives such as inclusivity training and workshops.&nbsp;&nbsp;\n“The challenge is often changing preconceived notions,” Zora explains. “It takes a lot of education and awareness to shift mindsets.”\nDespite the challenges, she has found purpose and deep satisfaction in her work. “Supporting someone through their employment journey and seeing them secure a job is incredibly rewarding. It’s exciting to know I’ve played a part in helping someone achieve what they’ve been striving for.”\nZora advocates for more inclusive workplaces, speaking at events to empower employers to embrace diversity. PHOTO: COURTESY OF ZOE ZORA\nMore on this Topic\nFinding purpose through challenges: Mother's special needs journey inspires a lifeline for caregivers\nBreaking down barriers through representation\nBesides her full-time job at Inclus, Zora also raises awareness about living with a disability and the importance of representation in the media via her social media channel @zoraaax6.&nbsp;\nWith over 32,000 Instagram followers, she shares her fitness workouts and make-up tutorials, and speaks openly about the reality of managing her own disability and mental health. She aims to inspire others while managing her disability and living life to the fullest.\n“Social media is where everyone spends their time these days and many are negatively impacted by it,” she says.&nbsp;\n“That’s why I try to be real and vulnerable on my page instead of just showing a highlight reel. It’s important to remind people that they’re not alone, especially when it comes to mental health.”\nThis stems from her own experiences of receiving criticism online, often from people accusing her of faking her disability or seeking attention. In fact, she used to feel so insecure and ashamed of her disability that she stayed off social media for about a year after being an active user for four years.&nbsp;\nToday, Zora has even resumed modelling for sports and beauty brands on an adhoc basis –&nbsp; something she used to do in her teens – and speaks at events such as the Enabling Lives Festival.\n“\nShowing up and advocating for disabled bodies was more important to me (than the negative comments),” she says.\nMore on this Topic\nIndie films, live gigs, fun events: How she’s giving audiences a ‘mental breathing space’\nChanging society’s perceptions\nWhen Zora became paralysed, it was not just the physical difficulty of going out and about with her activities that she had to cope with. Even now, she has to deal with how strangers tend to stare and feel pity for her, or tell her she would walk again one day.\nShe says: “While I understand their good intentions, being disabled is the reality of my life and I’ve come to terms with it. Although I do struggle at times, I can also be happy. So don’t feel bad for me because I sit in a wheelchair.&nbsp;\n“When you pity someone with a disability, you take away our power. Instead, acknowledge our experiences, and support and encourage us.”\nZora shares her life candidly on social media, showing the realities of managing disability while living life to the fullest. PHOTO: COURTESY OF ZOE ZORA\nZora wants society to understand that how someone looks does not always reflect how they feel.&nbsp;\n“I might look confident, but I could be battling internal struggles,” she explains. “Many people with mental struggles feel the need to hide them, and that’s why I believe it’s so important to advocate for mental health. It’s okay not to be okay.”\nShe believes in the power of compassion and understanding, especially when dealing with what she calls “invisible disabilities”.&nbsp;\n“Some people don’t know how to share their struggles, so be kind and give them space to be themselves. I share my experiences because I don’t want others to feel alone.”\nThe encouragement Zora gives to those in her community has given her strength to continue to make a difference for them. Private messages of gratitude and positive feedback from strangers also motivate her to continue to lift the hopes of those who feel helpless and “unseen”.\nLending her support in this journey are her loved ones, especially her parents, five brothers and two sisters, who were her “hands and legs” and helped her build emotional strength to fight against all odds.&nbsp;\n“I learnt that you can't always do things alone, and it's okay to get help and accept support from others. There’s so much good in the world, we need to stop focusing only on the bad,” she says.\nThis article was first published on\nherworld.com\nas part of the\nHer World, Her Spark\nseries.\n&nbsp;\nIn partnership with\nJoin&nbsp;\nST's WhatsApp Channel\n&nbsp;and get the latest news and must-reads.\nBranded content\nThanks for sharing!",
        "date": "2024-10-09",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/combat-sports/boxing-haitian-boxer-hoping-to-win-medal-to-improve-countrys-image",
        "content": "PARIS - Boxer Cedrick Belony-Duliepre said he is hoping to change the perception of Haiti by winning a medal at the Paris Olympics.\nArmed gangs have taken over much of Haiti's capital, Port-au-Prince and over half a million people have been internally displaced, with close to 5 million people experiencing severe hunger.\nBelony-Duliepre, who is based in the Canadian province of Quebec, said he wanted to give the people of his nation something to cheer about.\n\"For me, it's very important to win and make people happy because Haiti is in a bad situation right now,\" light heavyweight Belony-Duliepre, Haiti's lone boxer at the Olympics, told Reuters on Saturday.\n\"To put in a good performance and to bring a medal home is going to be good for the image of the country,\" he said.\n\"Luckily, none of my family has been affected because they are all in Canada right now. My family is from Haiti. My dad and my mom were born in Haiti. Then when I was young, like four or five, they went to Canada, to Montreal.\"\nBelony-Duliepre, who was awarded a universality place - like a wild card - in the men's boxing draw, faces World Championships silver medallist Wanderley de Souza Pereira of Brazil in his opening bout on Tuesday.\nIt only gets tougher from there for the Haitian, with a potential clash against Tokyo Olympics silver medallist Oleksandr Khyzhniak awaiting him in the next round, but the 25-year-old remains optimistic.\n\"You know, we are at the Olympics. Every sport, they have good fighters, good athletes, the best in the world are here,\" Belony-Duliepre said of his upcoming fights.\n\"I have a good draw. I'm going to fight the Brazilian guy first. He's a good boxer. But I know I can beat him and I'm going to beat him Tuesday.\" REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nHaiti\nOlympics\nBoxing\nThanks for sharing!",
        "date": "2024-07-28",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/who-s-afraid-of-prabowo-not-indonesia-s-young-chindos",
        "content": "“What will become of us after October?” asked a Chinese Indonesian woman in her 50s at a recent social gathering in Surabaya. The source of her worries: the inauguration of Mr Prabowo Subianto as Indonesia’s next president on Oct 20.\nYet, 100m away at another table, a group of Chinese Indonesian businessmen in their early 30s were discussing how best to start new ventures under likely initiatives to be launched by Mr Prabowo’s incoming administration.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nIndonesian politics\nPrabowo Subianto\nRace issues\nChina\nThanks for sharing!",
        "date": "2024-07-17",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/forum/forum-don-t-allow-99-year-hdb-lease-issue-to-remain-unresolved",
        "content": "I agree with sociologist Chua Beng Huat that the Government has an increasingly intricate and difficult task of balancing the perception of HDB flats as both public\ngood\nand financial asset (\nFuture of HDB flats: A delicate balancing act, says sociologist Chua Beng Huat\n, July 13).\nThis is especially when many Singaporeans’ savings have gone into their home purchase.&nbsp;\nA third of home owners have capitalised on profiting through a buy-sell-repurchase cycle. I believe the two-thirds who have not acted on this strategy intend to bequeath their home to their family members.&nbsp;\nPolitical leaders and Singaporeans must recognise and accept the fundamental principle of the 99-year lease for most HDB flats.&nbsp;The HDB will not be able to conduct the Selective\nEn bloc\nRedevelopment Scheme for every maturing flat in Singapore. It is both financially inconceivable and irresponsible.&nbsp;\nNational Development Minister Desmond Lee has reiterated in Parliament that HDB flats of 99-year leasehold strike a good balance between providing a home for life, asset appreciation, rejuvenating our city and building\nhomes\nfor the new generation.&nbsp;&nbsp;\nThough the government of the day has reaped political returns, legitimacy and gratitude from past Singaporeans who have gained much from owning an HDB flat, we should not allow the 99-year lease issue to remain unresolved.\nFoo Sing Kheng\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nToday's Letters\nHDB\nHDB prices\nMinistry of National Development\nThanks for sharing!",
        "date": "2024-07-19",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/world/united-states/trump-will-face-his-greatest-fears-as-two-legal-threats-coincide-on-march-25",
        "content": "NEW YORK – Former US president Donald Trump is expected to spend the morning of March 25 in the courtroom of a New York judge who might soon preside over his criminal trial and, ultimately, throw him behind bars. And that is not even the legal predicament that worries Trump most that day.\nThe hearing for his Manhattan criminal prosecution – in which he is accused of covering up a sex scandal to pave his way to the presidency – comes as he\nraces to fend off a financial crisis\narising from a US$454 million (S$613 million) judgment in another case. New York Attorney-General Letitia James, who brought that civil fraud suit against the former president and his family business, might begin to collect as soon as March 25.\nTo avoid a mortal threat to the Trump Organisation, Trump must persuade another company to post a bond on his behalf, promising that it will cover the judgment if he loses a pending appeal and fails to pay. Yet, Trump’s lawyers said in court papers that securing the bond would be a “practical impossibility” because he would need to pledge about US$550 million in cash and liquid investments as collateral to the bond company – an admission that laid bare Trump’s cash crunch.\nUnless Trump strikes an eleventh-hour deal, Ms James could freeze his bank accounts, and begin the long and complicated process of seizing some of his properties. And barring Trump’s lawyers achieving an improbable legal triumph, the judge in his criminal case could set a trial date for as soon as in\nApril\n.\nThe twin threats – on the same day, in the same city – crystallise two of Trump’s greatest and longest-held fears: a criminal conviction and a public perception that he does not have as much cash as he claims.\nFor decades, Trump employed a broad array of tactics to keep those fears at bay, learning from his well-connected father and his own ruthless lawyer and fixer Roy Cohn. After fending off local and federal investigations, not to mention financial ruin, Trump came to believe that any problems could be solved by personal connections – and a whole lot of money.\n“If Trump uses one thing to score the game, it has always been money,” said Mr Jack O’Donnell, a former casino executive who worked for Trump in the early 1990s and wrote a tell-all book about him. “If he has more money than someone, he is winning and the other person is losing. And if someone has more money than Trump, he has the fear that someone will say he is losing to that person.”\nTrump has also described the shame of becoming a criminal defendant four times over. Even as his advisers used the indictments to great effect in fund raising and galvanising his Republican base, Trump has conceded that the charges pained him.\n“Nobody wants to be indicted,” Trump told reporters aboard his airplane last June. “I don’t care that my poll numbers went up by a lot. I don’t want to be indicted. I’ve never been indicted. I went through my whole life, now I get indicted every two months.”\nIt was a massive shock for a man who, until then, had navigated a wary path around law enforcement scrutiny throughout his long public life.\nHe was investigated criminally over a land acquisition in the mid-1970s, yet escaped unscathed. A federal special counsel examined possible ties between the Trump 2016 campaign and Russia, as well as his effort to obstruct the investigation as president, and recommended no charges. He was twice impeached by a Democrat-led House, but twice the Senate did not convict him.\nBefore 2023, nothing stuck.\n“He’s been so lucky, and nobody’s ever had worse adversaries than this guy,” said Mr Ty Cobb, a lawyer who worked in the Trump White House during the special counsel investigation and has become sharply critical of the former president.\nSome of it was luck, but his public relations strategy paid off as well. Trump deployed a mix of bare-knuckle tactics – attacking prosecutors as “corrupt” and guilty of the same conduct of which he was suspected – and arm-twisting charm.\nMore on this Topic\nTrump media merger is approved, providing fresh source of cash\nWhy no one will lend to Trump\nAmong Trump’s prized relationships was with Mr Robert Morgenthau, the Manhattan district attorney for decades.\nWhile Mr Morgenthau was in office, he would joke privately that his pet charity, the Police Athletic League, was the only one to which Trump routinely donated. And when Trump supported Mr Morgenthau politically, some Trump Organisation officials were told they needed to write cheques of their own to the district attorney’s campaign, according to two people familiar with what took place. (People who worked with Mr Morgenthau, who died in 2019, said there was nothing directly involving Trump that crossed their desks that would have required investigation.)\nThe district attorney’s office, now held by Mr Alvin Bragg, was the first to indict Trump in\n2023\nbefore other prosecutors followed suit. The former president privately reacted with disbelief that his hometown district attorney had dared to come after him.\nIn 2021, when the office was intensifying its investigation, Trump told an interviewer that “Bob Morgenthau would not have stood for this”.\nMr Bragg’s case concerns a personally embarrassing episode for Trump: a\n$130,000 hush-money payment to porn actress Stormy Daniels,\nmeant to bury her story of a sexual encounter with Trump. His fixer at the time, Mr Michael Cohen, made the payment. Trump, who has denied the affair, is accused of falsifying business records on his reimbursement of Mr Cohen.\nTrump’s lawyers, as they do in each of his legal entanglements, are seeking to delay the trial past Election Day. If Trump is re-elected, the cases against him would probably grind to a halt.\nThe New York judge presiding over the case, Mr Juan Merchan, recently delayed the trial for three weeks, until April 15, and the hearing on March 25 will determine whether he postpones it further.\nDespite the best efforts of Trump’s lawyers to delay or scuttle the case, it is the indictment that his advisers are the least concerned. They argue it is the least politically damaging to the presumptive Republican nominee, despite the personally mortifying details.\nHowever, the New York Attorney-General’s civil fraud case, which accuses Trump of wildly exaggerating his net worth, has struck a particularly sensitive nerve with the former president.\nTrump measures his wealth in the billions, a sum that largely stems from the value of his properties. Although valuing real estate is more of an art than a science, the Attorney-General disputed some of Trump’s purported estimates as wildly exaggerated, concluding that he\ninflated his net worth by as much as US$2 billion.\nMore on this Topic\nTrump under oath: Assets are ‘Mona Lisas’, his name worth $4 billion\n‘Sorry, Donald’: Biden trolls Trump over campaign cash lead\nAnd then there’s his cash. Trump argues that he is relatively liquid for a real estate developer, stating in a deposition in\n2023\nthat he had more than US$400 million in cash.\nAlthough The New York Times was unable to verify the precise number, records and interviews show he recently had more than US$350 million in cash as well as stocks and other investments he can sell in a hurry. While significant, it is not enough to secure the appeal bond.\nTypically, when facing outsize financial troubles, Trump has refused to concede that anything is wrong, dating back to when his business nearly collapsed in the early 1990s. People who have known him for many years say he has become accustomed to believing he can give the appearance of waiting out problems until circumstances change, banking on some sort of rescue at the last minute.\nIn the 1990s, banks bailed him out, even though he had massively overextended himself with a costly development of the Taj Mahal casino in Atlantic City, New Jersey.\nWith Ms James poised to begin enforcing the US$454 million fraud judgment, Trump appeared to be hoping for similar twists of fate. He could, for example, try to secure a loan from a private equity firm or a hedge fund. He is also hoping an appeals court will pause the judgment.\nAnd then there is the windfall he could reap from his social media company, whose shares start trading on the stock market as early as on March 25. His stake is currently valued at roughly US$3 billion, but it might come too late: He is prohibited from selling for six months. Although Trump could find ways around that restriction that enable him to use his stake to raise cash for the appeal bond, no such deal appears imminent.\nA post on Trump’s Truth Social platform on March 22 captured his insecurities. He claimed (falsely) that he had almost US$500 million in cash, and also claimed (falsely) that he had been planning to use that money to fund his own campaign; in reality, he last spent money on his own candidacy in 2016, and the amount was still nowhere near what he had claimed he would spend.\nBut his post was honest about at least one thing: To him, the US$454 million judgment was a “shocking number”. NYTIMES\nMore on this Topic\nBorn in the USA: The ‘stolen election’ and other wild lies roiling American politics\nDemocracy dies in Trumpian boredom\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nDonald Trump\nUnited States\nNew York\nUS presidential election 2024\nThanks for sharing!",
        "date": "2024-03-24",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/motoring/luxury-cars-rides-the-car-expo-2024",
        "content": "&nbsp;\nBy invention, cars serve a functional purpose, as a means of travelling from point to point. By construction, they vary, as carmakers stratify their model offerings to appeal to different audiences.&nbsp;\nAs with all things in life, there are cars built for the masses, with good levels of quality and performance at accessible price points. And there are cars developed for discerning tastes, for consumers who desire a car that is a cut above.&nbsp;\nCue the luxury car, with striking good looks, an exceptional build quality crafted with fine materials, equipped with state-of-the-art technology and capable of a superior soul-stirring performance.&nbsp;\n&nbsp;\nSuch cars used to be typically German, Italian or English but now include Asian automakers in a more level playing field.&nbsp;\nCommanding premium price points, these cars are a reflection of their owner’s status in life and exquisite taste.&nbsp;\nBut this perception no longer holds true in Singapore, where owning a car is a luxury in itself.&nbsp;\nThis raises a point: What would luxury look like for a car owner seeking more than just a means to commute?&nbsp;\nThat would have to involve looking beyond the physical – and more conventional – representation of luxury and into the experience of it.&nbsp;\nHere are different facets of luxury motoring and the cars, which are on show at\nThe Car Expo\nthat define them.&nbsp;\nLuxury of speed: Alfa Romeo Giulia\nThe sleek Alfa Romeo Giulia sprints from zero to 100kmh in just 5.2 seconds. PHOTO: ALFA ROMEO\nThe Alfa Romeo Giulia’s sensation of speed will stir the soul and captivate the hearts of enthusiasts. Its high-performance 2-litre turbocharged engine delivers an impressive 280bhp and 400Nm of torque, allowing it to go from zero to 100kmh in merely 5.2 seconds and race on to a top speed of 240kmh.\nA combination of lightweight materials, perfect 50/50 weight distribution, clever limited slip differential and sophisticated suspension imbues the Giulia with sporty driving dynamics that can easily rival the best in its class.\nAnd it accomplishes all these while managing to look great at the same time, with its head-turning looks that feature a sleek design with a modern interpretation of the iconic ‘Trilobo’ grille and full-LED Adaptive Matrix headlights.&nbsp;\nLuxury of space:\nGAC\nAion Y Plus\nThe GAC Aion Y Plus transforms the cabin into a mobile relaxation oasis for passengers with its reclining seats and a panoramic sunroof. PHOTO: GAC AION\nThe\nGAC Aion\nY Plus delivers a whole new level of relaxation and enjoyment, with innovative use of space that allows it to be transformed into a mobile entertainment hub for leisure activities.&nbsp;\nIts front seats can be reclined into a completely flat position, letting passengers enjoy the luxury of space to relax or even take a quick nap in comfort.\nThe ambience is enhanced further with interior ambient lighting, which can be customised to suit the mood and taste for an inviting atmosphere. A panoramic sunroof creates an airy sensation by letting in generous amounts of sunlight into the cabin, while using advanced technology to keep the heat out.\nEntertainment is taken care of with the Aion Y Plus’ large\n14.6-inch touchscreen\ninfotainment system, which can be hooked up with gaming controllers and karaoke microphones, opening up a whole new world of in-car entertainment options.&nbsp;\nLuxury of status: BMW 5 Series\nThe iconic BMW 5 Series elevates executive luxury into the electric era with the new i5, which delivers the same performance and technology expected of its long-standing premium status. PHOTO: BWM\nFor over five decades, the BMW 5 Series has been the quintessential executive sedan for those who seek the ideal combination of performance and luxury.&nbsp;\nTo many, owning a 5 Series is a sign of success and accomplishment.\nThe latest eighth-generation 5 Series continues in the same vein, but elevates that even further. For the first time, the 5 Series is available with choices of petrol engines or full-electric drivetrains.&nbsp;\nWith up to 582km of range, the\nall-electric BMW i5 marks a huge step forward into the era of sustainability, demonstrating that driving into an electric future does not compromise\nth\ne same principles that\ndefined the 5 Series over the years.\nWhether you go for the petrol-powered BMW 520i or the electric BMW i5, you can expect the same iconic driving experience as any 5 Series model, along with its reputation for delivering the latest and greatest technologies that make it the indisputable benchmark to beat in its class.\nLuxury of versatility: MG M9 EV\nWith advanced features, including an eight-way in-seat massage function and a 220V socket, the MG M9 EV combines leisure and business on the move. PHOTO: MG\nVersatility is the ability to adapt and cater to many different functions and activities, and the MG M9 EV demonstrates that to a T.&nbsp;\nIts cavernous interior lets you ferry seven passengers easily and it makes for the ideal vehicle to haul a family across long road trips in comfort.\nBut the MG M9 EV can also function as an opulent executive cruiser, with plush captain’s chairs delivering a first-class travelling experience. With full-electrical adjustment, heating and ventilated functions and an&nbsp;\neight-way\nbuilt-in massage feature, passengers in the MG M9 EV get to experience luxury, all available at the touch of your fingertips via the touchscreen control system integrated into the seats.\nThere are also a variety of convenience features such as the folding table, pop-out cup holders and 220V power socket, all designed to allow passengers to be productive on the go.&nbsp;\nLuxury of design: BYD Seal\nThe award-winning BYD Seal stuns with its distinctive X-shaped front and captivating U-shaped headlights on the road, while its passengers revel in state-of-the-art interiors. PHOTO: BYD\nGreat design is one that turns heads and gets people talking, and the BYD Seal truly encapsulates that principle with its sleek styling.&nbsp;\nIts distinctive X-shaped front end blends sportiness and style, giving the car a unique look that will spark conversations.\nDetails such as the double U-shaped LED headlights create a captivating visual effect, while the rear taillights are arranged in a sophisticated dot matrix effect and span the entire width of the car to accentuate its sculpted looks.&nbsp;\nSuch a design gives it a touch of elegance and grace. Being awarded the coveted iF Design Award is further recognition of the BYD Seal’s unparalleled innovation in design.\nAt the same time, there is substance to go with its iconic looks. With a cleverly designed interior that delivers the perfect combination of comfort and luxury, together with the latest technology and state-of-the art features, the BYD Seal proves that function and form can work in perfect harmony.\nLuxury of comfort: Mercedes-Benz C-Class\nThe epitome of comfort and luxury, the Mercedes-Benz C-Class can adapt to any preferred driving style with an optional Adaptive Damping System. PHOTO: MERCEDES-BENZ\nThe Mercedes-Benz C-Class is truly a car that will put you in your comfort zone. It all starts with the optional multi-contour seats, which incorporates eight massage programmes and inflatable side cushions for maximum lateral support.&nbsp;\nTogether with the optional Energizing packages that allow you to select different interior moods like “Vitality” or “Refresh”, the interior of the C-Class truly sets you at ease.\nAnd when you are on the go, the Mercedes-Benz C-Class offers the assurance of peace, with its optional Driving Assistance Package ensuring safety on the roads.&nbsp;\nEngineering innovations, such as the Integrated starter-generator, deliver performance and efficiency, while an optional Adaptive Damping System, which adjusts to your preferred driving style, prioritises comfort whenever you are behind the wheel.\nLuxury of balance: Peugeot E-2008\nOn a 100kW DC charger, the Peugeot E-2008 can be powered up from zero to 80 per cent in just 30 minutes, perfect for avid city drivers. PHOTO: PEUGEOT\nThe Peugeot E-2008 stands as a beacon of modernity and performance, seamlessly blending eco-consciousness with the bold spirit of today’s younger generation.&nbsp;\nIts innovative design, characterised by its front grille that marries strength with elegance through a unique lateral pattern\nthat connects to the headlamps,\ngives it a strong personality.&nbsp;\nThe captivating three vertical claw daytime running lights – exclusive to the E-2008 GT – strengthens the car’s allure, distinguishing it from its siblings and ensuring the electric SUV stands out in any crowd.\nBeneath its stylish exterior lies efficiency and agility: The E-2008’s electric heart throbs with 100kW of power and 270Nm of torque, which promises an exhilarating driving experience.&nbsp;\nMore on this Topic\nAccelerating the mobility shift: Why more drivers are embracing electrification\nGoing for a high yield: Hit your best mileage with these fuel-saving hybrid cars\nLow fuel, smart drive: Which high-tech car gets you more mileage for less\nWith a WLTP range of 436km – roughly sufficient for a week’s worth of city driving – the car makes for an ideal companion for the eco-aware young professional.&nbsp;\nRapid charging capabilities further enhance the E-2008's appeal, with a zero to 80 per cent charge achievable in just 30 minutes on a 100kW DC charger.&nbsp;\nInside, the Peugeot\n3D i-Cockpit o\nffers drivers cutting-edge technology, from the customisable 3D holographic instrument panel to the 10-inch HD touchscreen. This ensures every journey is as connected as it is comfortable.\nWith efficient performance and minimal environmental impact, the Peugeot E-2008 is a ride for those ready to embrace the future of driving.\n&nbsp;\nThe Car Expo\n&nbsp;will be held on April 13 and 14, at Singapore Expo Halls 4 and 5 from 10am to 8pm.&nbsp;\nClick here for the floorplan of the show\n. Read more about&nbsp;\nthe latest cars and special deals at the The Car Expo here\n.&nbsp;\nJoin&nbsp;\nST's Telegram channel\n&nbsp;and get the latest breaking news delivered to you.\nBranded content\nThe Car Expo\nCars\nThanks for sharing!",
        "date": "2024-04-11",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/formula-one/after-daytona-500-william-byron-wont-be-the-other-guy-anymore",
        "content": "DAYTONA BEACH, Fla. -- Overlooked and underappreciated. That's the perception that has driven newly crowned Daytona 500 champion William Byron to achievements beyond his imagination.\nByron learned how to race on a computer, and when team owner Rick Hendrick promoted him to the NASCAR Cup Series as a 20-year-old in 2018, there were plenty of skeptics who looked askance at the move.\nAt 26, Byron is the youngest driver in an organization that includes six-time most popular driver Chase Elliott, who won the 2020 series championship; and Kyle Larson, the 2021 champion who often is described as a generational talent across a multitude of racing platforms.\n\"I'm the other guy,\" Byron said on Monday night after doing what no other Hendrick driver has been able to do since Dale Earnhardt Jr. won the Daytona 500 in 2014.\nIn fact, Byron is the only current Hendrick driver who has ever won a Cup points event on the Daytona oval, where he claimed the first of his 11 career victories in the 2020 summer race.\nLast year, Byron won a series-best six races and qualified for the Championship 4, finishing third in the final standings. Nevertheless, despite his obvious flair for superspeedway racing, the driver of the No. 24 Chevrolet opened at disrespectful 18-to-1 odds for the Daytona 500 at DraftKings Sportsbook.\n\"Yeah, I use it all as fuel, so just keep it coming,\" Byron said. \"All the preseason predictions and everything. I just try to stay quietly focused. I feel like for me, I do well having my own space and being able to work through the things with my race team...\n\"I don't read too much into it. I'm never going to be the most vocal guy. I just enjoy getting in the race car and putting the helmet on and going to work. That's what I've always lived for.\"\nOne clear catalyst for Byron's career has been the pairing in 2021 with crew chief Rudy Fugle, who called the shots from the pit box when Byron broke into the NASCAR Craftsman Truck Series with a seven-win season with Kyle Busch Motorsports in 2016.\nTogether, Byron and Fugle have won 10 Cup races at Hendrick Motorsports.\n\"William puts in the work,\" team owner Rick Hendrick said in a Monday night post-race press conference. \"That's all he thinks about. He's in the simulator. He's watching tapes. He has worked so hard. People don't realize how much time he puts in.\n\"But bringing Rudy on gave him that confidence, because they were so successful in the Truck Series, and, man, they just picked up and clicked. And when you think about his age and how smart he is and how he races like a guy that's been doing it for a long time, doesn't make many mistakes, but he just eats and drinks and sleeps winning. He puts in the work.\"\nIn Monday's rain-delayed Daytona 500, the work paid off. Byron grabbed the lead after a restart with four laps left, took the white flag and was narrowly ahead of teammate Alex Bowman when NASCAR called the fifth and final caution for Ross Chastain's slide through the grass in the tri-oval.\nThe victory wasn't just a career-defining moment for Byron. It was the perfect kickoff for the year-long 40th anniversary celebration for Hendrick Motorsports, whose drivers, past and present, have amassed a series-best 302 victories since its founding in 1984. That was the season Geoff Bodine rescued a company on the brink of extinction with his win at Martinsville.\nIn breaking a decade-long DAYTONA 500 drought, Byron also gave Hendrick its ninth victory in the Great American Race, tying the organization with Petty Enterprises for most all-time.\n\"Tonight he told me, he said, ‘I never thought I'd race here, and now I've won the Daytona 500,'\" Hendrick said. \"So pretty special.\"\nIn the post-race celebration, no one seemed happier than Hendrick vice chairman Jeff Gordon, who drove the No. 24 Chevrolet to 93 victories and four series championships.\n\"I try not to be biased, but William is making it hard on me,\" said Gordon, who won the Daytona 500 three times. \"It's 2024, and the 24 is always going to be very, very special to me. But what I loved the most is seeing him make it his number and building that fan base -- 24 fans have been around for a long time, but his own fans.\n\"A win like this, my gosh, this is going to elevate that up to the next level and bring a whole lot more new fans to the sport and for William. That's what I get excited (about) and look forward to.\"\nIt's also something Byron will have to get used to. And he may have to find a new source of motivation.\nHis days as \"the other guy\" are numbered.\n--By Reid Spencer, NASCAR Wire Service. Special to Field Level Media REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nThanks for sharing!",
        "date": "2024-02-21",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/asia/italy-looks-to-use-g7-chair-to-boost-support-for-ukraine-scrutinise-ai",
        "content": "ROME  -     Italy will use its presidency of the Group of Seven major democracies to challenge growing perceptions that Russia is winning in Ukraine and that the West is tiring of the war, a source familiar with Italy's G7 plans said.\nItaly will chair the G7, which also groups the United States, Japan, Germany, Britain, France and Canada, throughout 2024 and will host a summit in June.\nLaying out Italy's priorities for the first time, the source said core issues on the leaders' agenda would include conflict in the Middle East, food security, climate change, development in Africa, engagement with China and Artificial Intelligence.\nAs in the last two G7 presidencies, the war in Ukraine will also be a major consideration, said the source, who was not authorised to go on the record talking about Italy's plans.\nThe West's once-staunch wartime support for Kyiv has appeared to waver in recent months amid political wrangling in Washington and Brussels that has held up the delivery of badly needed arms and funding.\nHowever, the source said G7 leaders were determined to show they remained fully committed to Kyiv and could not risk showing signs of weakness two years after Russia invaded its neighbour.\n\"We must change the narrative on Ukraine,\" the source said, adding that Russian President Vladimir Putin had lost significant financial, military and diplomatic clout since the invasion.\nItaly is planning to stage 20 ministerial meetings during its G7 presidency, kicking off with a three-day gathering from March 13-15 on industry, technology and digitalisation, which will put a spotlight on the fast-paced AI revolution.\nPrime Minister Giorgia Meloni has already said that the dangers posed by AI will be a key issue for Italy's G7 presidency and she will dedicate one session to the subject at the June 13-15 summit in Puglia, the source said.\nItaly wants to focus on the impact of AI on jobs and inequality, while also laying down \"ethical guardrails\" for the development of the technology. Rome will also propose creating a steering committee to ensure greater G7 coordination on AI.\nThe source said G7 leaders were \"pretty much on the same page\" over AI, adding that there was broad consensus on most of the major issues facing the wealthy-nation club, including on how to deal with China.\nThere was a determination on all sides to avoid tensions with Beijing, the source said, adding: \"Nobody wants to impede or put obstacles towards Chinese growth.\"\nThere was also agreement, the source said, on the need to develop economies in Africa and try to stem illegal immigration - a domestic priority for Meloni, who is struggling to honour an 2022 election pledge to stem migrant flows. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nItaly\nVladimir Putin\nGiorgia Meloni\nThanks for sharing!",
        "date": "2024-01-23",
        "is_related": true,
        "title": "Italy to Use G7 Presidency to Challenge Perceptions on Ukraine and Engage with China",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Belt and Road Initiative",
                0
            ],
            [
                "Asian Infrastructure Investment Bank",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ],
            [
                "China dream",
                0
            ]
        ]
    },
    {
        "url": "https://straitstimes.com/world/europe/britain-s-climate-watchdog-accuses-sunak-of-sending-mixed-signals",
        "content": "LONDON\n-\nBritain’s top climate change advisory body on Jan 30 accused Prime Minister Rishi Sunak of creating “mixed signals” and a perception of “slowing UK climate ambition”, as it demanded renewed action.\nThe Climate Change Committee (CCC) said the country’s image as a leader on the issue had suffered since\na speech by Mr Sunak in September\nin which he pushed back the UK’s net-zero initiatives by delaying the ban on the sale of new petrol and diesel cars and the phasing out of gas boilers.&nbsp;\nThe Conservative government has also approved a new coal mine and licensed new oil and gas production.\n“The international perception of the UK’s climate ambition suffered from mixed messages following announcements on new fossil fuel developments and the prime minister’s speech to soften some net-zero policies,” the committee said.\nIt advises on government policy over how to reach Britain’s net-zero aims, and on Jan 30 issued its latest report reviewing progress at the COP28 climate summit in Dubai in December.\nThe CCC added that Mr Sunak’s September speech and the government’s recent decisions “have contributed to a perception of slowing UK climate ambition by members of the international community”.\n“Strong, consistent domestic policy and communications on climate that avoid mixed messaging are crucial to be able to robustly advocate for high climate ambition internationally,” it added.\nThe report comes weeks after Mr Chris Stark quit as CCC head, following criticism of Mr Sunak’s environmental policies. He has now called meeting the country’s 2050 net-zero target “wishful thinking”.\nMr Stark’s resignation came just days after Conservative MP and former energy minister Chris Skidmore announced he was quitting as a lawmaker in opposition to Mr Sunak’s decision to grant hundreds of new oil and gas drilling licences.\nMr Sunak has defended the policies, saying the UK would pursue a “pragmatic” approach to achieving net-zero.\nThe UK leader has said policies have been imposed “without having an honest conversation with the country about what’s required to deliver them”.\nThe government remained “committed” to those targets, he insisted, adding that he had “absolute confidence and belief that we will hit them”.\nThe policy shift comes as British voters are facing a cost-of-living crisis that has seen food and housing costs spiral.\nSome within Mr Sunak’s ruling Conservatives – in power since 2010 – have raised concerns over the potential financial cost of reaching net-zero.\nThe main opposition Labour Party – leading in the polls ahead of an expected general election later in\n2024\n– have joined environmental campaigners and others in criticising Mr Sunak’s policy changes. AFP\nMore on this Topic\nBritain’s top government climate change adviser steps down\nBritain PM Rishi Sunak rowing back on climate change measures\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nFind out more about climate change and how it could affect you on the\n&nbsp;\nST microsite here\n&nbsp;\n.\nClimate change\nBritain\nRishi Sunak\nThanks for sharing!",
        "date": "2024-01-30",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/life/farmed-versus-wild-caught-salmon-s-nutritional-value",
        "content": "NEW YORK – Salmon is good for you – that part people know.\n“Fish is one of the few animal foods consistently linked to health benefits, and salmon is at the top of my list when I recommend fish to people,” said Dr Dariush Mozaffarian, a distinguished professor at Tufts University and director of its Food is Medicine Institute.\nBut choosing which type to eat for your health – sockeye or coho, wild or farmed – is not so obvious.\nResearchers have found that the nutritional value of salmon can vary depending on the species. And there is a consumer perception that farmed and wild-caught salmon differ in terms of their nutrients and levels of contaminants – beliefs that research partly supports.\nFrom healthy fats to heavy metals, here are answers to some salmon-related questions.\nWhat is so great about salmon?\nDr Mozaffarian highlighted omega-3 fatty acids – specifically DHA and EPA – as one of salmon’s distinctive nutritional attributes. Salmon packs more DHA and EPA omega-3s than almost any other food, apart from other fatty fish such as herring and sardines.\nStudies have consistently linked the consumption of omega-3 fatty acids from seafood to lower rates of stroke and heart disease. Research suggests these fatty acids reduce arterial stiffness associated with high blood pressure. They may also have anti-inflammatory effects that could protect against obesity and Type 2 diabetes.\nDr Mozaffarian said that omega-3s are essential to early life brain development, and emerging evidence suggests that consuming them regularly may guard against age-related cognitive decline and neurodegenerative diseases, such as Alzheimer’s.\nWhile the human body is able to make some DHA and EPA on its own, eating foods high in these omega-3s can help ensure the body and brain get what they need, he said.\nThe American Heart Association recommends eating\nan 85g\nserving of fish – particularly fatty fish, such as salmon – at least twice a week.\nWhile many supplements contain omega-3s, there is evidence that getting these fats from seafood may be superior, perhaps because there are compounds in fish meat that help prevent omega-3s from breaking down during digestion.\nExperts also say that salmon contains other nutrients – such as protein, selenium and iodide – that may support or augment the healthy effects of these fats.\n“The focus is usually on omega-3s, but it’s the whole package that makes salmon so healthy,” said Dr Matthew Sprague, a lecturer in nutrition at the University of Stirling Institute of Aquaculture in the United Kingdom.\nIs one type healthier than another?\n“There are so many different options in the marketplace, it can be confusing,” said Dr Stefanie Colombo, an associate professor and research chair in aquaculture nutrition at Dalhousie University in Canada.\nIn an attempt to clear up some of that confusion,\nshe\nexamined the nutritional values of the types of salmon available to consumers. “The main finding of our work was that there’s not much difference between wild and farmed,” she said.\nSalmon packs more DHA and EPA omega-3s than almost any other food, apart from other fatty fish such as herring and sardines.\nPHOTO: NYTIMES\nWhile wild sockeye and wild chinook were the most “nutrient dense”, her study also found that farmed Atlantic salmon had only slightly lower levels of omega-3s, proteins and other healthful nutrients.\nPink salmon tended to have less of these nutrients than the other types, regardless if they were farmed or wild.\nThe nutritional figures in Dr Colombo’s study were averages, however.\nDepending on factors such as the type of feed given to farmed salmon or the time of year a wild salmon is caught, she said, the levels of healthy fats or other nutrients can differ from fish to fish.\nShe\nadded that “all the salmon we looked at were very nutritious”.\nWhat about mercury and other contaminants?\nMore on this Topic\nSelling fresh salmon from a farm built in a factory in New York\nUS conservationists, farmers unite to protect salmon habitat\nDr Colombo said her paper did find some differences. Farmed Atlantic salmon, for example, tended to have lower mercury levels than wild-caught varieties.\nHowever, all the samples contained levels of mercury far below international safety standards. “Even if you ate salmon every day, mercury is not something you should be concerned about,” she said.\nThe same can be said for polychlorinated biphenyls and other contaminants that sometimes turn up in seafood.\nResearch has found that salmon, whether wild or farmed, does not contain harmful levels of these toxins. That is partly because it does not live long enough to absorb a lot of them, Dr Mozaffarian said.\nFor those concerned about the ecological impact of their food choices, salmon comes with some baggage. The overfishing of wild species and farming-related pollutants are concerns.\nBut experts said that all types of salmon outperform most animal sources of protein, in terms of environmental footprint.\nWhen buying salmon, Dr Colombo recommended looking for label certifications from the Marine Stewardship Council or Best Aquaculture Practices.\n“If the salmon is certified, that should give you more confidence it has been sustainably and ethically sourced,” she said.\nAbove all, the experts affirmed that all salmon is good for you, and agonising over a choice is not necessary. “Assuming you like the flavour, it’s really the perfect fish,” Dr Mozaffarian said.\nNYTIMES\nMore on this Topic\nFreshwater fish swim into trouble as climate change increases threat: IUCN\nRaising standards of coastal fish farms in S’pore with tilapia, the ‘chicken of the sea’\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nLiving Well\nNutrition and diet\nFish\nHealth and well-being\nThanks for sharing!",
        "date": "2024-02-06",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/money-dysmorphia-traps-millennials-and-gen-zers",
        "content": "Never hesitant to rebrand an existing phenomenon, millennials and their Gen Z frenemies are admitting to having “money dysmorphia” – a feeling of insecurity around their financial situation even when the true picture reveals little cause for concern. Some 43 per cent of Gen Z and 41 per cent of millennials say they suffer from a flawed perception of their finances, according to a recent Credit Karma study.\nWhile it might sound like just another form of TikTok-induced anxiety, money dysmorphia is a real problem that can cause someone to make poor or ill-informed decisions.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nGen Z\nMillennials\nSocial conditions and trends\nThanks for sharing!",
        "date": "2024-02-07",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/sport/parkrun-ditches-records-to-be-less-off-putting",
        "content": "Parkrun has removed speed records from its website to reduce the \"off-putting\" nature of them and dispel the perception that the runs are races, the organisation founded in London said on Thursday.\nParkrun, which organises free weekly 5km running events organised by volunteers, began with a group of 13 friends in a south-west London park in 2004 before growing into a worldwide activity.\nIt is to stop publishing data including most first-place finishes, age-grade and category speed records. Users will no longer have the ability to search for these records.\n\"What was clear is that there was a disconnect between the performance data displayed so prominently on the site, and our mission to create opportunities for as many people as possible to take part in parkrun events,\" Parkrun said. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nLondon\nThanks for sharing!",
        "date": "2024-02-09",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/israel-hamas-conflict-risks-getting-lost-in-the-digital-fog-of-war",
        "content": "In October,\nHamas blamed an Israeli air strike for an\nexplosion at the Al Ahli Arab Hospital in Gaza\nin which scores of people were killed, apparently in an adjacent carpark which provided shelter.\nThis claim was initially widely shared by international news outlets and Arab leaders across the Middle East, sparking massive protests in the region and beyond.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nIsrael-Palestine\nWars and conflicts\nUN\nThanks for sharing!",
        "date": "2023-11-02",
        "is_related": false
    },
    {
        "url": "https://straitstimes.com/opinion/the-emerging-debate-in-america-how-to-deal-with-a-china-in-decline",
        "content": "For almost a decade, all the talk among key United States officials and strategy experts was about the rise of China and what the US could do to prevent, constrain or accommodate itself to a development that seemed so inevitable as to be effectively preordained.\nBut over the past month or so, the debate in official Washington has swung 180 degrees in the opposite direction. The fashionable talk now is about what the US should do to handle a China that may have already peaked in its economic power and could soon decline.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nUS-China ties\nChina economy\nGeopolitics\nUS foreign policy\nThanks for sharing!",
        "date": "2023-09-05",
        "is_related": false
    }
]