[
    {
        "url": "https://straitstimes.com/asia/italy-tells-china-it-is-leaving-belt-and-road-initiative",
        "content": "ROME  -     Italy has officially informed China that it is quitting the Belt and Road Initiative (BRI), dismissing fears the move might sour relations and damage the Italian economy, government sources said on Wednesday.\nItaly in 2019 became the first and so far only major Western nation to join the trade and investment programme, ignoring warnings from the United States that it might let China take control of sensitive technologies and vital infrastructure.\nHowever, when Prime Minister Giorgia Meloni took office last year, she said she wanted to withdraw from the deal, which was championed by President Xi Jinping, saying it had brought no significant gains to Italy.\nThe 2019 accord expires in March 2024 and an Italian government source said Rome had sent Beijing a letter \"in recent days\" informing China that it would not be renewing the pact.\nThere was no immediate comment from China.\n\"We have every intention of maintaining excellent relations with China even if we are no longer part of the Belt and Road Initiative,\" a second government source said.\n\"Other G7 nations have closer relations with China than we do, despite the fact they were never in (the BRI),\" he added.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nItaly will assume the presidency of the G7 in 2024.\nMore than 100 countries have signed agreements with China to cooperate on BRI infrastructure and building projects since the scheme was launched in 2013. The then Italian Prime Minister Giuseppe Conte hoped for a trade bonanza when he signed up in 2019, but Chinese firms seemed to be the main beneficiaries.\nItalian exports to China totalled 16.4 billion euros ($17.7 billion) last year from 13 billion euros in 2019. By contrast, Chinese exports to Italy rose to 57.5 billion from 31.7 billion over the same period, according to Italian data.\nItaly's main euro zone trading partners France and Germany exported significantly more to China last year, despite not being part of the BRI, which is modelled on the old Silk Road that linked China to the West.\nLooking to maintain strategic ties, Foreign Minister Antonio Tajani visited Beijing in September and President Sergio Mattarella is due to visit China at some stage next year.\nMeloni herself has said she wants to go to Beijing, but no date has been fixed.\nDespite being part of the BRI, successive governments in Rome signalled their doubts about the pact by vetoing some proposed takeovers or limiting the sway of Chinese companies over their Italian counterparts.\nIn June, Meloni's cabinet curbed the influence of Chinese shareholder Sinochem on Italian tyremaker Pirelli, using \"golden power\" rules designed to protect strategic assets.\nMeloni, who heads a conservative coalition, has been keen to burnish her credentials as a committed pro-NATO leader and a government source said that she had assured U.S. President Joe Biden earlier this year that Italy would quit the BRI. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nThanks for sharing!",
        "date": "2023-12-06",
        "is_related": true,
        "title": "Italy quits Belt and Road Initiative, seeks to maintain ties with China",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Community of shared destiny",
                0
            ],
            [
                "Community of common destiny of mankind",
                0
            ],
            [
                "Asian Infrastructure Investment Bank",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ],
            [
                "China dream",
                0
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about Italy's decision to withdraw from the Belt and Road Initiative, including historical context, economic implications, and statements from government sources. It exceeds the word count for short news and offers more depth than a concise report, fitting the medium news classification."
    },
    {
        "url": "https://straitstimes.com/asia/putin-sees-chinas-one-belt-one-road-initiative-as-desire-to-cooperate-russian-agencies",
        "content": "tp -     Russia President Vladimir Putin said that he sees China's One Belt One Road (OBOR) initiative as a desire to cooperate on the global arena, Russian news agencies reported on Sunday.\n\"We see that some perceive it as an attempt by the People's  Republic of China to crush someone under itself, but we don't see this that way: we just see a desire for cooperation,\" Russia's news agency cited Putin as saying. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nRussia\nVladimir Putin\nChina\nThanks for sharing!",
        "date": "2023-10-15",
        "is_related": true,
        "title": "Putin Sees China's One Belt One Road Initiative as Desire for Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                1
            ],
            [
                "China's influence",
                1
            ]
        ],
        "article_type": "Short News",
        "article_type_reason": "The content is concise, providing a brief report on Putin's comments regarding China's One Belt One Road initiative, fitting within the 60-100 word range."
    },
    {
        "url": "https://straitstimes.com/asia/italys-belt-and-road-agreement-with-china",
        "content": "Italy has told China that it is quitting the Belt and Road Initiative (BRI), two government sources told Reuters on Wednesday, ending months of doubt over Rome's future in Beijing's ambitious infrastructure project.\nItaly signed a preliminary accord with China in March 2019 that made it the only Group of Seven (G7) country to join the BRI project, which was launched by Chinese President Xi Jinping in 2013.\nThe then Italian prime minister, Giuseppe Conte, hoped the deal would boost Italy's underperforming economy, but over the past four years it has produced little benefit.\nCritics had voiced concern it would enable China to gain control of sensitive technologies and infrastructure and Italy has since taken a number of steps to veto takeovers or limit the sway of Chinese companies over their Italian counterparts.\nINITIAL PREMISE\nThe two countries noted that they shared a common history, with Italy serving as the traditional landing place for the maritime section of the ancient Silk Route trading route linking Asia and western Europe.\nPRINCIPAL OBJECTIVES\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nChina and Italy committed to working together on strengthening their political relations and commercial ties, and promoting regional peace.\nPLANNED AREAS OF COOPERATION\n- Transport, logistics and infrastructure: Italy and China said they would work on projects such as roads, railways, bridges, civil aviation, ports, energy and telecommunications.\n- In the energy sector, State Grid Corporation of China has since 2014 owned a 35% stake in CDP Reti, a holding company that owns roughly a third of Italian power and gas grid operators Terna and Snam.\n- Removing obstacles to commerce and investment, promoting a partnership between their respective financial institutions.\n- Connectivity between people, developing a twinning network between cities and encouraging cultural, science, tourism and education exchanges.\n- Environmental cooperation, pursuing sustainable and ecological development. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nThanks for sharing!",
        "date": "2023-12-06",
        "is_related": true,
        "title": "Italy quits Belt and Road Initiative, ending months of doubt over Rome's future in China's ambitious infrastructure project",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                3
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides a detailed account of Italy's decision to quit the Belt and Road Initiative, including background information, historical context, and implications of the decision, while remaining concise and focused on the main points."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/xi-sends-clear-signal-that-china-s-belt-and-road-initiative-is-for-the-long-haul",
        "content": "BEIJING\n-\nWhile China’s Belt and Road Initiative (BRI) may have met with some bumps in its implementation over the past decade, President Xi Jinping has sent a clear signal that he intends to stay the course.\nSpeaking at\nthe third Belt and Road Forum\nin Beijing on Wednesday, Mr Xi said his signature foreign policy initiative has boosted the flow of goods, capital and technology, bringing benefits to the countries involved.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nXi Jinping\nThanks for sharing!",
        "date": "2023-10-18",
        "is_related": true,
        "title": "China's Belt and Road Initiative: Xi Jinping's Commitment to International Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                2
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                0
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ]
        ],
        "article_type": "Short News",
        "article_type_reason": "The content provides concise information about President Xi Jinping's remarks at the Belt and Road Forum, summarizing key points in a brief format without extensive detail or analysis."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/putin-sees-belt-and-road-initiative-as-china-s-desire-to-cooperate-on-global-issues",
        "content": "BEIJING\n–\nRussian President Vladimir Putin said that he sees China’s Belt and Road Initiative (BRI) as a desire to cooperate in the global arena, Russian and Chinese news agencies reported on Sunday.\n“We see that some perceive it as an attempt by the People’s Republic of China to crush someone under itself, but we don’t see this that way – we just see a desire for cooperation,” Russia’s RIA state news agency cited Mr Putin as saying.\n“In my opinion, the main advantage of the cooperation concept proposed by China is that within the framework of cooperation, no one imposes anything on others,” Mr Putin said in an interview with China Media\nGroup\n.\nChina’s unique feature in building relations with other countries today is that “no one imposes or forces anything on anyone. They only provide opportunities”, he was quoted by Chinese state television as saying in Moscow.\n“This is the difference between President Xi Jinping’s Belt and Road Initiative and other projects pursued by countries with a colonialist flavour,” Mr Putin was quoted as saying.\nHe also said the BRI was timely and is developing well, according to RIA.\nMr Putin is due to attend\nthe third Belt and Road Forum,\nwhich will be held in Beijing from\nTuesday to Wednesday\n.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nHe attended the two previous forums, in 2017 and 2019.\nThe BRI is a plan for global infrastructure and energy networks that China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nREUTERS\nMore on this Topic\nTaliban to join China's Belt and Road forum, elevating ties\nDespite Rome’s scepticism,&nbsp;China says Belt and Road cooperation with Italy ‘fruitful’\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-10-15",
        "is_related": true,
        "title": "Putin Sees China's Belt and Road Initiative as a Desire for Cooperation",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides a detailed account of Vladimir Putin's comments on China's Belt and Road Initiative, including quotes and context about the initiative and its implications. It exceeds the word count for short news and offers more depth than just a brief summary, fitting the medium news category."
    },
    {
        "url": "https://straitstimes.com/asia/china-says-90-countries-have-confirmed-attendance-for-belt-and-road-initiative",
        "content": "BEIJING - China said on Thursday that 90 countries have confirmed attendance for its Belt and Road Initiative conference being held in October.\nThe third Belt and Road Forum for International Cooperation will be held in Beijing in October, the foreign ministry has previously said, with 2023 marking the 10th anniversary of the Belt and Road Initiative.\nSeveral foreign leaders are expected to attend, including Serbian President Aleksandar Vucic and Argentine President Alberto Fernandez, state media reported.\nRussian President Vladimir Putin also has a scheduled visit to China in October when the country hosts the One Belt One Road forum, Mr Putin’s aide Yuri Ushakov said recently, according to Russia’s state news agency Tass.\n“We have received an invitation and plan to go to China,” Mr Ushakov said, according to a report from the Global Times.\nChina’s foreign ministry said the country has signed Belt and Road cooperation documents with more than 150 countries and over 30 international organisations, according to Xinhua.\n“Over the past decade, Belt and Road cooperation has achieved fruitful outcomes,” Chinese foreign ministry spokesman Wang Wenbin recently said at a press conference, adding that it has established more than 3,000 cooperation projects and galvanised nearly US$1 trillion (S$1.4 trillion) of investment, state media reported.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nCritics see the ambitious Belt and Road initiative – billed as recreating the ancient Silk Road to boost global trade infrastructure – as a tool for President Xi Jinping's China to spread its geopolitical and economic influence.\nDebate in the West over economic dependence on China has cast a shadow over longer-term trade and investment relations with Beijing. Italy, the sole Group of Seven nation in Belt and Road, said the decision by a previous government to join had been “atrocious”. REUTERS\nMore on this Topic\nChinese-funded railways bring tourists to SE Asia, but they also cause tensions\nChina’s BRI at 10: The journey continues, but has it outlived its purpose?\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nVladimir Putin\nThanks for sharing!",
        "date": "2023-09-07",
        "is_related": true,
        "title": "China's Belt and Road Initiative Conference to Host 90 Countries in October",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the upcoming Belt and Road Initiative conference, including the number of countries attending, notable leaders expected, and context about the initiative's history and criticisms. It exceeds the word count for short news and offers more depth than a concise report."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/china-to-host-belt-and-road-forum-in-beijing-oct-17-18",
        "content": "BEIJING\n–\nChina will host the third Belt and Road Forum in Beijing from\nnext Tuesday to Wednesday\n, the Chinese Foreign Ministry said on Wednesday,\na President Xi Jinping signature event that President Vladimir Putin is due to attend on a rare trip abroad\n.\nThe conference in Beijing on Oct 17 to Oct 18 marks the 10th anniversary of the Belt and Road Initiative (BRI) championed by Mr Xi,\nwith representatives from many developing countries, notably from Latin America and Africa, expected to attend.\nMr Putin attended the two previous forums, in 2017 and 2019, and the Kremlin said in September he had accepted an invitation to the forum and for talks with Mr Xi.\nThe Russian leader is not known to have gone abroad since the Hague-based International Criminal Court (ICC) issued a warrant for him in March over the deportation of children from Ukraine.\nMr Putin is expected to visit Kyrgyzstan on Thursday, before the Beijing meeting. Neither Kyrgyzstan nor China are members of the ICC, which was established to prosecute war crimes.\nThe BRI is a global infrastructure development strategy China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nBut critics see the plan – billed as recreating the ancient Silk Road to boost global trade infrastructure – as a tool for China to spread its geopolitical and economic influence.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nMr Putin, in a message to Mr Xi in October, said their talks would  deepen Russian-Chinese ties \"for the benefit of our friendly peoples, in interests of ensuring security and stability on the Eurasian continent and throughout the world\".\nChina had signed Belt and Road cooperation documents with more than 150 countries and more than 30 international organisations, the foreign ministry said.\nItaly, the only Group of Seven nation in Belt and Road, has publicly criticised joining the initiative, with its Foreign Minister Antonio Tajani recently saying trade between Italy and China had not improved since Rome joined four years ago.\nREUTERS\nMore on this Topic\nNo decision yet on quitting China’s Belt and Road: Italy PM Meloni\nChina says 90 countries have confirmed attendance for Belt and Road Initiative conference\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nTrade\nThanks for sharing!",
        "date": "2023-10-11",
        "is_related": true,
        "title": "China to Host Third Belt and Road Forum Amid Global Criticism",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the upcoming Belt and Road Forum, including dates, key attendees, and context about the initiative, while remaining concise and within the word limit of 80-200 words."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/chinas-xi-wants-to-deepen-bri-cooperation-with-sri-lanka-under-new-leader",
        "content": "Beijing\n–\nChinese President Xi Jinping said on Sept 23 he hoped to broaden cooperation with Sri Lanka under his Belt and Road Initiative (BRI), as he congratulated the island’s new leader Anura Kumara Dissanayake on his inauguration, state media reported.\nMr Dissanayake, a self-avowed Marxist, took his oath at the Presidential Secretariat in Colombo on Sept 23, vowing to restore public faith in politics.\nThe country is emerging from a years-long economic collapse blamed partly on struggling high-debt Chinese mega-projects coordinated through the BRI, a massive infrastructure project that is a central pillar of Mr Xi’s bid to expand his country’s clout overseas.\n“I attach great importance to the development of China-Sri Lanka relations, and am willing to work with Mr President to continue our traditional friendship (and) enhance mutual political trust,” Mr Xi said in a message to Mr Dissanayake, according to state broadcaster CCTV.\nMr Xi said he hoped bilateral cooperation under\nhis flagship\nBRI would “bear more fruit”, CCTV added.\nHe said Beijing would “promote the steady progress of sincere mutual assistance between China and Sri Lanka as well as our age-old strategic cooperative partnership, and create more benefits for the peoples of both countries”.\nWestern critics accuse China of using the BRI to enmesh developing nations in unsustainable debt to exert diplomatic leverage over them, or even seize their assets.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBut a chorus of leaders – as well as research by leading global think-tanks like London’s Chatham House – have refuted the “debt trap” theory.\nIn December 2017, unable to repay a huge Chinese loan, Sri Lanka\nhanded its Hambantota port\nin the south of the island to a Beijing company on a 99-year lease for US$1.12 billion (S$1.44 billion).\nAnd the country defaulted on its foreign borrowings in 2022 during\na crisis that caused months of food, fuel and medicine shortages.\nChina is the nation’s largest bilateral creditor, with its loans accounting for US$4.66 billion of the US$10.58 billion that Sri Lanka has borrowed from other countries.\nIn 2023, the International Monetary Fund – the international lender of last resort – approved\na US$2.9 billion bailout loan for Sri Lanka.\nBeijing also agreed to restructure its loans to the country.\nAnd in September, Sri Lanka secured a deal with international bondholders to finalise a prolonged debt restructuring.\nAFP\nMore on this Topic\nSri Lanka gets leftist president who vows to curb corruption, help the poor\nNew leftist President vows to ‘rewrite Sri Lankan history’\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nSri Lanka\nThanks for sharing!",
        "date": "2024-09-23",
        "is_related": true,
        "title": "Chinese President Xi Jinping hopes to broaden cooperation with Sri Lanka under Belt and Road Initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                1
            ]
        ],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides detailed information about the recent developments in China-Sri Lanka relations, including President Xi Jinping's statements, the economic context of Sri Lanka, and the implications of the Belt and Road Initiative. It discusses multiple perspectives, including criticisms of the BRI and the responses from global think-tanks, making it a comprehensive analysis rather than a simple news report."
    },
    {
        "url": "https://straitstimes.com/asia/nigeria-and-china-sign-economic-nuclear-energy-pact",
        "content": "LAGOS - Nigeria and China agreed to strengthen ties in the Belt and Road initiative, human resources development and nuclear energy after the countries' leaders met on Tuesday, a government spokesperson said.\nChina is Nigeria's biggest bilateral lender, with loans amounting to $5 billion at the end of March, according to figures from Nigeria's Debt Management office.\nBoth countries have maintained diplomatic ties over the past 50 years. They were strengthened in 2018 when China and Nigeria became partners in the Belt and Road Initiative.\nThe ensuing partnership has delivered massive infrastructure projects in Nigeria from a deep sea port to rail lines.\n\"This comprehensive strategic partnership should result in robust development, stability, and security in the West African sub-region,\" President Bola Tinubu said.\nNigeria's Tinubu joins a summit of 50 African nations in Beijing this week at the 2024 Summit of the Forum on China-Africa which the Chinese leader called an opportunity to consolidate China-Africa relations.\n\"China and Nigeria, as major developing countries, strengthening strategic coordination, will inject fresh impetus to China-Africa relations in the new era and spearhead common progress among Global South countries,\" President Xi said.\nTinubu toured the Huawei Research lab and secured a commitment from Huawei to establish a joint solar PV test lab in Nigeria.\nAnother Chinese firm also pledged to establish an assembly plant for electric tricycles and train Nigerians in technology and renewable energy development. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nNigeria\nEnergy\nHuman resources\nThanks for sharing!",
        "date": "2024-09-03",
        "is_related": true,
        "title": "Nigeria and China Strengthen Ties in Belt and Road Initiative and Other Areas",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            {
                "Belt and Road Initiative": 3
            },
            {
                "Community of shared future": 1
            },
            {
                "China's influence": 1
            },
            {
                "Global South": 1
            }
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the meeting between Nigeria and China, discussing their agreements on various initiatives, the historical context of their relationship, and specific commitments made by Chinese firms. It exceeds the word count for short news and offers more depth than a concise report."
    },
    {
        "url": "https://straitstimes.com/asia/taliban-says-plans-to-formally-join-chinas-belt-and-road-initiative",
        "content": "BEIJING – The Taliban administration wants to formally join Chinese President Xi Jinping’s huge Belt and Road infrastructure initiative and will send a technical team to China for talks, Afghanistan’s acting commerce minister said on Thursday.\nBeijing has sought to develop its ties with the Taliban-run government since it took over in 2021, even though no other foreign government has recognised the administration.\nIn September, China became the first country to appoint an ambassador to Kabul, with other nations retaining previous ambassadors or appointed heads of mission in a charge d’affaires capacity that does not involve formally presenting credentials to the government.\n“We requested China to allow us to be a part of the China-Pakistan Economic Corridor and Belt and Road Initiative (BRI)... (and) are discussing technical issues today,” acting commerce minister Haji Nooruddin Azizi told Reuters in an interview on Thursday, a day after the\nBelt and Road Forum ended in Beijing\n.\nThe Pakistan “economic corridor” refers to the huge flagship section of the BRI in Afghanistan’s neighbour.\nMr Azizi said the administration would also send a technical team to China to enable it to “better understand” the issues standing in the way of it joining the initiative, but did not elaborate on what was holding Afghanistan back.\nAfghanistan could offer China a wealth of coveted mineral resources. Several Chinese companies already operate there, including the Metallurgical Corp of China (MCC) which has held talks with the Taliban administration, as well as with the previous Western-backed government, over plans for a potentially huge copper mine.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\n“China, which invests all over the world, should also invest in Afghanistan... we have everything they need, such as lithium, copper and iron,” Mr Azizi said.\n“Afghanistan is now, more than ever, ready for investment.”\nAsked about the MCC talks, he said discussions had been delayed because the mine was near a historical site, but they were still ongoing.\n“The Chinese company has made a huge investment, and we support them,” he added.\nInvestors have said security remains a concern. The Islamic State militant group has targeted foreign embassies and a hotel popular with Chinese investors in Kabul.\nAsked about the security challenges, Mr Azizi said security was a priority for the Taliban-run government, adding that after 20 years of war – which ended when foreign forces withdrew and the Taliban took over – meant more parts of the country were safe.\n“It is now possible to travel to provinces where there is industry, agriculture and mines that one previously could not visit... security can be guaranteed,” he added.\nAfghanistan and 34 other countries agreed to work together on the digital economy and green development on the sidelines of the Belt and Road Forum on Wednesday. REUTERS\nMore on this Topic\nTaliban to join China's Belt and Road forum, elevating ties\nChina’s Xi warns against decoupling, lauds Belt and Road at forum\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nTaliban\nXi Jinping\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-10-19",
        "is_related": true,
        "title": "Taliban wants to join China's Belt and Road Initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the Taliban's intention to join China's Belt and Road Initiative, including quotes from Afghanistan's acting commerce minister and context about China's relationship with the Taliban. It exceeds 80 words and offers more than just concise information, making it suitable for the Medium News category."
    },
    {
        "url": "https://straitstimes.com/asia/italian-pm-tells-chinas-premier-of-plan-to-quit-belt-and-road-initiative-media",
        "content": "ROME -\nItaly has not yet decided whether to quit China’s Belt and Road investment plan, Italian Prime Minister Giorgia Meloni said on Sunday, but doing so would not damage bilateral relations.\n“We have yet to make a decision,” Ms Meloni told a press conference at the close of the G-20 summit in New Delhi, a day after meeting for talks with Chinese Premier Li Qiang.\nShould Rome decide to quit, it “would not compromise relations” with China, Ms Meloni said.\nItaly, seeking to minimise any backlash from the decision from Beijing, would as a replacement aim to revitalise\na strategic partnership agreement with China,\naimed at fostering economic cooperation, it first signed in 2004.\nItaly is the only G7 nation to sign up to the\nBelt and Road Initiative\n.\nIt is a\nglobal trade and infrastructure plan modelled on the old Silk Road that linked imperial China and the West.\nCritics say the Belt and Road plan is a Trojan horse to increase China’s influence.\nThe deal automatically renews in March 2024 unless Italy opts out by the end of this year.\nItalian politicians have questioned the value of the BRI agreement signed by a previous administration in 2019.\nThe deal has been\na source of friction with Western allies due to wariness about spreading Chinese influence.\nItaly is the only one of a group of leading developed democracies to have signed up.\nAn Italian media report said earlier that Ms Meloni had outlined Italy’s plan to pull out of the pact during a meeting with Mr Li.\nThe Italians told the Chinese that their decision had not been dictated by the United States, the report added, comments echoed by similar reports in other Italian newspapers.\nMore on this Topic\nItalian PM Meloni, China's Li Qiang discuss closer ties at G20 summit\nPartnership with China more important than Belt and Road, says Italy’s Foreign Minister\nItaly has the G-7 presidency next year and recasting its relationship with Beijing would placate its Western allies.\nMs Meloni and Mr Li held talks at the G-20 summit in New Delhi on Saturday to discuss deepening relations, Ms Meloni's office said in a statement.\n\"Italy and China share a Global Strategic Partnership whose 20th anniversary will recur next year and which will be the beacon for the advancement of friendship and cooperation ... in every area of common interest,\" the statement added.\nThe Italian PM is tipped to travel to Beijing for a state visit in the next few months, or at the start of next year, but would not be drawn on a possible date.\n“It makes more sense to go to China when we have more elements about our bilateral cooperation and how to develop it,” she said.\nMs Meloni’s meeting with Mr Li, their first face-to-face, came as a broad alliance of states at the G-20 unveiled ambitious plans to create a modern-day Spice Route.\nIt seeks to link Europe, the Middle East and India.\nThe signatories hope it will offer a counterbalance to lavish Chinese infrastructure spending.\nAFP, REUTERS\nMore on this Topic\nChina says willing to work with Italy to improve trade, investment\nChina says 90 countries have confirmed attendance for Belt and Road Initiative conference\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nGiorgia Meloni\nItaly\nInfrastructure\nChina\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-09-10",
        "is_related": true,
        "title": "Italy's Decision on China's Belt and Road Initiative Remains Uncertain",
        "is_title_contain_shared_future": true,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                3
            ],
            [
                "Community of shared future",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about Italy's position on the Belt and Road Initiative, including statements from Prime Minister Giorgia Meloni, the context of Italy's relationship with China, and implications for future cooperation. It exceeds 80 words and offers more than just concise information, making it suitable for the Medium News classification."
    },
    {
        "url": "https://straitstimes.com/life/arts/unusual-double-bill-of-puccini-s-gianni-schicchi-and-a-chinese-classic-about-growing-up",
        "content": "SINGAPORE –\nOpera buffs can look forward to an unusual double bill of Giacomo Puccini’s Gianni Schicchi and a light-hearted Chinese work, A Story Of Growing Up, at Singtel Waterfront Theatre on Dec 8 and 9.\nThe shows are presented by the China National Centre for the&nbsp;Performing Arts (NCPA) and the Asean-China Centre in&nbsp;collaboration with the Singapore Metropolitan Festival Orchestra, under the baton of Singapore Cultural Medallion recipient Yeh Tsung.&nbsp;\nThe productions mark the 10th&nbsp;anniversary of the Belt and Road initiative. The Chinese government introduced this global infrastructure development scheme in 2013 to invest in countries and international organisations.\nMs Iris Lanfen Wei, director of the NCPA’s department of production and artistic administration, tells The Straits Times: “NCPA has always emphasised both Chinese original creations and world classics in its repertoire production.\n“On the one hand, it develops and promotes Chinese culture, especially traditional culture. On the other hand, it also actively introduces world classics.”\nGianni Schicchi is the only opera buffa composed by opera&nbsp;master Puccini.&nbsp;\nThe comic opera in one act, about a witty fight for a family’s fortune, was an immediate hit when it was first performed&nbsp;at New York’s Metropolitan Opera&nbsp;in December 1918.&nbsp;\nIt garnered rave reviews&nbsp;and the score has been praised for its creativity and imagination.&nbsp;The aria,&nbsp;O Mio Babbino Caro (“O My Dear Daddy”), is one of the most famous lyric soprano arias in opera.&nbsp;\nNCPA first performed the work&nbsp;in China in 2021, following its productions of other famous works such as Turandot, Tosca and La Fanciulla del West by the same composer.&nbsp;\nA Story Of Growing Up is based on a 1956 fairy tale by Ren Rongrong, a famous Chinese&nbsp;translator and writer of children’s literature.\nThe production with bright and breezy music tells the story of two boys with bad habits –&nbsp;Meitounao (“Fool”) and Bugaoxing (“Unhappy”). After&nbsp;a dreamlike trip through time, they finally understand that their foibles could result in terrible mistakes.\nThough different in culture and background, both shows&nbsp;are full of humour and vitality.\nThe NCPA, inaugurated in December 2007, is a state-level art institution in Beijing whose facilities include an opera house, a concert hall, a theatre and an art museum.&nbsp;\nSince NCPA produced its first opera Turandot in 2008, it has put on more than 100 productions, covering opera, drama, dance drama, Peking opera and other\ngenres.&nbsp;\n&nbsp;\nMs Wei says of the double-bill programme for Singapore: “With his distinctive personal style and highly mature opera-writing techniques, Puccini presented a portrait of Italian society.&nbsp;As for the children’s opera,&nbsp;A Story\nOf\nGrowing Up, it has not only become a classic in the history of children’s literature, but also a common childhood memory for generations.\n“We hope that these two representative works can leave a deep impression on Singaporean audiences.”\nMaestro\nYeh\n, who is also Singapore Chinese Orchestra’s conductor emeritus, says: “Though these two operas are shorter in length and lighter in style, they show important aspects of human nature with a good sense of humour.” &nbsp;\nA Story Of Growing Up is a lively and witty production adapted from a fairy tale of the same title.\nPHOTO: CHINA NATIONAL CENTRE FOR THE PERFORMING ARTS\nBook It/Puccini Opera Gianni Schicchi\nWhere:\n&nbsp;Singtel Waterfront Theatre\n,&nbsp;Esplanade – Theatres on the Bay, 8 Raffles Avenue\nWhen:\nDec 8, 7.30pm\nAdmission:\n$58, $78\nInfo:\nThe performance\nis in Italian, with surtitles in English and Chinese. Go to\nwww.sistic.com.sg/events/pu1223\nA Story Of Growing Up\nWhere:\nSingtel Waterfront\nTheatre\nWhen:\nDec 9, 7.30pm\nAdmission:\n$58 and $78\nInfo:\nThe performance is in Mandarin,\nwith surtitles in English and Chinese. Go to\nwww.sistic.com.sg/events/child1223\nMore on this Topic\nEnter a golden chamber, play Singapore mahjong at youth festival Remix 2K23\nArts Picks: Mint museum’s new screening room, The Opera People, Singapore ceramicists on show\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nPerforming arts\nSingapore-China ties\nEsplanade\nOpera\nThanks for sharing!",
        "date": "2023-11-24",
        "is_related": true,
        "title": "Opera double bill featuring Puccini and a Chinese work to celebrate Belt and Road initiative",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                2
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the upcoming opera performances, including descriptions of the works, quotes from relevant individuals, and context about the significance of the productions. It exceeds the word count for short news and offers more depth than a simple announcement."
    },
    {
        "url": "https://straitstimes.com/world/russias-top-diplomat-lavrov-in-china-ahead-of-putin-visit",
        "content": "Beijing\n–\nRussia’s top diplomat Sergei Lavrov arrived in Beijing on Monday ahead of\nan expected visit by President Vladimir Putin to China,\nfor a gathering of representatives of 130 countries that will be overshadowed by the Israel-Gaza war.\nThis will be Mr Putin’s first trip to a major global power since\nthe Ukraine invasion.\nThe Foreign Ministry announced on social media platform X, formerly Twitter, that Mr Lavrov was in the Chinese capital as part of a Russian delegation.\nBeijing is hosting representatives of 130 countries from Tuesday to Wednesday to mark a decade of its Belt and Road Initiative (BRI) – a key geopolitical project of President Xi Jinping to extend China’s global reach.\nBut all eyes will be on Mr Putin, who in September told Beijing’s Foreign Minister Wang Yi in Saint Petersburg he had “gladly accepted” Mr Xi’s invitation to visit China for the BRI talking shop.\nThe Russian leader’s strategic dependence on China has only grown since his invasion of neighbouring Ukraine thrust his country into international isolation.\nMr Putin last week voiced concern at the “catastrophic increase” in the number of\ncivilian victims in Israel and the Gaza Strip.\nThe Kremlin ambassador to the United Nations has called for a “humanitarian ceasefire” in the Gaza Strip and Israel, while blaming the United States for the ongoing conflict.\nThis year, trade between China and Russia has soared to levels not seen since the beginning of Moscow’s war in Ukraine, with Chinese imports of Russian oil offering Moscow a critical lifeline as international sanctions bite.\nChina has refused to condemn the war in an effort to position itself as a neutral party, while at the same time offering Moscow vital diplomatic and financial support.\nAt the heart of the deepening partnership is the relationship between Mr Xi and Mr Putin, who have described each other as “dear friends”.\nBut their alliance is also forged by a symbiotic necessity, each seeing the other as a necessary bulwark in their shared struggle against Western dominance.\nIn an interview with Chinese state broadcaster CGTN ahead of his visit this week, Mr Putin hailed ties with Beijing and the “mutual benefits” of the BRI.\n“President Putin pointed out that a multipolar world is taking shape, and the concepts and initiatives put forward by President Xi Jinping are highly relevant and significant,” CGTN reported.\n“He stated that President Xi Jinping is a well-recognized leader on the world stage and is a true world leader,” it said.\nMore on this Topic\nPutin sees Belt and Road Initiative as China’s desire to cooperate on global issues: Reports\nDespite Rome’s scepticism,&nbsp;China says Belt and Road cooperation with Italy ‘fruitful’\nMr Putin also reportedly “shared pleasant memories between President Xi and him, and hoped the tradition would continue when they meet in China in the future”.\nA number of leaders have already arrived in Beijing ahead of the summit, according to China’s state news agency Xinhua.\nAmong them are Hungarian Prime Minister Viktor Orban, Chilean President Gabriel Boric, Kenyan President William Ruto and Ethiopian Prime Minister Abiy Ahmed.\nAFP\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nRussia\nDiplomacy\nThanks for sharing!",
        "date": "2023-10-16",
        "is_related": true,
        "title": "Russia’s Lavrov in Beijing ahead of Putin’s visit for Belt and Road Initiative summit",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ],
            [
                "mutual benefits",
                2
            ],
            [
                "global issues",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about Sergei Lavrov's visit to Beijing, the context of President Putin's upcoming trip, and the geopolitical implications of the events surrounding the Israel-Gaza war and the Belt and Road Initiative. It contains multiple perspectives and relevant background information, fitting within the 80-200 word range for medium news."
    },
    {
        "url": "https://straitstimes.com/asia/putin-visits-dear-friend-xi-in-show-of-no-limits-partnership",
        "content": "BEIJING\n-\nRussian President Vladimir Putin arrived in Beijing on Tuesday to meet his “dear friend” Xi Jinping and bolster their relationship at a summit overshadowed by\nthe Israel-Hamas war.\nChina this week welcomed representatives of 130 countries to a forum on President Xi’s vast trade and infrastructure Belt and Road Initiative (BRI).\nAt the top of the guest list is Mr Putin, who is on his first trip to a major global power since\nMoscow’s Ukraine invasion\nthrew his regime into international isolation.\nHe is due to hold talks with Mr Xi on the sidelines of the forum on Wednesday, the Kremlin said, adding: “During the talks, special attention will be paid to international and regional issues.”\nWestern countries, led by the United States, have rallied to Israel’s side since Oct 7, when\nHamas launched a deadly attack on Israel.\nThe US has asked China to use its influence to help de-escalate the war, which has already seen over\na million people in the blockaded Gaza Strip flee\nthe relentless bombardment that Israel launched in retaliation for the Hamas attack.\nChina brokered an entente between key Hamas backer Iran and its regional foe Saudi Arabia earlier in 2023.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBeijing will send its Middle East envoy Zhai Jun to the volatile region this week. No details have been given about where or when exactly Mr Zhai would travel.\nChina’s state broadcaster CCTV has said he will push for a ceasefire and peace talks.\nRussia, which has traditionally maintained good relations with both Israeli and Palestinian authorities, has called for an “immediate ceasefire” in the conflict.\nIn Beijing, Mr Putin is on a mission to strengthen the already strong bond with his communist neighbour, though experts say Moscow is increasingly the junior partner in the relationship.\nChina is Russia’s largest trading partner, with exchange between the nations reaching a record US$190 billion (S$260  billion) in 2022, Beijing Customs data shows.\nBeijing has drawn criticism from Western countries for its stance on the Ukraine war, on which China insists it is neutral even as it refuses to criticise Moscow’s invasion.\nDuring Mr Xi’s state visit to Moscow in March, Mr Putin hailed the “truly unlimited possibilities” their countries’ partnership offered.\nBut while the BRI forum offers a fresh opportunity for Mr Putin and Mr Xi to showcase their alliance, experts do not expect any new major deals to be announced.\n“Russia is aware that China doesn’t want to sign any high publicity deals,” Mr Alexander Gabuev, director of the Carnegie Russia Eurasia Centre, told AFP. “China holds all of the cards.”\nFriends reunited\nMr Xi kicked off the summit on Tuesday with talks with Chilean and Kazakhstan presidents Gabriel Boric and Kassym-Jomart Tokayev, Chinese state media reported.\nHe then met Hungary’s Prime Minister Viktor Orban, describing the conservative leader as a “friend” and thanking him for his support for the BRI, state news agency Xinhua said.\nHungary’s Prime Minister Viktor Orban (left) and Chinese President Xi Jinping before their bilateral meeting in the Great Hall of the People in Beijing on Oct 17.\nPHOTO: EPA-EFE\nM\nr Xi also met the prime ministers of Papua New Guinea and Ethiopia.\nMr Putin had a meeting of his own with Mr Orban, during which he told the Hungarian Prime Minister he was satisfied to still maintain relations with some European countries, “despite... current geopolitical conditions”.\nMr Orban’s meeting with the Russian leader is likely to prompt a backlash from his European Union and North Atlantic Treaty Organisation allies as well as Ukraine, which have sought to isolate Mr Putin since Russia invaded Ukraine in 2022.\nHungary’s Prime Minister Viktor Orban (left) with Russian President Vladimir Putin on the sidelines of the Third Belt and Road Forum in Beijing, on Oct 17.\nPHOTO: AFP\nMr Putin also met Vietnam’s President Vo Van Thong, the Kremlin said.\nChina and Russia’s top diplomats were singing from the same song sheet when they met in Beijing on Monday.\nRussian Foreign Minister Sergei Lavrov thanked China for inviting Mr Putin as the summit’s “chief guest”, according to a readout from Moscow. It later said Mr Lavrov would head to North Korea after Beijing.\nMr Putin and Mr Xi will discuss the countries’ ties “in their entirety” when they meet this week, Mr Lavrov told his Chinese counterpart Wang Yi.\nThe two nations share a symbiotic alliance. China appreciates Russia’s role as a bulwark against the West, while Moscow is increasingly reliant on Beijing’s largesse in trade and geopolitical backing.\n“Since Moscow embarked on its all-out invasion of Ukraine, it has been put in a position where it is unprecedentedly dependent on China,” Assistant Professor Bjorn Alexander Duben of China’s Jilin University told AFP.\nAt the heart of the deepening partnership is the relationship between Mr Xi and Mr Putin, who have described each other as “dear friends”.\n“President Xi Jinping calls me his friend, and I call him my friend, too,” Mr Putin told Chinese state broadcaster CGTN ahead of his visit, according to a Kremlin readout.\nMore on this Topic\nChinese President Xi’s $1.3t ‘project of the century’ faces uncertain future\nIndonesia to seek China’s help to develop renewables at Belt and Road Forum\nSecond known trip since March\nThe visit to Beijing is Mr Putin’s second known trip abroad since the Hague-based\nInternational Criminal Court (ICC) issued an arrest warrant for him in March\n.\nIt is also the Kremlin chief’s first official trip outside the former Soviet Union in 2023,\nafter visiting Kyrgyzstan\n, a former Soviet republic, earlier in October.\nThe ICC, which accused Mr Putin of illegally deporting children from Ukraine, obliges the court’s 123 member states to arrest the Russian leader and transfer him to The Hague for trial if he sets foot on their territory.\nNeither Kyrgyzstan nor China is a member of the ICC, established to prosecute war crimes.\nMr Xi last saw his “dear friend” in Moscow just days after the ICC warrant was issued. At the time, Mr Xi invited Mr Putin to attend the third Belt and Road forum in Beijing.\nMr Putin last visited China for the Beijing Winter Olympics in February 2022, when Russia and China declared a “no-limits” partnership days before the Russian president sent tens of thousands of troops into Ukraine.\nIt would be Mr Putin’s third attendance of the Belt and Road Forum, which runs until Wednesday. He attended the two previous forums in 2017 and 2019.\nBelt and Road\nMr Xi launched the BRI a decade ago in hopes that it would build global infrastructure and energy networks connecting Asia with Africa and Europe through overland and maritime routes.\nMr Putin has praised the initiative\n, saying it is a platform for international cooperation, where “no one imposes anything on others”.\nSince the start of the Ukrainian conflict, Russia has cemented its energy ties with China in a sign of their economic cooperation.\nRussia exports around 2 million barrels of oil a day to China, more than a third of its total crude oil exports. Moscow aims to build a second natural gas pipeline to China.\nWhile the heads of Russia’s oil and gas giants Rosneft and Gazprom will be part of Mr Putin’s travelling delegation, no new deals in energy can be expected.\nThe trip is not a “full-fledged bilateral” visit, but one made on the sidelines of an international conference, according to the Kremlin.\nAFP, REUTERS, BLOOMBERG\nMore on this Topic\nPutin sees Belt and Road Initiative as China’s desire to cooperate on global issues: Reports\nRussia-China ties at ‘unprecedented historical level’, Putin says at meeting with Deputy Premier Zhang\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nBelt and Road Initiative\nChina\nRussia\nThanks for sharing!",
        "date": "2023-10-17",
        "is_related": true,
        "title": "Putin in Beijing to bolster ties with Xi at Belt and Road Forum",
        "is_title_contain_shared_future": true,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                2
            ]
        ],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides a detailed analysis of the meeting between Vladimir Putin and Xi Jinping, discussing the geopolitical context, the significance of their relationship, and the implications of the ongoing Israel-Hamas conflict. It includes multiple perspectives on the Russia-China alliance and the broader international dynamics at play, making it more comprehensive than a standard news report."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/s-pore-officials-stress-supply-chain-resilience-green-financing-at-beijing-forum",
        "content": "BEIJING\n–\nSingapore politicians reiterated the Republic’s\nsupport for China’s Belt and Road Initiative (BRI) at\na high-level forum in Beijing,\nwhile also stressing the\nneed to strengthen global supply chains and bolster international cooperation on green financing.\nSpeaking at the Third Belt and Road Forum for International Cooperation on Wednesday, Acting Transport Minister Chee Hong Tat said the Covid-19 pandemic has underscored the importance of supply chain resilience.\nAs a trading nation, air hub and seaport, Singapore believes the way to achieve resilience is by diversifying trade links and enhancing interdependence and mutually beneficial cooperation, Mr Chee said,\nat a session titled Connectivity In An Open Global Economy.\nThis\nis why Singapore has been an early and strong supporter of the BRI, he said at the forum, which was held on Tuesday and Wednesday to mark 10 years since the initiative was launched to promote infrastructure and economic development\nwith other countries\n, as well as strengthen cultural ties.\nThe values that underpin the initiative are in line with Singapore’s objectives of developing an open, multilateral and rules-based system to strengthen global supply chains, and creating win-win outcomes for all stakeholders, Mr Chee said.\nSince 2013, China has worked with more than 150 countries on the BRI, which is seen as Chinese President Xi Jinping’s signature foreign policy.\nMore than 3,000 cooperation projects have been formed, including roads, ports and railways, with investments reaching nearly\nUS$1 trillion (S$1.37 trillion).\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nSingapore supports the BRI through the Chongqing Connectivity Initiative, an inter-governmental project that launched in 2015. The aim is to connect western China to South-east Asia and the rest of the world, with Singapore’s involvement.\nMr Chee said that besides being resilient, supply chains and connectivity options must also be environmentally sustainable.\n“There is scope for greater international collaboration, including through the BRI, to speed up technological advancement, develop supporting infrastructure to scale up adoption and invest in (the)\ntraining of workers to prepare them for the energy transition.”\nSenior Minister of State for Sustainability and the Environment Amy Khor said there was great potential for the BRI to build a greener Silk Road by championing environmental protection and climate action alongside economic, social and cultural development.\nThe next area for collaboration is in green finance, she said\nat a session titled New Outlook On Green Silk Road\n, adding that working in this area is a natural extension for Singapore, given its status as a global trading hub and reputable financial centre.\nMore must be done to reduce the barriers of capital flow to facilitate investments in this area. She noted that the Monetary Authority of Singapore and the People’s Bank of China\nannounced a taskforce in April\nto deepen cooperation in green and transition finance,\nas well as facilitate public-private sector partnerships.\n“This will help to galvanise collaboration on concrete initiatives that will catalyse capital flows to support a credible and inclusive transition to a low carbon future,” said Ms Khor.&nbsp;\nSingapore will do its part to contribute to sustainable development under the BRI, she added at a Wednesday session, Green Silk Road For Harmony With Nature.\n“As we continue our cooperation through the BRI, we can support climate mitigation and adaptation efforts alongside economic opportunities, while being mindful that our efforts to address climate change do not inadvertently create negative environmental impacts,” she said.\nMore on this Topic\nChina’s Xi warns against decoupling, lauds Belt and Road at forum\nIndonesia to seek China’s help to develop renewables at Belt and Road Forum\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's WhatsApp Channel\n&nbsp;\nand get the latest news and must-reads.\nSingapore\nChina\nBelt and Road Initiative\nSupply chains\nThanks for sharing!",
        "date": "2023-10-18",
        "is_related": true,
        "title": "Singapore politicians reiterate support for China's Belt and Road Initiative at high-level forum",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "Community of shared future",
                1
            ],
            [
                "China's influence",
                1
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about Singapore's support for China's Belt and Road Initiative, including quotes from officials and insights into the implications for global supply chains and green financing. It exceeds 80 words and offers more context than a short news piece, but does not delve into extensive analysis or multiple perspectives typical of in-depth news."
    },
    {
        "url": "https://straitstimes.com/asia/chinas-xi-jinping-commits-to-more-investments-in-nigeria",
        "content": "ABUJA  -     China's President Xi Jinping pledged on Thursday for his country to increase investments in Nigeria's power generation sector and its digital economy, the Nigerian vice president's office said in the wake of a Belt And Road Initiative forum in Beijing.\nNigeria's National Agency for Science and Engineering Infrastructure (NASENI) and three Chinese partners signed contracts for new projects valued at $2 billion, Vice President Kashim Shettima's office said.\nIt added that another $4 billion worth of letters of intent was received for new projects and investments in different sectors of the economy.\nNigeria is seeking to attract investments to boost sluggish growth in Africa's biggest economy, which is saddled with mounting debt, high inflation and unemployment.\nThe agreements signed include vehicle assembly projects, solar products, vehicle design and production, drone technology transfer, clean energy utilisation and the development of an industrial park.\nNigeria also signed contracts with China Harbour Engineering Company for the construction of the Lekki Blue Seaport in Lagos.\nShettima met Xi, who asked for the protection of Chinese workers in Nigeria, according to the vice president's office.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nChina had committed to rail projects in Nigeria in the past and to a seaport in Bonny Island in the Niger Delta. But the projects are still waiting for loan disbursements after securing approvals from China Exim Bank and Nigeria's parliament.\nAt the Belt And Road Initiative Forum, China also committed to refinancing the completion of two rail projects that stalled due to a cut in China's funding commitments. China had earlier agreed to provide 85% of the financing for the rail projects. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nXi Jinping\nNigeria\nThanks for sharing!",
        "date": "2023-10-20",
        "is_related": true,
        "title": "China's President Xi Jinping pledges to increase investments in Nigeria's power generation sector and digital economy",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            {
                "Belt and Road Initiative": 2
            },
            {
                "Community of shared future": 1
            },
            {
                "China's influence": 1
            }
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about China's investment commitments in Nigeria, including specific project values and sectors, while remaining concise and informative, fitting within the 80-200 word range."
    },
    {
        "url": "https://straitstimes.com/asia/putin-and-xi-to-meet-in-beijing-in-october-russia-says",
        "content": "MOSCOW – Russia President Vladimir Putin will meet China’s Xi Jinping for talks in Beijing in October, Moscow said on Tuesday, his first known trip abroad since an arrest warrant was issued against him over the deportation of children from Ukraine.\nMr Nikolai Patrushev, a close Putin ally and the secretary of Russia’s Security Council, said Russia and China should deepen cooperation in the face of the West’s attempt to contain them both.\nHe was quoted by the Interfax news agency as saying that the talks in Beijing would be “thorough”, at a meeting in Moscow with China’s top diplomat, Wang Yi.\nMr Putin will attend the third Belt and Road Forum after an invitation by Mr Xi during a high-profile visit to Moscow in March.\nDays before that visit, the International Criminal Court (ICC) issued a warrant for Mr Putin’s arrest on suspicion of illegally deporting hundreds of children or more from Ukraine.\nMoscow denies the allegations and the Kremlin said the warrant was evidence of the West’s hostility to Russia, which opened a criminal case against the ICC prosecutor and the judges who issued the warrant.\nRussia’s full-scale invasion of Ukraine early last year has triggered one of the deadliest European conflicts since World War Two and the biggest confrontation between Moscow and the West since the 1962 Cuban Missile Crisis.\nMr Putin has pivoted towards China, and Mr Xi has stood by him.\nChinese-Russian trade has soared since the invasion, and Russia has sold Asian powers including China greater volumes of the oil it can no longer sell to the West because of sanctions.\nMr Putin last visited Beijing in February 2022, days before the invasion, where he and Mr Xi announced a “no limits” partnership. Moscow says this does not mean a military alliance, however.\nShared outlook\nBoth leaders share a broad world view, which sees the West as decadent and in decline just as China challenges US supremacy in everything from technology to espionage and military power.\nTrade between Russia and China soared 30 per cent in the first half of this year and will rise to more than US$200 billion (S$272 billion) in 2023, Russian Economy Minister Maxim Reshetnikov said on a visit to China.\n“We are actively developing investments, including in our large gas and petrochemical projects, where we actively use Chinese technologies,” Mr Reshetnikov said.\n“We are strongly interested in transforming technological cooperation into investment cooperation, so that Chinese companies actively enter into these projects, invest in capital, and lend money, because the projects are capital-intensive and not all of them can be fully provided for by the Russian financial system.”\nThe United States sees China as its gravest long-term “strategic competitor” and Russia as an “acute threat”.\nChina has refrained from condemning Russia’s operation against Ukraine or calling it an invasion, in line with the Kremlin, which casts the war as a “special military operation”.\nEarlier this year, CIA Director William Burns said Russia was becoming more and more dependent on China and was even at risk of becoming its “economic colony” in time. REUTERS\nMore on this Topic\nChina’s Wang Yi visits Russia ahead of possible Xi-Putin meeting\nRussia-China ties at ‘unprecedented historical level’, Putin says at meeting with Deputy Premier Zhang\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nXi Jinping\nChina\nRussia\nBelt and Road Initiative\nThanks for sharing!",
        "date": "2023-09-19",
        "is_related": true,
        "title": "Putin to meet Xi in Beijing amid deepening Russia-China ties",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [
            {
                "Belt and Road Initiative": 2
            },
            {
                "China's influence": 0
            },
            {
                "China's soft power": 0
            },
            {
                "Community of shared future": 0
            },
            {
                "Community of common destiny": 0
            },
            {
                "Global Development Initiative": 0
            },
            {
                "Global Security Initiative": 0
            },
            {
                "Global Governance Initiative": 0
            },
            {
                "Global Civilization Initiative": 0
            }
        ],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides detailed information about the upcoming meeting between Putin and Xi, the context of their relationship, the implications of the ICC warrant, and the broader geopolitical landscape. It includes multiple perspectives on the Russia-China partnership and its significance, making it more than just a brief news report."
    },
    {
        "url": "https://straitstimes.com/asia/pakistan-pm-sharif-calls-for-expansion-of-chinas-belt-and-road-initiative",
        "content": "ISLAMABAD – A China-led 10-state regional group criticised what it called protectionist trade measures on\nOct 16\n, part of an intensifying standoff between Beijing and Western countries over tariffs on Chinese products.\nThe Shanghai Cooperation Organisation (SCO), an Eurasian security and political group, also hit out at “unilateral sanctions” as member states Iran and Russia face curbs on trade.\nThe criticism came in a joint statement, following a heads of government meeting of the SCO in Islamabad, signed by 10 countries, including China, Russia, Iran, India and host Pakistan.\nThe statement said the 1\n0 member states\n“consider it important to continue joint efforts to counter protectionist trade measures” that are contrary to World Trade Organisation rules.\nThe United States and Canada have increased tariffs&nbsp;on Chinese products such as electric vehicles, aluminium and steel, and the European Union is set to follow suit. Beijing has termed the moves discriminatory, and responded with similar actions as the standoff intensifies.\nThe SCO also said that “unilateral application of sanctions” is against international law and has an impact on third countries.\nRussia and Iran, which\nface sanctions from the West, possess some of the world’s largest energy resources. But sanctions have meant that smaller countries have shied away from trade with the two SCO member states, even as larger more influential economies, such as China and India, continue to purchase energy from them.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nEnergy-starved Pakistan does not import gas or fuel from neighbouring Iran despite its cost-effectiveness, and a gas pipeline between the two nations has stalled due to Islamabad fearing US sanctions.\nEarlier at the meeting, Pakistan’s Prime Minister Shehbaz Sharif called for the expansion of China’s Belt and Road Initiative (BRI).&nbsp;&nbsp;&nbsp;&nbsp;\n“Flagship projects like the Belt and Road Initiative of President Xi Jinping... should be expanded focusing on developing road, rail and digital infrastructure that enhances integration and cooperation across&nbsp;our&nbsp;region,” he said in his speech as chair of the meeting.\nThe BRI is a\nUS$1 trillion (S$1.3 trillion)\nplan for global infrastructure and energy networks that China launched a decade ago to connect Asia with Africa and Europe through land and maritime routes.\nMore than 150 countries, including Russia, have signed up to participate in it.\nBeijing’s rivals see the BRI as a tool for China to spread its geopolitical and economic influence.\nWestern countries, under the G7 platform, last year announced a US$600 billion rival connectivity infrastructure development plan.\nThe\nChina-Pakistan Economic Corridor is a part of the BRI\nand has seen Beijing pump in billions of dollars into the South Asian country for road networks, a strategic port and an airport. REUTERS\nMore on this Topic\nPakistan to increase security for Chinese projects as Beijing calls for urgent steps\nChina sanctions US firms over arms sales to Taiwan\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nTrade\nShanghai Cooperation Organisation\nChina\nEmbargoes and economic sanctions\nThanks for sharing!",
        "date": "2024-10-16",
        "is_related": true,
        "title": "China-led regional group criticises protectionist trade measures amid standoff with West",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": [
            [
                "Belt and Road Initiative",
                3
            ],
            [
                "China's influence",
                1
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ]
        ],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides a detailed analysis of the recent meeting of the Shanghai Cooperation Organisation (SCO), discussing the criticism of protectionist trade measures, the implications of unilateral sanctions, and the geopolitical context surrounding the Belt and Road Initiative. It includes multiple perspectives on the impact of these trade measures and sanctions on member states, making it more comprehensive than a standard news report."
    },
    {
        "url": "https://straitstimes.com/asia/east-asia/china-issues-white-paper-on-global-community-of-shared-future-presses-on-with-green-bri-projects",
        "content": "BEIJING\n-\nChina on Tuesday unveiled its blueprint for a better world, raised by President Xi Jinping in 2013, through a policy paper on building a global community of shared future.\nBeijing also said it will continue to push for\ngreen development in Belt and Road Initiative (BRI) projects,\nrejecting claims that it has outsourced its environmental pollution,\na senior official from the country’s top economic planner\nsaid at a press conference on the wide-ranging policy paper about China’s global vision.\nThe White Paper titled “A Global Community of Shared Future: China’s Proposals and Actions” comes a decade after the vision was first proposed by Mr Xi, and has been presented as his alternative to the current Western-led world order, with an emphasis on what it calls Chinese-style diplomacy and various global initiatives.\nThis year\nalso\nmarks the 10th anniversary of the BRI, and China will host the third Belt and Road Forum for International Cooperation&nbsp;in\nOctober\n, with leaders and representatives from some 130 countries set to attend,\nincluding Russian President Vladimir Putin.\nBy July 2023, more than three-quarters of countries in the world and over 30 international organisations had signed agreements on Belt and Road cooperation with China, the White Paper said.\nIssued by the State Council Information Office, the White Paper said the vision rises above the exclusive rules of bloc politics, the notion of “might makes right” and the “universal values” defined by a handful of Western countries.&nbsp;\nChina has contributed to building a global community of shared future with actions including promoting high-quality Belt and Road cooperation, state news agency Xinhua said on Tuesday.&nbsp;\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nAt the press conference, in a rare appearance beyond his usual annual press conference in March, Foreign Minister Wang Yi said that by putting forward the creative idea, President Xi has shown “the correct path for the world”, building a strong consensus for international cooperation.\nChina has also proposed solutions to major global challenges in fields such as health, climate change and cyber security, Mr Wang added.&nbsp;\nHe said Beijing was willing to play a “constructive” role in the success of the Asia-Pacific Economic Cooperation (Apec) summit in November in San Francisco.\nIt paves the way for a possible meeting between Mr Xi and US President Joe Biden – both presidents last met on the sidelines of the Group of 20 (G-20) leaders’ summit&nbsp;in November\n2022\nin Bali.\nMr Xi did not attend the G-20 summit in India earlier in September, missing an opportunity to meet Mr Biden, and prompting the US to say China was “giving up” on the G-20 and building an alternative world order.\n“Of course, we and all parties also hope that the United States will realise its responsibilities as a host, show due openness, fairness, tolerance and responsibility, and create better conditions for the smooth holding of the meeting,” Mr Wang said, referring to the Apec summit.\nMore on this Topic\nChina Vice-President says country committed to opening itself wider to the world\nChina’s foreign policy is viewed negatively, but its investments are welcome: Pew report\nEarlier on Tuesday, Hong Kong Chief Executive John Lee said he had\nyet to receive any invitation to the November meeting.\nIt follows US media reports in July that he had been barred from the meetings after being sanctioned by Washington for what it calls his role in cracking down on civil liberties in the Asian financial hub.\nMr Wang repeated a frequent Chinese warning that China opposes “wanton expansion of military alliances” and the squeezing of the security space of other countries.\nBeijing has been critical of Washington’s continued attempts to increase military cooperation in the Indo-Pacific region, including the Quad and the Aukus groupings. It particularly disagrees with bases that are being built by the US in the north of the Philippines.\nDialogue between China and the US has been gradually resuming despite continued tensions, with several high-level\nvisits to Beijing in recent months by top US officials,\nincluding Secretary of State Antony Blinken,\nTreasury Secretary Janet Yellen and Secretary of Commerce Gina Raimondo.\nMeanwhile, not all is rosy with China’s BRI, which has been criticised for causing environmental destruction in project areas, including building coal-fired power plants overseas despite a national commitment domestically to reach peak carbon output by 2030, and to be carbon-neutral by 2060.\nEarlier in 2023, a report in The Jakarta Post said the Batang Toru hydropower project, which is 70 per cent owned by Chinese-owned State Development and Investment Corporation’s subsidiary SDIC Power, had encroached on the habitat of the endangered Tapanuli orangutan, forcing them to intrude on nearby farms and villages.\n“The joint construction of the ‘Belt and Road’ projects is carried out based on\nthe principle of\nextensive consultation, joint construction and shared benefits,” Mr Cong Liang, deputy director of the National Development and Reform Commission (NDRC), said in response to a question from The Straits Times at the press conference.\n“Whether the development is green or not, I think the (partner country) knows best, the local people have the most say, and facts are always more convincing than words.”\nMore on this Topic\nAs America’s influence in Asia wanes, Asian economies are integrating\nChinese-funded railways bring tourists to SE Asia, but they also cause tensions\nIt is “not worth refuting” the voices that slander the Green Silk Road – an initiative to make BRI projects more ecologically sustainable – and those who attempt to smear and interfere with joint projects will not succeed, he added.\nTouting the BRI’s success, officials said projects such as the high-speed rail between Jakarta and Bandung, the Phnom Penh-Sihanoukville Expressway, and the Greek port of Piraeus have increased connectivity, rejuvenating the local economies with jobs and trade.\n“In the next step, the NDRC will work with relevant departments… (and) continue to build high-quality landmark projects, promote ‘small but beautiful’ projects, deepen cooperation in key areas such as infrastructure and people’s livelihood projects to achieve complementary advantages, mutual benefits and win-win results,” Mr Cong&nbsp;said.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nBelt and Road Initiative\nEnvironmental issues\nThanks for sharing!",
        "date": "2023-09-26",
        "is_related": true,
        "title": "China unveils blueprint for global community of shared future",
        "is_title_contain_shared_future": true,
        "sentiment": "positive",
        "main_keywords": [
            [
                "Community of shared future",
                5
            ],
            [
                "Belt and Road Initiative",
                5
            ],
            [
                "China's influence",
                2
            ]
        ],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides a detailed analysis of China's policy paper on building a global community, discussing various aspects such as the Belt and Road Initiative, environmental concerns, and international relations. It includes multiple perspectives, quotes from officials, and contextual information, making it more comprehensive than a standard news report."
    },
    {
        "url": "https://straitstimes.com/asia/lula-struggles-to-revive-brazils-soft-power-amid-us-china-tensions",
        "content": "BRASILIA  -     Since he returned to office in January, Brazil's President Luiz Inacio Lula da Silva has traveled to 21 countries and met with more than 50 heads of state, including two kings and the Pope.\nThe globe-trotting leftist leader, the first head of state to address the United Nations General Assembly on Tuesday, has prioritized foreign trips in his third term so far, as he strives to restore his country as a global player.\n\"Brazil is back,\" he repeats in speeches across five continents, in contrast with the growing isolation that came with his predecessor Jair Bolsonaro's hard-right political stance and dismal environmental record.\nBut diplomats and foreign policy experts say Lula is far from restoring the \"soft power\" status Brazil enjoyed after his first two terms, from 2003 to 2010, when the country became a voice for the rising global south while remaining independent from both the U.S. and China.\nIn part, that reflects the choppier waters the 77-year-old Brazilian leader now navigates, as Beijing and Washington flirt with a new Cold War while war rages in Ukraine. Brazil has also become increasingly dependent on Asian markets, which buy half of its exports. China alone, Brazil's main trading partner, buys 37% of its farm exports.\n\"This is a very tricky balancing act and Lula so far has not been able to find the right equilibrium,\" said Oliver Stuenkel, an associate professor of international relations at the FGV think tank in Sao Paulo. \"There is a perception in Brazilian society now that he is tilting towards the Sino-Russian axis more than the West.\"\nOn Wednesday, Lula is scheduled to meet U.S. President Joe Biden to discuss the climate crisis on the sidelines of the U.N. General Assembly, focusing where the Brazilian leader has shined.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nLula has helped to restore Brazil's central role in climate diplomacy, leading a regional rainforest summit, drawing global contributions to protect the Amazon and overhauling policies to bring down deforestation sharply.\nEven before he took office, Lula was greeted like a rock star last November at the U.N. climate change conference in Egypt. His polices have helped to nearly halve deforestation of the Brazilian Amazon through August, compared to the first eight months of last year, rebuilding Brazil's credibility for climate talks.\nBut his comments about the war in Ukraine - he has said both sides are responsible for the conflict as he sought to broker a peace deal - have angered U.S. and European allies, who have accused him of parroting Russian rhetoric.\nLula's penchant for off-the cuff remarks have occasionally made matters worse.\nDuring a G20 meeting in India this month, he said there was \"no way\"&nbsp;Russian President Vladimir Putin would be arrested if he attended next year's summit in Rio de Janeiro. When reporters probed him on Brazil's commitments to enforce an arrest warrant issued by the International Criminal Court, he rowed back his comments but suggested Brazil could leave the ICC.\n\"There have been some bruising moments. The whole Russia -Ukraine issue was a lesson learned,\" said Thomas Shannon, a former U.S. ambassador to Brazil who is now senior international policy advisor at Arnold &amp;amp; Porter.\nAt last month's BRICS summit in South Africa, where the group of leading emerging economies expanded its membership as China called for, Brazil got Chinese backing for a permanent U.N. Security Council seat it wants. But that is unlikely to happen any time soon, according to Shannon.\nThe closer ties to Beijing could complicate Brazil's relationship with Washington, including access to key technology, Shannon added.\n'OUTDATED AGENDA'\nCloser to home, Lula has reaped little in concrete terms from Latin America's broad left-of-center alignment. The Mercosur trade bloc took nearly half a year to respond formally to a new European position on a trade deal now on the ropes.\nAnd Lula's longstanding sympathies with leftist governments in Nicaragua and Venezuela accused of human rights abuses have him looking out of step with a new generation of progressive Latin American leaders.\nLula rolled out the red carpet for Venezuelan President Nicolas Maduro in Brasilia at a regional summit in May, helping to bring the socialist leader out of isolation. Other leaders, including Chile's leftist President Gabriel Boric, criticized Maduro's presence.\nImpressions of ideological bias may hurt Brazil's image as the country returns to the international spotlight, putting Lula at odds sometimes with his Foreign Ministry, said Rubens Barbosa, a former Brazilian ambassador to London and Washington.\n\"Where is Brazil the defender of human rights? It's not clear what Brazil stands for today when it picks Putin and Maduro as allies,\" said a South American ambassador in Brasilia, who asked not to be identified.\n\"Brazil is rapidly wasting its soft power by trying to be an international player with an outdated agenda,\" he said. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBrazil\nVladimir Putin\nLatin America\nThanks for sharing!",
        "date": "2023-09-18",
        "is_related": true,
        "title": "Lula's Global Diplomacy: Balancing Act Between East and West",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": [],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides a detailed analysis of President Lula's foreign policy efforts, his international engagements, and the complexities of Brazil's geopolitical positioning. It includes multiple perspectives from diplomats and experts, discusses various events and their implications, and offers insights into Lula's challenges and strategies, which aligns with the characteristics of in-depth news."
    },
    {
        "url": "https://straitstimes.com/asia/se-asia/indonesia-vietnam-discuss-south-china-sea-security-evs-as-jokowi-visits",
        "content": "HANOI – The leaders of Indonesia and Vietnam highlighted security in the South China Sea and investments in Indonesia by\nelectric vehicle (EV) maker VinFast\nin joint statements after a meeting on Jan 1\n2,\nas President Joko Widodo visited Hanoi.\nThe two South-east Asian countries are strengthening their ties with corporate investments, more trade and closer cooperation on boosting security in the\ncontested South China Sea amid tensions with Beijing.\nVietnam’s President Vo Van Thuong stressed the importance of maintaining peace and stability in the South China Sea in a statement after he met Mr Widodo, widely known as Jokowi.\nThe two countries signed a memorandum of understanding (MOU) on fisheries cooperation. The text is not public, but it may address Vietnamese fishermen’s encroachments in other countries’ waters, which is a regular source of tension in the region.\nAhead of Mr Widodo’s trip, Indonesia’s Foreign Minister Retno Marsudi said the country was ready to work with other South-east Asian nations to finalise a long-delayed code of conduct for the South China Sea, a strategic waterway for trade and energy.\nA Vietnamese official confirmed the matter would be discussed in Hanoi during Mr Widodo’s visit.\nA South-east Asian code of conduct would be seen as a blow to China.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nBeijing and South-east Asian nations have been trying since 2002 to set up a framework to negotiate the code of conduct, but progress has been slow despite commitments by all parties to advance and expedite the process.\nIndonesia and Vietnam agreed in 2022 to recognise the boundaries of their exclusive economic zones in the South China Sea, a move that was seen as a challenge to Beijing, which claims almost the entire strategic trade route.\nIndonesia had previously said it planned to export gas to Vietnam from gas fields in the South China Sea.\n“We agreed to cooperate on energy transition,” Mr Widodo said in his statement alongside Mr Thuong.\nMore on this Topic\nVietnam’s&nbsp;top leader Nguyen Phu Trong misses meetings amid health concerns\nRussia’s dilemma in the South China Sea\nVinFast\nMr Widodo, who will visit VinFast’s EV factory in northern Vietnam on Jan 1\n3\n, praised the company’s plans to invest US$1.2 billion (S$1.6 billion) in a plant and other operations over the longer term in Indonesia.\nMr Thuong encouraged Indonesian firms to invest more in Vietnam, including in the banking sector.\nThe two nations also signed an MOU on information technology and communication cooperation.\nBilateral trade between the nations rose by 23 per cent to US$14.1 billion in 202\n3\nand the goal is for that to soon reach US$15 billion, the Vietnamese President said.\nMr Widodo’s visit to Hanoi is part of a larger South-east Asian trip including\na prior stop in the Philippines\nand an expected visit to Brunei this weekend, before Indonesian elections in Februar\ny\n.\nHe is expected to meet other Vietnamese leaders on Jan 1\n2\n, but contrary to normal practice, Mr Widodo is not scheduled to meet\nCommunist Party general secretary Nguyen Phu Trong\n, amid concerns about the elderly leader’s health.\nSince 2022, Vietnam has pursued a strategy of improving ties with global powers and partners, and Mr Thuong said he was confident formal relations could be boosted with Indonesia as well.\nREUTERS\nMore on this Topic\nVietnam EV maker VinFast to invest up to $2.66 billion in India\nAn inside look into VinFast, Vietnam's Tesla hopeful with lofty goals\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVietnam\nIndonesia\nJoko Widodo\nPoliticians\nDiplomacy\nThanks for sharing!",
        "date": "2024-01-12",
        "is_related": true,
        "title": "Leaders of Indonesia and Vietnam Highlight Security and Investments Amid South China Sea Tensions",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": [],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the meeting between the leaders of Indonesia and Vietnam, covering various aspects such as security in the South China Sea, corporate investments, and bilateral agreements. It contains more than 80 words and offers a comprehensive overview without delving into extensive analysis or multiple perspectives."
    },
    {
        "url": "https://straitstimes.com/opinion/why-the-west-should-not-dismiss-the-building-of-a-brics-wall",
        "content": "Back in February 2022, when Russia\nlaunched a full-scale military invasion of Ukraine,\nit was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah.\nYet for much of this week, Mr Putin will act as gracious host to dozens of heads of state and government from around the world attending a summit of\nthe so-called\nBrics, an intergovernmental association initially founded by Brazil, Russia, India and China, and then – after a brief interval – joined by South Africa.\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBrics\nChina\nRussia\nGeopolitics\nUS-China ties\nUS-Russia ties\nEmbargoes and economic sanctions\nUkraine\nBrazil\nThanks for sharing!",
        "date": "2024-10-21",
        "is_related": true,
        "title": "Back in February 2022, when Russia launched a full-scale military invasion of Ukraine, it was slapped with the most draconian economic sanctions imposed on any state since World War II, and President Vladimir Putin became an international pariah. Yet for much of this week, Mr Putin will act as gracious host to dozens of heads of state and government from around the world attending a summit of the so-called Brics, an intergovernmental association initially founded by Brazil, Russia, India and China, and then – after a brief interval – joined by South Africa.",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [],
        "article_type": "Medium News",
        "article_type_reason": "The content provides a concise overview of the geopolitical context surrounding Russia's hosting of the Brics summit, mentioning significant events and implications without going into extensive detail or analysis."
    },
    {
        "url": "https://straitstimes.com/asia/putin-arrives-in-kazakhstan-for-russia-china-dominated-sco-summit",
        "content": "ASTANA - Russian President Vladimir Putin and China's Xi Jinping hailed  their Eurasian security club on Wednesday as a force for global stability at a summit of the regional body, which is seen by Moscow and Beijing as a tool to counter Western influence.\nPutin and the Chinese president have expanded the Shanghai Cooperation Organisation (SCO), a club founded in 2001 with Russia, China and Central Asian nations, to include India, Iran and Pakistan as a counterweight to the West.\n\"The organisation has firmly established itself as one of the key pillars of a fair, multipolar world order,\" Putin said, adding that bilateral ties between Moscow and Beijing were at their best in history.\n\"Our cooperation is not aimed against anyone, we are not creating any blocs or alliances, we are just acting in the interests of our peoples,\" Putin said.\nIn his opening remarks, Xi told Putin that China and Russia should \"uphold the original aspiration of friendship for generations\" in response to an \"ever-changing international situation\".\nCalling Putin an \"old friend\", Xi alluded to the progress the two countries had made in putting in place \"plans and arrangements for the next development of bilateral relations\".\nThe Kremlin said Putin had held a series of bilateral meetings on the sidelines of the SCO summit, which is taking place in Astana, capital of Kazakhstan, and ends on Thursday.\nST Asian Insider: Malaysia Edition\nGet exclusive insights into Malaysia in weekly round-up\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nThe SCO promotes common approaches to external security threats such as drug trafficking and also focuses on countering any domestic instability.\nAhead of his meeting with Xi, Putin met Turkish President Tayyip Erdogan, Pakistani Prime Minister Shehbaz Sharif, and the presidents of Azerbaijan and Mongolia, Ilham Aliyev and Ukhnaagiin Khurelsukh.\nIndia said Prime Minister Narendra Modi, who is expected in Moscow later this month, would not attend the Astana gathering, sending Foreign Minister Subrahmanyam Jaishankar instead.\n'NO LIMITS' PARTNERSHIP\nChina and Russia declared a \"no limits\" partnership in February 2022 when Putin visited Beijing, days before he sent tens of thousands of troops into Ukraine. Since then, Xi and Putin have deepened relations.\nXi and Putin believe the U.S-dominated post-Cold War era is crumbling. The U.S. casts China as its biggest competitor and Russia as its biggest nation-state threat. U.S. President Joe Biden says this century will be defined by an existential contest between democracies and autocracies.\nAt last year's virtual summit, the group criticised what it called the negative impact of \"unilateral and unlimited expansion of global missile defence systems by certain countries or groups of countries\", without directly referring to NATO expansion or Western military assistance to Ukraine.\nIn a move that highlighted Beijing's pragmatic economy- driven approach, Xi presided over a ceremony on Wednesday with his Kazakh counterpart just hours before meeting Putin, to mark the departure of a fresh batch of cargo along the Trans-Caspian International Transport Route.\nThe route, also known as the Middle Corridor, starts in southeast Asia and China, runs through Kazakhstan, the Caspian Sea, Azerbaijan, Georgia and further to Europe. It has been heavily promoted by the West as an alternative to Asia-Europe land transit via Russia.\nBelarus will attend the Astana summit for the first time as a full member of the SCO, the Kremlin said. United Nations Secretary-General Antonio Guterres is also expected to attend the Astana gathering. REUTERS\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nVladimir Putin\nChina\nXi Jinping\nThanks for sharing!",
        "date": "2024-07-03",
        "is_related": true,
        "title": "Putin and Xi hail Eurasian security club as force for global stability",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about the summit between Putin and Xi, their statements, the context of the Shanghai Cooperation Organisation, and the geopolitical implications of their partnership. It exceeds the word count for short news and includes multiple perspectives, making it more than just a concise report."
    },
    {
        "url": "https://straitstimes.com/business/china-ev-dream-came-true-10-years-on-walls-are-going-up",
        "content": "Hong Kong\n–\nTen years ago almost to the day, while checking out a handful of luxury sedans from one of China’s largest automakers, SAIC Motor, President Xi Jinping gave a pivotal speech that would set China on the course to dominate the electric vehicle (EV) industry.\nThe path to becoming a strong automaking nation lies in developing new energy vehicles, Mr Xi said, according to a Xinhua report in 2014. Claiming a head start, or “high ground”, in this sector is key to the global competition, he said.\nIn 2014, China sold around 75,000 EVs and hybrids, and exported about 533,000 cars. The domestic market was dominated by international manufacturers such as Volkswagen and General Motors, which were allowed to enter by forming joint ventures with local players in the 1980s and 1990s.\nThis helped China transform from a bike-riding nation to a car-driving one. Home-grown carmakers and brands that did not work with foreign partners were seen as inferior and lagging behind in engine and other automotive technologies.\nTo get ahead and tackle environmental challenges, Beijing bet on fuel-efficient and alternative energy vehicles. The state had published a guideline in 2012 that established ways to develop the industry by setting sales goals, providing subsidies and allocating resources for building EV charging infrastructure, among other things.\nMr Xi’s speech two years later signalled China’s determination to use this as a way to leapfrog traditional Western and Asian auto powerhouses, in particular Japan, home to Toyota Motor.\nWith the stage set, China needed a catalyst to spur consumer interest in EVs, which in the early 2010s were mostly cheap cars with short ranges. That ended up being Tesla, which became the first foreign automaker to set up a wholly owned operation in China.\nGet tips to boost your career, money and lifestyle\nThank you!\nSign up\nBy signing up, I accept SPH Media's\nTerms &amp; Conditions\nand\nPrivacy Policy\nas amended from time to time.\nYes, I would also like to receive SPH Media Group's\nSPH Media Limited, its related corporations and affiliates as well as their agents and authorised service providers.\nmarketing and promotions.\nWith that special permission, Tesla completed its Shanghai factory in 2019. Its entry into the market motivated local players to come up with better EVs with longer ranges.\nFast-forward to 2024, China has become the world’s largest auto market and sells more electrified vehicles than any other country, with 9.5 million cars delivered\nin 2023\n. It also controls the majority of the battery supply chain.\nHome-grown champion BYD dethroned Volkswagen to become the best-selling brand in China and, in the last quarter of 2023, surpassed Tesla as the world’s largest producer of EVs. China also overtook Japan as the largest auto exporter, sending 4.14 million units abroad, with 1.55 million of them being EVs or plug-in hybrids.\nThe achievements prove that\nBeijing’s industrial policy and investments have paid off. But they are also adding to tensions with the West. China’s success in EVs, which could disrupt traditional auto supply chains that employ millions of people, has become a key source of discomfort in Washington and Brussels.\nAs a price war at home and slowing growth drive Chinese automakers to search for buyers for its affordable and tech-laden EVs elsewhere, they are running into trade barriers, especially in the European Union and the US, which are meanwhile trying to develop their own EV supply chains. Both have accused China of exporting its excess capacity.\nThe US has quadrupled import tariffs on Chinese cars to more than 100 per cent, while the EU is investigating Chinese EVs to see if there has been an unfair advantage from government subsidies.\nBrazil recently removed a tax break on imported EVs and even Russia, arguably Beijing’s strongest ally and the largest destination for Chinese auto exports since the war with Ukraine, has asked Chinese carmakers to consider localising production.\nBeijing has threatened to hit back, with the China Chamber of Commerce to the EU saying on May 22 that the import tariffs on cars with large engines may be raised to 25 per cent from 15 per cent. There is a June 5 deadline for the EU to inform Chinese EV exporters of preliminary findings and whether tariffs will be imposed.\nSAIC\n, the state-owned manufacturer whose facility Mr Xi visited 10 years ago,\nhappens to be one of three Chinese automakers, along with BYD and Zhejiang Geely Holding Group, selected for further scrutiny by the EU in its anti-subsidy investigation. SAIC owns British-origin MG, which is one of the top-selling EV brands in Europe.\nAt an event on\nMay 24\nmarking the 10th anniversary of Mr Xi’s speech, SAIC officials, including chief engineer Zu Sijie, said they have remembered the President’s instructions well, and the company has consistently innovated around technologies like smart driving and connected cars.\nMr Li Zheng, co-founder of SAIC Qingtao New Energy Technology, a battery start-up backed by SAIC, took the opportunity to promise that executives will not be complacent\nas EV competition rises\n, noting that progress in solid-state batteries, which have a higher energy density and reduced fire risk, will be one way for China to maintain its edge.\n“New energy vehicles have become a strategic industry, fiercely contested by countries around the world,” Mr Li said. “They’re a key supporting force to our country’s revitalisation of green sectors.”\nA lot can happen in 10 years, but with SAIC having invested about 150 billion yuan (S$28.5 billion) in research and development over the past decade alone, even despite trade wars, 2034 looks bright.\nBLOOMBERG\nMore on this Topic\nChina EV makers taking longer to pay bills amid rising stress\n‘Bloodbath looms’ in China’s overcrowded EV industry\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nChina\nElectric and hybrid vehicles\nXi Jinping\nThanks for sharing!",
        "date": "2024-05-27",
        "is_related": true,
        "title": "China's EV Industry: A Decade of Growth and Global Tensions",
        "is_title_contain_shared_future": false,
        "sentiment": "concerned",
        "main_keywords": [],
        "article_type": "In-depth News",
        "article_type_reason": "The article provides a detailed analysis of China's electric vehicle industry over the past decade, including historical context, key developments, and multiple perspectives on the implications of China's success in the EV market. It discusses the impact of government policies, market dynamics, and international trade tensions, making it more comprehensive than a standard news report."
    },
    {
        "url": "https://straitstimes.com/world/while-you-were-sleeping-5-stories-you-might-have-missed-oct-30-2024",
        "content": "Three-person crew blasts off for China’s Tiangong space station\nThree Chinese astronauts including the country’s only woman spaceflight engineer blasted off on a “dream” mission to the Tiangong space station in the early hours of Oct 30.\nThe new Tiangong team will carry out experiments with an eye to the space programme’s ambitious goal of placing astronauts on the Moon by 2030 and eventually constructing a lunar base.\nThe Shenzhou-19 mission took off with its trio of space explorers from the Jiuquan Satellite Launch Center in northwest China, state news agency Xinhua and state broadcaster CCTV reported.\nREAD MORE HERE\nUK teen accused of Southport girls’ murder charged with possessing ricin, terrorism offence\nPolice said the incident was still not being treated as terrorist related.\nPHOTO: REUTERS\nA teenager accused of murdering three young girls in a knife attack in northern England in July has been further charged with a terrorism offence and the production of deadly poison ricin, police and prosecutors said on Oct 29.\nAxel Rudakubana, 18, is accused of killing the three young girls aged between six and nine at a Taylor Swift dance event in Southport, murders which shocked the nation and provoked days of rioting across the country.\nPolice said the incident was still not being treated as terrorist related but said after searches of his home, Rudakubana had now been charged with two further offences: production of a deadly biological toxin, ricin, and the possession of an al Qaeda training manual.\nREAD MORE HERE\nGaza humanitarian crisis could develop into famine, WFP says\nThe UN World Food Programmed called on Oct 29 for immediate action to avert famine in the Gaza Strip, warning that the humanitarian crisis there could soon worsen amid what it said were severe restrictions on aid flows.\nA global monitor warned this month that the whole of the Palestinian enclave remained at risk of famine, with Israeli military operations adding to concerns and hampering humanitarian access.\n“Now, as the situation in northern Gaza continues to deteriorate, the likelihood of a larger group being impacted by famine will surely increase unless conditions on the ground improve,” said WFP, the United Nations’ food agency.\nREAD MORE HERE\nGermany recalls envoy to Iran over execution of German-Iranian national\nGermany has recalled its ambassador to Iran over the execution of German-Iranian national Jamshid Sharmahd and summoned the Iranian charge d’affaires to voice Berlin’s protest, the German foreign office said on Oct 29.\n“We have sent our strongest protest against the actions of the Iranian regime reserve the right to take further action,” the foreign ministry said in a post on X.\nGermany’s ambassador in Teheran protested in the strongest possible terms against the killing of Sharmahd, the post said, adding that German Foreign Minister Annalena Baerbock had recalled the ambassador to Berlin for consultations.\nREAD MORE HERE\nIkea pledges cash to atone for East German forced labour\nIkea pledged Oct 29 to pay six million euros (S$8.59 million) into a hardship fund for victims of the East German dictatorship after admitting some of its suppliers used political prisoners as forced labourers.\nThe Swedish furniture giant handed over a declaration of intent to Evelyn Zupke, the top official in charge of atoning for the injustices of the former East German communist government.\nThe declaration was the result of “close exchanges over several years” between Ikea, the victims’ group UOKG and Zupke, who became the government commissioner on the issue in 2021, her office said in a statement.\nREAD MORE HERE\nAmorim set to be new Man Utd boss as Sporting confirm interest\nRuben Amorim is set to become the next manager of Manchester United with the Premier League club prepared to pay Sporting the 10 million euros (S$14.31 million) release clause, the Portuguese club said on Oct 29.\nThe news comes a day after the team sacked Erik ten Hag with United languishing in 14th place in the Premier League standings. The Portuguese coach could be in place for Sunday’s league game against Leicester City at Old Trafford.\n“Manchester United FC expressed interest in hiring coach Ruben Amorim, with Sporting’s board of directors referring to the terms and conditions set out in the employment contract in force between the company and the coach, specifically the respective termination clause and for the amount of Euro 10,000,000,” a statement from the Lisbon-based club said.\nREAD MORE HERE\nAlready a subscriber?&nbsp;\nLog in\nOur 12.12 Sale is here!\nStay informed with ST One Digital at $0.99/month for the first 6 months\nST One Digital Plan\n$9.90/month\n&nbsp;\n$0.99/month\nNo contract\nBilled at $0.99/month for the first 6 months, $9.90/month thereafter. T&amp;Cs apply.\nSubscribe now\n-->\n&nbsp;\n-->\nSubscriber-exclusive benefits:\nAccess all subscriber-only content on the ST app and straitstimes.com\nEasy access at any time via the ST app on one mobile device\nmyST: Follow up to 30 authors and 30 topics\n-->\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nBritain\nTerrorism\nGaza\nIsrael\nGermany\nIran\nIkea\nLabour issues\nManchester United\nThanks for sharing!",
        "date": "2024-10-29",
        "is_related": true,
        "title": "Three-person crew blasts off for China’s Tiangong space station",
        "is_title_contain_shared_future": false,
        "sentiment": "positive",
        "main_keywords": [],
        "article_type": "Medium News",
        "article_type_reason": "The content provides detailed information about multiple news events, each with sufficient context and background, but does not delve deeply into analysis or multiple perspectives, which would be characteristic of in-depth news."
    },
    {
        "url": "https://straitstimes.com/asia/italy-looks-to-use-g7-chair-to-boost-support-for-ukraine-scrutinise-ai",
        "content": "ROME  -     Italy will use its presidency of the Group of Seven major democracies to challenge growing perceptions that Russia is winning in Ukraine and that the West is tiring of the war, a source familiar with Italy's G7 plans said.\nItaly will chair the G7, which also groups the United States, Japan, Germany, Britain, France and Canada, throughout 2024 and will host a summit in June.\nLaying out Italy's priorities for the first time, the source said core issues on the leaders' agenda would include conflict in the Middle East, food security, climate change, development in Africa, engagement with China and Artificial Intelligence.\nAs in the last two G7 presidencies, the war in Ukraine will also be a major consideration, said the source, who was not authorised to go on the record talking about Italy's plans.\nThe West's once-staunch wartime support for Kyiv has appeared to waver in recent months amid political wrangling in Washington and Brussels that has held up the delivery of badly needed arms and funding.\nHowever, the source said G7 leaders were determined to show they remained fully committed to Kyiv and could not risk showing signs of weakness two years after Russia invaded its neighbour.\n\"We must change the narrative on Ukraine,\" the source said, adding that Russian President Vladimir Putin had lost significant financial, military and diplomatic clout since the invasion.\nItaly is planning to stage 20 ministerial meetings during its G7 presidency, kicking off with a three-day gathering from March 13-15 on industry, technology and digitalisation, which will put a spotlight on the fast-paced AI revolution.\nPrime Minister Giorgia Meloni has already said that the dangers posed by AI will be a key issue for Italy's G7 presidency and she will dedicate one session to the subject at the June 13-15 summit in Puglia, the source said.\nItaly wants to focus on the impact of AI on jobs and inequality, while also laying down \"ethical guardrails\" for the development of the technology. Rome will also propose creating a steering committee to ensure greater G7 coordination on AI.\nThe source said G7 leaders were \"pretty much on the same page\" over AI, adding that there was broad consensus on most of the major issues facing the wealthy-nation club, including on how to deal with China.\nThere was a determination on all sides to avoid tensions with Beijing, the source said, adding: \"Nobody wants to impede or put obstacles towards Chinese growth.\"\nThere was also agreement, the source said, on the need to develop economies in Africa and try to stem illegal immigration - a domestic priority for Meloni, who is struggling to honour an 2022 election pledge to stem migrant flows. REUTERS\nJoin\n&nbsp;\nST's Telegram channel\n&nbsp;\nand get the latest breaking news delivered to you.\nItaly\nVladimir Putin\nGiorgia Meloni\nThanks for sharing!",
        "date": "2024-01-23",
        "is_related": true,
        "title": "Italy to Use G7 Presidency to Challenge Perceptions on Ukraine and Engage with China",
        "is_title_contain_shared_future": false,
        "sentiment": "neutral",
        "main_keywords": [
            [
                "China's influence",
                1
            ],
            [
                "China's soft power",
                0
            ],
            [
                "Community of common destiny",
                0
            ],
            [
                "Community of shared future",
                0
            ],
            [
                "Belt and Road Initiative",
                0
            ],
            [
                "Asian Infrastructure Investment Bank",
                0
            ],
            [
                "Global Development Initiative",
                0
            ],
            [
                "Global Security Initiative",
                0
            ],
            [
                "Global Governance Initiative",
                0
            ],
            [
                "Global Civilization Initiative",
                0
            ],
            [
                "China dream",
                0
            ]
        ],
        "article_type": "Medium News",
        "article_type_reason": "The article provides detailed information about Italy's upcoming G7 presidency, including key issues on the agenda, the context of the war in Ukraine, and Italy's specific plans regarding AI and other topics. It exceeds the word count for short news and offers more depth than a concise summary."
    }
]